----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  U:\Yajuan\ACO Post Mortem\logs\003_Quality_Measures_paperuse_28 Sep 2021YS.log
  log type:  text
 opened on:  28 Sep 2021, 15:40:07

. 
. set matsize 5000

. set more off, perm
(set more preference recorded)

. set processors 4
    The maximum number of processors or cores being used is 4.  It can be set to any number
    between 1 and 4.

. **********/
. 
. 
. display "`c(current_time)' `c(current_date)'"
15:40:07 28 Sep 2021

. 
. use "U:\Yajuan\ACO Post Mortem\pay_qual_2012_2016_prelim.dta", clear

. 
. destring female race_g3 aco_true_death, replace
female already numeric; no replace
race_g3 already numeric; no replace
aco_true_death already numeric; no replace

. 
. global varlist3 i.age i.female i.race_g3 HCC1 HCC2 HCC6 HCC8 HCC9 HCC10 HCC11 HCC12 HCC17 HCC18 HC
> C19 HCC21 HCC22 HCC23 HCC27 HCC28 HCC29 HCC33 HCC34 HCC35 HCC39 HCC40 HCC46 HCC47 HCC48 HCC54 HCC5
> 5 HCC57 HCC58 HCC70 HCC71 HCC72 HCC73 HCC74 HCC75 HCC76 HCC77 HCC78 HCC79 HCC80 HCC82 HCC83 HCC84 
> HCC85 HCC86 HCC87 HCC88 HCC96 HCC99 HCC100 HCC103 HCC104 HCC106 HCC107 HCC108 HCC110 HCC111 HCC112
>  HCC114 HCC115 HCC122 HCC124 HCC134 HCC135 HCC136 HCC137 HCC157 HCC158 HCC161 HCC162 HCC166 HCC167
>  HCC169 HCC170 HCC173 HCC176 HCC186 HCC188 HCC189

. global outcomelist alldiabtest_ind eyeexam_ind hba1ctest_ind ldlcscreen_ind any_readm ed_visits /*
> mammo_ind readm acsc_ind bactpneumonia_ind chf_ind copd_asthma_ind*/

. 
. gen aco_fe = aco_num
(16,672,878 missing values generated)

. replace aco_fe="99999" if missing(aco_fe)
(16,672,878 real changes made)

. replace aco_fe=cluster_id if aco_death_active==1
(161,838 real changes made)

. 
. encode aco_fe, gen(aco_fe_num)

. 
. 
. destring ESRD, replace
ESRD: contains nonnumeric characters; no replace

. gen esrd_s = 0

. replace esrd_s = 1 if ESRD == "Y"
(159,654 real changes made)

. 
. destring provider_type, replace
provider_type: contains nonnumeric characters; no replace

. 
. gen providertype = .
(20,206,078 missing values generated)

. replace providertype = 0 if provider_type == "Both"
(1,358,867 real changes made)

. replace providertype = 1 if provider_type == "Hospital System"
(869,423 real changes made)

. replace providertype = 2 if provider_type == "Physician Group"
(1,215,924 real changes made)

. 
. gen aco_exit_gr = aco_death_dt
(19,716,480 missing values generated)

. replace aco_exit_gr=0 if aco_death_dt == .
(19,716,480 real changes made)

. 
. 
. 
. *tab aco_exit_year year if ever_in_aco==1 & aco_start_year == 2012
. 
. // tab aco_exit_year year if ever_in_aco==1 & aco_start_year < 2014
. //
. // logit hba1ctest_ind i.year ib0.aco_exit_year i.year##ib0.aco_exit_year $varlist3 i.providertype
>  n_pcp n_spec lives_covered if(ever_in_aco==1 & aco_start_year ==2012), vce(cluster cluster_id) or
>  dif iterate(100)
. // margins i.year#ib0.aco_exit_year
. //
. // marginsplot
. //
. // logit hba1ctest_ind i.year ib0.aco_exit_year i.year##ib0.aco_exit_year $varlist3 i.providertype
>  n_pcp n_spec lives_covered if(ever_in_aco==1 & inrange(aco_start_year,2012,2013)), vce(cluster cl
> uster_id) or dif iterate(100)
. // margins i.year#ib0.aco_exit_year
. //
. // marginsplot
. //
. //
. logit hba1ctest_ind i.year i.death_year $varlist3 i.providertype n_pcp n_spec lives_covered if(eve
> r_in_aco==1 & inrange(aco_start_year,2012,2013) & (aco_exit_gr==2014 | aco_exit_gr==0)), vce(clust
> er cluster_id) or dif iterate(100)

Iteration 0:   log pseudolikelihood = -102822.59  
Iteration 1:   log pseudolikelihood = -96413.732  
Iteration 2:   log pseudolikelihood = -95100.625  
Iteration 3:   log pseudolikelihood = -95094.754  
Iteration 4:   log pseudolikelihood = -95094.753  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(94)     =    9822.85
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -95094.753               Pseudo R2         =     0.0752

                            (Std. Err. adjusted for 298 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
hba1ctest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |    1.01155   .0272519     0.43   0.670     .9595228    1.066398
        2015  |   1.202856   .0606782     3.66   0.000     1.089619    1.327861
        2016  |    1.22332   .0397368     6.21   0.000     1.147864    1.303735
              |
   death_year |
           1  |    .643551   .0586766    -4.83   0.000      .538237    .7694712
           2  |   .6856488   .0644937    -4.01   0.000     .5702113    .8244563
              |
       agegrp |
           1  |   1.001048   .0152739     0.07   0.945     .9715554    1.031437
           2  |   .9395553   .0276901    -2.12   0.034     .8868214    .9954249
              |
     1.female |   1.175934   .0209167     9.11   0.000     1.135645    1.217653
              |
      race_g3 |
           1  |   .7179977   .0412384    -5.77   0.000     .6415551    .8035485
           2  |   .9704326   .0653935    -0.45   0.656     .8503669    1.107451
              |
         HCC1 |    1.11571   .1545032     0.79   0.429     .8505058    1.463611
         HCC2 |   .8871331   .0379791    -2.80   0.005     .8157329    .9647829
         HCC6 |    .821704    .077906    -2.07   0.038     .6823586    .9895053
         HCC8 |   .3687674   .0211295   -17.41   0.000     .3295952    .4125954
         HCC9 |   .7306006   .0346303    -6.62   0.000     .6657838    .8017276
        HCC10 |   .7937646    .042765    -4.29   0.000     .7142203    .8821678
        HCC11 |   .9551176   .0344433    -1.27   0.203     .8899404    1.025068
        HCC12 |   1.080404   .0318799     2.62   0.009     1.019693    1.144729
        HCC17 |   5.267821   .4837531    18.09   0.000     4.400111    6.306644
        HCC18 |   5.254338   .2855425    30.53   0.000     4.723459    5.844883
        HCC19 |   3.466986   .1499625    28.74   0.000     3.185179    3.773726
        HCC21 |   .6721262   .0379192    -7.04   0.000     .6017676    .7507111
        HCC22 |   1.104231   .0342425     3.20   0.001     1.039116    1.173426
        HCC23 |   1.020774   .0360949     0.58   0.561     .9524254    1.094028
        HCC27 |   .7006483   .0503488    -4.95   0.000     .6086008    .8066175
        HCC28 |   .8201281   .0595857    -2.73   0.006     .7112765    .9456382
        HCC29 |    1.05781   .1103813     0.54   0.590     .8621556    1.297865
        HCC33 |   .8752641   .0450953    -2.59   0.010      .791195    .9682661
        HCC34 |   1.065545   .1367413     0.49   0.621     .8285855    1.370271
        HCC35 |   .9601203   .0568094    -0.69   0.492     .8549897    1.078178
        HCC39 |   .8166064   .0422867    -3.91   0.000     .7377932    .9038387
        HCC40 |     .89902   .0306588    -3.12   0.002      .840894    .9611639
        HCC46 |   .7551179   .0658661    -3.22   0.001      .636455    .8959047
        HCC47 |   .7676284   .0384591    -5.28   0.000     .6958327    .8468321
        HCC48 |   .9841978   .0374878    -0.42   0.676     .9133987    1.060485
        HCC54 |   .7365672    .112695    -2.00   0.046     .5457305    .9941375
        HCC55 |   .9441264   .0999114    -0.54   0.587     .7672774    1.161737
        HCC57 |   .6429458   .0460053    -6.17   0.000     .5588144    .7397435
        HCC58 |     .83708    .026986    -5.52   0.000     .7858248    .8916783
        HCC70 |   .8010766   .1091457    -1.63   0.104     .6133365    1.046283
        HCC71 |   .7937191   .1099373    -1.67   0.095     .6050172    1.041276
        HCC72 |    .994045   .0692194    -0.09   0.932     .8672283    1.139406
        HCC73 |   .8149881   .2998485    -0.56   0.578     .3962591     1.67619
        HCC74 |   .7241234   .1239043    -1.89   0.059     .5178023    1.012654
        HCC75 |   .9691865   .0533008    -0.57   0.569     .8701521    1.079492
        HCC76 |   .8931569   .2161065    -0.47   0.641     .5558693    1.435102
        HCC77 |   .7115141   .0691128    -3.50   0.000     .5881692    .8607257
        HCC78 |   .6654116   .0374848    -7.23   0.000     .5958534    .7430899
        HCC79 |   .7060759   .0273196    -8.99   0.000     .6545105    .7617039
        HCC80 |   .7455321   .0903437    -2.42   0.015     .5879191     .945399
        HCC82 |   .8080984   .0867142    -1.99   0.047     .6548244    .9972492
        HCC83 |   .6851801   .1555343    -1.67   0.096     .4391208    1.069118
        HCC84 |   .7645674   .0297116    -6.91   0.000     .7084961    .8250762
        HCC85 |   .8344322   .0203902    -7.41   0.000     .7954102    .8753687
        HCC86 |   .8583963   .0412558    -3.18   0.001     .7812281    .9431871
        HCC87 |   .9788801    .038095    -0.55   0.583     .9069918    1.056466
        HCC88 |   .9845985   .0379686    -0.40   0.687     .9129241      1.0619
        HCC96 |   .8792499   .0195792    -5.78   0.000     .8417007    .9184743
        HCC99 |   .8593638   .0779589    -1.67   0.095     .7193804    1.026586
       HCC100 |   .8502224   .0294093    -4.69   0.000     .7944917    .9098624
       HCC103 |   .7546036   .0445844    -4.77   0.000     .6720896    .8472481
       HCC104 |   .7500198   .1142889    -1.89   0.059     .5563725    1.011067
       HCC106 |   .6935253   .0512427    -4.95   0.000      .600025    .8015954
       HCC107 |   .8670752   .0316358    -3.91   0.000     .8072353     .931351
       HCC108 |   .8886274   .0194252    -5.40   0.000     .8513588    .9275274
       HCC110 |   .6597325   .2734697    -1.00   0.316     .2927731    1.486636
       HCC111 |   .7606727   .0159697   -13.03   0.000      .730008    .7926256
       HCC112 |   .9052043    .048709    -1.85   0.064     .8145982    1.005888
       HCC114 |   .8456161   .0509125    -2.79   0.005     .7514922    .9515289
       HCC115 |   .9311317   .0960848    -0.69   0.489     .7606316     1.13985
       HCC122 |   1.127096    .074324     1.81   0.070     .9904444    1.282601
       HCC124 |   1.070563   .0949247     0.77   0.442     .8997828    1.273757
       HCC134 |   .7619532   .0456027    -4.54   0.000     .6776167    .8567863
       HCC135 |   .7468953   .0280831    -7.76   0.000     .6938327    .8040159
       HCC136 |   .7259739     .06103    -3.81   0.000     .6156921    .8560092
       HCC137 |   .7487059   .0528799    -4.10   0.000     .6519169     .859865
       HCC157 |   .6805811   .0940854    -2.78   0.005     .5190479    .8923851
       HCC158 |   .6333724   .0623021    -4.64   0.000     .5223122    .7680476
       HCC161 |   .7854101   .0320652    -5.92   0.000     .7250122    .8508396
       HCC162 |   1.242923   .6142608     0.44   0.660     .4718181    3.274264
       HCC166 |   1.067964   .5664439     0.12   0.901     .3776441    3.020164
       HCC167 |   .8600167   .0813012    -1.60   0.111     .7145606    1.035082
       HCC169 |   .7575293   .0501961    -4.19   0.000     .6652674    .8625863
       HCC170 |   .7284252   .0535249    -4.31   0.000     .6307226    .8412625
       HCC173 |   .9986287   .0947625    -0.01   0.988     .8291466    1.202754
       HCC176 |   .8409719   .0313413    -4.65   0.000     .7817339    .9046987
       HCC186 |   .9248402    .077782    -0.93   0.353     .7842923    1.090575
       HCC188 |   .7838915   .0566048    -3.37   0.001     .6804413    .9030697
       HCC189 |   .8160105   .0896682    -1.85   0.064     .6579009    1.012118
              |
 providertype |
           1  |   1.202398   .0944403     2.35   0.019     1.030842    1.402506
           2  |   1.239696   .0821794     3.24   0.001     1.088651    1.411696
              |
       n_pcps |   1.000122    .000189     0.64   0.520     .9997513    1.000492
       n_spec |   .9999279   .0000937    -0.77   0.442     .9997442    1.000112
lives_covered |   1.000002   1.25e-06     1.88   0.060     .9999999    1.000005
        _cons |   3.067813   .1779046    19.33   0.000     2.738212    3.437088
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. margins death_year

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(hba1ctest_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .8962992   .0025725   348.41   0.000     .8912571    .9013412
          1  |   .8514303   .0104762    81.27   0.000     .8308973    .8719633
          2  |    .858704    .010504    81.75   0.000     .8381165    .8792915
------------------------------------------------------------------------------

. 
. marginsplot

  Variables that uniquely identify margins: death_year

. 
. 
. 
. 
. //
. // logit hba1ctest_ind i.year ib0.aco_death_active i.year##ib0.aco_death_active $varlist3 i.provid
> ertype n_pcp n_spec lives_covered if(ever_in_aco==1 & inrange(aco_start_year,2012,2013)), vce(clus
> ter cluster_id) or dif iterate(100)
. //
. // margins i.year#ib0.aco_death_active
. //
. // marginsplot
. 
. capture program drop tests_aco_year_new_models

. program define tests_aco_year_new_models
  1. args outcome
  2. 
. /*All Years of Data*/
. di as text _dup(59) "*"
  3. di %~59s  "Oct 2019 New Models"
  4. di %~59s  "All Years of Data `outcome'"
  5. display "`c(current_time)' `c(current_date)'"
  6. di as text _dup(59) "*"
  7. 
. logit `outcome' i.year ib0.aco_death_active $varlist3 i.providertype n_pcp n_spec lives_covered if
>  (ever_in_aco==1 & inrange(aco_start_year,2012,2013) & (aco_exit_gr==2014 | aco_exit_gr==0)), vce(
> cluster cluster_id) or dif iterate(100)
  8. 
. 
. logit `outcome' i.year ib0.death_year $varlist3 i.providertype n_pcp n_spec lives_covered if (ever
> _in_aco==1 & inrange(aco_start_year,2012,2013) & (aco_exit_gr==2014 | aco_exit_gr==0)), vce(cluste
> r cluster_id) or dif iterate(100)
  9. margins death_year
 10. 
. 
. logit `outcome' i.year ib0.aco_death_active $varlist3 i.providertype n_pcp n_spec lives_covered if
>  (ever_in_aco==1 & inrange(aco_start_year,2012,2013) & (aco_exit_gr==2015 | aco_exit_gr==0)), vce(
> cluster cluster_id) or dif iterate(100)
 11. 
. 
. logit `outcome' i.year ib0.death_year $varlist3 i.providertype n_pcp n_spec lives_covered if (ever
> _in_aco==1 & inrange(aco_start_year,2012,2013) & (aco_exit_gr==2015 | aco_exit_gr==0)), vce(cluste
> r cluster_id) or dif iterate(100)
 12. margins death_year
 13. 
. 
. logit `outcome' i.year ib0.aco_exit_gr i.year##ib0.aco_exit_gr $varlist3 i.providertype n_pcp n_sp
> ec lives_covered if(ever_in_aco==1 & inrange(aco_start_year,2012,2013) & (aco_exit_gr==2014 | aco_
> exit_gr==0)), vce(cluster cluster_id) or dif iterate(100)
 14. margins i.year##ib0.aco_exit_gr
 15. 
. 
. logit `outcome' i.year ib0.aco_exit_gr i.year##ib0.aco_exit_gr $varlist3 i.providertype n_pcp n_sp
> ec lives_covered if(ever_in_aco==1 & inrange(aco_start_year,2012,2013) & (aco_exit_gr==2015 | aco_
> exit_gr==0)), vce(cluster cluster_id) or dif iterate(100)
 16. margins i.year##ib0.aco_exit_gr
 17. 
. end

. 
. 
.         foreach varb of global outcomelist{
  2. 
.         tests_aco_year_new_models `varb'
  3.         
.                 }
***********************************************************
                    Oct 2019 New Models                    
             All Years of Data alldiabtest_ind             
16:32:40 28 Sep 2021
***********************************************************

Iteration 0:   log pseudolikelihood = -212295.38  
Iteration 1:   log pseudolikelihood = -204691.41  
Iteration 2:   log pseudolikelihood = -204658.94  
Iteration 3:   log pseudolikelihood = -204658.94  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(93)     =   20324.87
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -204658.94               Pseudo R2         =     0.0360

                                 (Std. Err. adjusted for 298 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
   alldiabtest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   .9713403   .0274471    -1.03   0.303     .9190075    1.026653
             2015  |   1.102661   .0683735     1.58   0.115     .9764742    1.245154
             2016  |    .961989   .0288834    -1.29   0.197     .9070121    1.020298
                   |
1.aco_death_active |   .7985699    .064425    -2.79   0.005     .6817762    .9353713
                   |
            agegrp |
                1  |   1.203725   .0143824    15.52   0.000     1.175864    1.232247
                2  |   1.268426   .0216472    13.93   0.000     1.226701    1.311572
                   |
          1.female |   1.235211   .0128751    20.27   0.000     1.210232    1.260705
                   |
           race_g3 |
                1  |   .7823123   .0396737    -4.84   0.000     .7082929    .8640671
                2  |    1.03806   .0345777     1.12   0.262     .9724534    1.108092
                   |
              HCC1 |   1.029086    .146381     0.20   0.840     .7787064    1.359972
              HCC2 |   .8600751   .0225099    -5.76   0.000      .817069    .9053448
              HCC6 |   1.086397   .0704216     1.28   0.201     .9567815    1.233572
              HCC8 |   .5431758   .0248276   -13.35   0.000     .4966306    .5940832
              HCC9 |   .9009878   .0316811    -2.97   0.003     .8409854    .9652713
             HCC10 |   .9761574   .0355435    -0.66   0.507     .9089212    1.048367
             HCC11 |   1.032061   .0285975     1.14   0.255     .9775062    1.089661
             HCC12 |   1.215853   .0205797    11.55   0.000      1.17618    1.256865
             HCC17 |   2.312261   .1090952    17.77   0.000     2.108026    2.536282
             HCC18 |   2.547642   .0673747    35.36   0.000     2.418954    2.683177
             HCC19 |   1.681227    .042337    20.63   0.000     1.600263    1.766288
             HCC21 |   .7642471   .0374174    -5.49   0.000     .6943191    .8412179
             HCC22 |   1.028446   .0189172     1.52   0.127     .9920295      1.0662
             HCC23 |   1.089653   .0237591     3.94   0.000     1.044067    1.137229
             HCC27 |   .7294681   .0401939    -5.72   0.000     .6547943    .8126579
             HCC28 |   .8649252   .0411205    -3.05   0.002     .7879714    .9493943
             HCC29 |   1.084359   .0578018     1.52   0.129     .9767864    1.203778
             HCC33 |   .9455166   .0306577    -1.73   0.084     .8872982    1.007555
             HCC34 |   .9306669   .0724927    -0.92   0.356     .7988981    1.084169
             HCC35 |   1.127074    .049262     2.74   0.006     1.034542    1.227882
             HCC39 |   .8631705    .035185    -3.61   0.000      .796892    .9349615
             HCC40 |   1.102872   .0257534     4.19   0.000     1.053534    1.154521
             HCC46 |   .9421917   .0560448    -1.00   0.317     .8385074    1.058697
             HCC47 |   .9516876   .0356872    -1.32   0.187     .8842504    1.024268
             HCC48 |   1.043343   .0238394     1.86   0.063      .997649    1.091129
             HCC54 |   .6448033   .0826695    -3.42   0.001     .5015285    .8290083
             HCC55 |   .8727484   .0599158    -1.98   0.047     .7628735    .9984485
             HCC57 |   .6732918   .0438764    -6.07   0.000     .5925611    .7650213
             HCC58 |    .885531    .021554    -4.99   0.000     .8442777       .9288
             HCC70 |   .6916449   .0780244    -3.27   0.001     .5544459    .8627942
             HCC71 |   .7367963   .0798331    -2.82   0.005     .5958244     .911122
             HCC72 |   1.021175     .05714     0.37   0.708     .9151049    1.139539
             HCC73 |   .6234383   .1561751    -1.89   0.059     .3815596    1.018649
             HCC74 |   .9434788   .1665822    -0.33   0.742     .6674867    1.333588
             HCC75 |   1.056216   .0351381     1.64   0.100     .9895436     1.12738
             HCC76 |   1.073171    .281823     0.27   0.788     .6414117    1.795565
             HCC77 |   .9219285   .0657646    -1.14   0.254     .8016372     1.06027
             HCC78 |   .8177473   .0391177    -4.21   0.000     .7445623    .8981258
             HCC79 |   .8313388   .0249577    -6.15   0.000     .7838339    .8817228
             HCC80 |   .8840836   .0856421    -1.27   0.203     .7312006    1.068932
             HCC82 |   .7556174   .0655529    -3.23   0.001     .6374657    .8956681
             HCC83 |   1.001317   .2155938     0.01   0.995     .6565972    1.527017
             HCC84 |   .7935638   .0197806    -9.28   0.000     .7557264    .8332957
             HCC85 |   .8495608   .0138687    -9.99   0.000      .822809    .8771825
             HCC86 |   .9017007   .0323048    -2.89   0.004     .8405562     .967293
             HCC87 |   1.045898     .03116     1.51   0.132     .9865742    1.108789
             HCC88 |   1.111806   .0311836     3.78   0.000     1.052337    1.174636
             HCC96 |    .996038   .0146348    -0.27   0.787     .9677635    1.025139
             HCC99 |   .8809884   .0569127    -1.96   0.050     .7762145    .9999047
            HCC100 |   .8800467    .021176    -5.31   0.000     .8395061    .9225451
            HCC103 |   .7132696   .0317681    -7.59   0.000     .6536455    .7783325
            HCC104 |   .8796212   .1015156    -1.11   0.266     .7015521    1.102888
            HCC106 |   .7326954   .0354644    -6.43   0.000     .6663817    .8056082
            HCC107 |   .9308256   .0255914    -2.61   0.009     .8819949    .9823597
            HCC108 |   1.030664   .0136028     2.29   0.022     1.004345    1.057673
            HCC110 |   .3811494   .0926676    -3.97   0.000     .2366712    .6138259
            HCC111 |   .7754983   .0136282   -14.47   0.000     .7492422    .8026745
            HCC112 |   1.132634   .0410293     3.44   0.001     1.055006    1.215973
            HCC114 |   .9581517   .0497786    -0.82   0.411     .8653902    1.060856
            HCC115 |   .9190925   .0706439    -1.10   0.272     .7905577    1.068525
            HCC122 |   2.190239   .0719086    23.88   0.000      2.05374    2.335811
            HCC124 |   3.176296    .210635    17.43   0.000     2.789162    3.617163
            HCC134 |   .4452069   .0203304   -17.72   0.000     .4070912    .4868913
            HCC135 |   .7663121   .0155208   -13.14   0.000     .7364879    .7973442
            HCC136 |   .7834314   .0392902    -4.87   0.000     .7100877    .8643506
            HCC137 |   .8434496   .0325203    -4.42   0.000     .7820599    .9096584
            HCC157 |   .7052982   .1012851    -2.43   0.015     .5322738     .934567
            HCC158 |   .6847876   .0679194    -3.82   0.000     .5638078    .8317268
            HCC161 |   .8644386    .023789    -5.29   0.000     .8190481    .9123446
            HCC162 |   1.020361   .3558806     0.06   0.954     .5150771     2.02132
            HCC166 |   .5386937    .190578    -1.75   0.080     .2692808    1.077652
            HCC167 |   1.023679   .0626349     0.38   0.702     .9079926    1.154106
            HCC169 |   .8475451   .0390638    -3.59   0.000     .7743379    .9276735
            HCC170 |   .8051662   .0422727    -4.13   0.000     .7264336    .8924322
            HCC173 |   1.045845   .0651922     0.72   0.472     .9255671    1.181752
            HCC176 |   .9664773   .0265862    -1.24   0.215     .9157492    1.020016
            HCC186 |   .9489301   .0660763    -0.75   0.452     .8278717    1.087691
            HCC188 |   .7728448   .0407186    -4.89   0.000     .6970202    .8569178
            HCC189 |   .6831402   .0421263    -6.18   0.000     .6053686    .7709031
                   |
      providertype |
                1  |   1.194746   .1413745     1.50   0.133     .9474426    1.506602
                2  |   1.119973   .0669253     1.90   0.058     .9961923    1.259135
                   |
            n_pcps |   .9999266   .0001167    -0.63   0.530     .9996979    1.000155
            n_spec |   .9999752   .0000515    -0.48   0.629     .9998742    1.000076
     lives_covered |   1.000004   1.32e-06     2.70   0.007     1.000001    1.000006
             _cons |   .4768754   .0307615   -11.48   0.000     .4202396    .5411439
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -212295.38  
Iteration 1:   log pseudolikelihood = -204686.74  
Iteration 2:   log pseudolikelihood = -204654.27  
Iteration 3:   log pseudolikelihood = -204654.27  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(94)     =   19999.02
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -204654.27               Pseudo R2         =     0.0360

                              (Std. Err. adjusted for 298 clusters in cluster_id)
---------------------------------------------------------------------------------
                |               Robust
alldiabtest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           year |
          2014  |    .970976   .0273512    -1.05   0.296     .9188217    1.026091
          2015  |   1.111645   .0722765     1.63   0.104     .9786399    1.262726
          2016  |   .9582997   .0281661    -1.45   0.147     .9046552    1.015125
                |
     death_year |
             1  |   .7485879   .0710666    -3.05   0.002     .6214908     .901677
             2  |   .8566963   .0631554    -2.10   0.036      .741441    .9898677
                |
         agegrp |
             1  |   1.203416   .0144068    15.47   0.000     1.175508    1.231987
             2  |   1.268241   .0216468    13.92   0.000     1.226515    1.311385
                |
       1.female |   1.235233    .012871    20.27   0.000     1.210262    1.260719
                |
        race_g3 |
             1  |    .782357   .0396434    -4.84   0.000     .7083911     .864046
             2  |   1.038344   .0345441     1.13   0.258     .9727988    1.108305
                |
           HCC1 |   1.029358   .1463963     0.20   0.839     .7789469     1.36027
           HCC2 |   .8599436   .0225047    -5.77   0.000     .8169473    .9052029
           HCC6 |   1.086512   .0703513     1.28   0.200     .9570164    1.233529
           HCC8 |    .543189   .0248264   -13.35   0.000     .4966459    .5940939
           HCC9 |   .9009164   .0316784    -2.97   0.003     .8409189    .9651944
          HCC10 |   .9760929   .0355365    -0.66   0.506     .9088696    1.048288
          HCC11 |   1.032174   .0286108     1.14   0.253     .9775942    1.089802
          HCC12 |    1.21588   .0205859    11.55   0.000     1.176195    1.256905
          HCC17 |   2.312859   .1090021    17.79   0.000     2.108788    2.536677
          HCC18 |   2.547855   .0673134    35.40   0.000      2.41928    2.683262
          HCC19 |   1.681297   .0423129    20.64   0.000     1.600377    1.766308
          HCC21 |   .7642245   .0373797    -5.50   0.000     .6943637    .8411139
          HCC22 |   1.028434     .01893     1.52   0.128     .9919928    1.066213
          HCC23 |   1.089679    .023755     3.94   0.000     1.044101    1.137247
          HCC27 |   .7293167   .0401901    -5.73   0.000     .6546504    .8124991
          HCC28 |   .8649782   .0411214    -3.05   0.002     .7880226     .949449
          HCC29 |   1.084703   .0577764     1.53   0.127     .9771742    1.204065
          HCC33 |   .9456205   .0306496    -1.73   0.085     .8874167    1.007642
          HCC34 |   .9310652   .0725095    -0.92   0.359      .799264    1.084601
          HCC35 |   1.127012   .0492653     2.74   0.006     1.034474    1.227827
          HCC39 |   .8634129   .0351919    -3.60   0.000     .7971211    .9352178
          HCC40 |   1.102798   .0257326     4.19   0.000     1.053499    1.154404
          HCC46 |   .9418584   .0560389    -1.01   0.314     .8381866    1.058353
          HCC47 |   .9517547    .035686    -1.32   0.187     .8843197    1.024332
          HCC48 |   1.043428   .0238164     1.86   0.063     .9977773    1.091167
          HCC54 |   .6451173    .082689    -3.42   0.001     .5018045    .8293596
          HCC55 |   .8702212   .0596878    -2.03   0.043     .7607577     .995435
          HCC57 |   .6734921    .043868    -6.07   0.000     .5927743    .7652012
          HCC58 |   .8855732   .0215519    -4.99   0.000      .844324    .9288377
          HCC70 |   .6910932   .0779916    -3.27   0.001     .5539575    .8621777
          HCC71 |   .7366015   .0797775    -2.82   0.005     .5957217    .9107974
          HCC72 |   1.020497   .0570578     0.36   0.717     .9145756    1.138686
          HCC73 |   .6238823   .1562907    -1.88   0.060      .381826    1.019389
          HCC74 |   .9431934   .1665947    -0.33   0.741     .6671976    1.333359
          HCC75 |   1.056476   .0351578     1.65   0.099     .9897667    1.127681
          HCC76 |   1.072258   .2816327     0.27   0.791      .640808    1.794199
          HCC77 |   .9214942    .065788    -1.15   0.252     .8011669    1.059893
          HCC78 |   .8177398   .0391165    -4.21   0.000     .7445572    .8981157
          HCC79 |   .8312771   .0249511    -6.16   0.000     .7837845    .8816474
          HCC80 |   .8842078    .085679    -1.27   0.204     .7312631    1.069141
          HCC82 |   .7562797   .0655327    -3.22   0.001     .6381528    .8962728
          HCC83 |   .9996666   .2155265    -0.00   0.999     .6551451    1.525362
          HCC84 |   .7933882   .0197565    -9.29   0.000     .7555959    .8330707
          HCC85 |   .8496306   .0138772    -9.98   0.000     .8228625    .8772695
          HCC86 |   .9017623   .0323156    -2.89   0.004      .840598    .9673772
          HCC87 |    1.04615   .0311596     1.51   0.130     .9868267     1.10904
          HCC88 |   1.111972   .0311358     3.79   0.000     1.052591    1.174702
          HCC96 |   .9960295   .0146373    -0.27   0.787     .9677501    1.025135
          HCC99 |   .8813376   .0569312    -1.96   0.051     .7765292    1.000292
         HCC100 |   .8802068    .021172    -5.30   0.000     .8396735    .9226969
         HCC103 |   .7131932   .0317625    -7.59   0.000     .6535794    .7782444
         HCC104 |   .8803628   .1014815    -1.11   0.269     .7023307    1.103524
         HCC106 |   .7328046   .0354792    -6.42   0.000     .6664641    .8057487
         HCC107 |   .9308588   .0255709    -2.61   0.009      .882066    .9823505
         HCC108 |    1.03069   .0135911     2.29   0.022     1.004394    1.057676
         HCC110 |   .3817566   .0928429    -3.96   0.000     .2370146    .6148908
         HCC111 |    .775492   .0136259   -14.47   0.000     .7492405    .8026634
         HCC112 |   1.132737   .0410256     3.44   0.001     1.055116    1.216068
         HCC114 |   .9579009   .0497803    -0.83   0.408     .8651378     1.06061
         HCC115 |   .9196063   .0706546    -1.09   0.275     .7910482    1.069057
         HCC122 |    2.19005   .0719268    23.87   0.000     2.053518     2.33566
         HCC124 |   3.177711    .210605    17.44   0.000     2.790618    3.618498
         HCC134 |   .4452117   .0203341   -17.72   0.000     .4070894    .4869041
         HCC135 |   .7663899   .0155094   -13.15   0.000     .7365869    .7973988
         HCC136 |   .7835024   .0392877    -4.87   0.000     .7101628    .8644159
         HCC137 |   .8436397   .0325105    -4.41   0.000     .7822671    .9098272
         HCC157 |   .7056173   .1012911    -2.43   0.015     .5325734    .9348865
         HCC158 |   .6845465   .0678998    -3.82   0.000     .5636022    .8314444
         HCC161 |   .8644026   .0237832    -5.30   0.000     .8190229    .9122966
         HCC162 |   1.021771   .3560453     0.06   0.951     .5161129    2.022844
         HCC166 |   .5392527   .1907847    -1.75   0.081     .2695515    1.078805
         HCC167 |   1.024055   .0626494     0.39   0.698     .9083405    1.154511
         HCC169 |   .8476182   .0390939    -3.58   0.000     .7743568    .9278109
         HCC170 |   .8050744   .0422806    -4.13   0.000     .7263283    .8923579
         HCC173 |   1.045882   .0651692     0.72   0.472     .9256443    1.181738
         HCC176 |   .9666339   .0266068    -1.23   0.218     .9158673    1.020215
         HCC186 |   .9489608   .0660642    -0.75   0.452     .8279227    1.087694
         HCC188 |   .7728015   .0406934    -4.89   0.000     .6970216    .8568202
         HCC189 |   .6832519   .0421627    -6.17   0.000     .6054164    .7710943
                |
   providertype |
             1  |   1.195055   .1412981     1.51   0.132     .9478633    1.506712
             2  |   1.120047   .0668822     1.90   0.058     .9963409    1.259113
                |
         n_pcps |   .9999177   .0001176    -0.70   0.484     .9996871    1.000148
         n_spec |   .9999756   .0000515    -0.47   0.635     .9998746    1.000077
  lives_covered |   1.000004   1.38e-06     2.67   0.008     1.000001    1.000006
          _cons |   .4760251    .030895   -11.44   0.000      .419165    .5405983
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(alldiabtest_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .5125472   .0075741    67.67   0.000     .4977022    .5273922
          1  |    .443871   .0204412    21.71   0.000     .4038071     .483935
          2  |   .4757651   .0176798    26.91   0.000     .4411133    .5104168
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -223534.36  
Iteration 1:   log pseudolikelihood = -215730.91  
Iteration 2:   log pseudolikelihood = -215696.43  
Iteration 3:   log pseudolikelihood = -215696.42  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(93)     =   17920.72
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -215696.42               Pseudo R2         =     0.0351

                                 (Std. Err. adjusted for 313 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
   alldiabtest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   .9694837   .0257731    -1.17   0.244     .9202628    1.021337
             2015  |   1.075497   .0627838     1.25   0.212     .9592215    1.205867
             2016  |   .9542065   .0272183    -1.64   0.100     .9023234    1.009073
                   |
1.aco_death_active |   .9347985   .0633759    -0.99   0.320     .8184831    1.067644
                   |
            agegrp |
                1  |   1.199616   .0137984    15.82   0.000     1.172875    1.226968
                2  |   1.266513   .0209418    14.29   0.000     1.226126     1.30823
                   |
          1.female |   1.235393   .0123549    21.14   0.000     1.211413    1.259847
                   |
           race_g3 |
                1  |     .79584   .0379994    -4.78   0.000     .7247412    .8739138
                2  |   1.039595   .0326856     1.24   0.217     .9774661    1.105673
                   |
              HCC1 |   .9983445    .136943    -0.01   0.990     .7629938    1.306291
              HCC2 |   .8483212   .0209553    -6.66   0.000      .808228    .8904032
              HCC6 |   1.087632    .068175     1.34   0.180     .9618936    1.229807
              HCC8 |   .5425451   .0239423   -13.86   0.000     .4975912    .5915604
              HCC9 |   .9147094   .0311299    -2.62   0.009     .8556862    .9778038
             HCC10 |   .9675985   .0343939    -0.93   0.354     .9024822    1.037413
             HCC11 |   1.005873   .0279606     0.21   0.833      .952537    1.062195
             HCC12 |    1.20826   .0195886    11.67   0.000     1.170471     1.24727
             HCC17 |   2.324144   .1058058    18.53   0.000     2.125751    2.541052
             HCC18 |   2.529106   .0642293    36.54   0.000       2.4063    2.658178
             HCC19 |   1.669089   .0406604    21.03   0.000     1.591268    1.750715
             HCC21 |   .7684989   .0348624    -5.80   0.000     .7031194    .8399578
             HCC22 |   1.015544     .01893     0.83   0.408     .9791115    1.053332
             HCC23 |   1.085478   .0226946     3.92   0.000     1.041896    1.130883
             HCC27 |    .730902   .0396102    -5.78   0.000     .6572483    .8128097
             HCC28 |   .8567616   .0397447    -3.33   0.001     .7822999    .9383109
             HCC29 |   1.074615   .0590607     1.31   0.190     .9648749    1.196836
             HCC33 |   .9422382   .0296029    -1.89   0.058     .8859678    1.002082
             HCC34 |   .8869907   .0692985    -1.53   0.125     .7610561    1.033764
             HCC35 |   1.100557   .0462729     2.28   0.023       1.0135    1.195092
             HCC39 |   .8865418   .0343535    -3.11   0.002     .8217034    .9564963
             HCC40 |   1.102461   .0245054     4.39   0.000     1.055463    1.151552
             HCC46 |   .9427326   .0534836    -1.04   0.299     .8435245    1.053609
             HCC47 |   .9376953   .0349183    -1.73   0.084     .8716946    1.008693
             HCC48 |   1.033307   .0232335     1.46   0.145     .9887594    1.079863
             HCC54 |   .6754113   .0860172    -3.08   0.002     .5262151    .8669087
             HCC55 |   .8656656   .0597997    -2.09   0.037     .7560484    .9911758
             HCC57 |   .6957266   .0441024    -5.72   0.000     .6144415    .7877649
             HCC58 |   .8877622   .0210659    -5.02   0.000     .8474191    .9300258
             HCC70 |   .6882572   .0799031    -3.22   0.001     .5481894    .8641136
             HCC71 |   .7004368   .0721553    -3.46   0.001     .5723777    .8571468
             HCC72 |   1.008936   .0559666     0.16   0.873     .9049961    1.124814
             HCC73 |   .7087704   .1747627    -1.40   0.163     .4371429    1.149179
             HCC74 |   .9857623   .1708217    -0.08   0.934     .7018889    1.384446
             HCC75 |   1.066241   .0334624     2.04   0.041     1.002632    1.133885
             HCC76 |   1.106429   .2709895     0.41   0.680     .6846129    1.788142
             HCC77 |   .9731136   .0665507    -0.40   0.690     .8510408    1.112696
             HCC78 |   .8316347   .0377559    -4.06   0.000     .7608312    .9090271
             HCC79 |   .8408979   .0242906    -6.00   0.000      .794612    .8898801
             HCC80 |   .8641202   .0835992    -1.51   0.131     .7148663    1.044536
             HCC82 |    .696349   .0587915    -4.29   0.000     .5901488    .8216605
             HCC83 |     1.1157   .2393373     0.51   0.610     .7327397    1.698811
             HCC84 |   .8046937   .0203977    -8.57   0.000     .7656918    .8456823
             HCC85 |   .8463609   .0131945   -10.70   0.000     .8208912    .8726208
             HCC86 |   .8923193   .0314975    -3.23   0.001     .8326725    .9562387
             HCC87 |   1.060557   .0299674     2.08   0.037     1.003419    1.120949
             HCC88 |   1.108677   .0288221     3.97   0.000     1.053602    1.166632
             HCC96 |    1.00325   .0143406     0.23   0.820     .9755331    1.031754
             HCC99 |   .8807883   .0554811    -2.02   0.044      .778492    .9965268
            HCC100 |   .8830043   .0209826    -5.24   0.000     .8428223    .9251021
            HCC103 |   .7260659   .0297276    -7.82   0.000     .6700773    .7867326
            HCC104 |   .9278989    .105574    -0.66   0.511     .7424259    1.159707
            HCC106 |   .7442517   .0338098    -6.50   0.000     .6808501    .8135572
            HCC107 |   .9455887   .0272415    -1.94   0.052     .8936757    1.000517
            HCC108 |   1.032938   .0142897     2.34   0.019     1.005307    1.061329
            HCC110 |   .4443306   .1120202    -3.22   0.001     .2710876    .7282873
            HCC111 |   .7790767     .01302   -14.94   0.000     .7539713    .8050181
            HCC112 |    1.10376   .0386096     2.82   0.005     1.030622    1.182088
            HCC114 |   .9692555   .0500013    -0.61   0.545     .8760462    1.072382
            HCC115 |    .910019    .067926    -1.26   0.207     .7861669    1.053383
            HCC122 |   2.120971   .0720888    22.12   0.000     1.984283    2.267075
            HCC124 |   3.121963   .2041882    17.41   0.000      2.74635    3.548947
            HCC134 |   .4528213   .0199012   -18.03   0.000     .4154483    .4935562
            HCC135 |   .7734525   .0165202   -12.03   0.000     .7417418    .8065188
            HCC136 |    .801539   .0375372    -4.72   0.000     .7312429    .8785929
            HCC137 |   .8578571   .0315506    -4.17   0.000     .7981952    .9219785
            HCC157 |   .7694352   .1029486    -1.96   0.050     .5919477     1.00014
            HCC158 |   .6371959   .0626731    -4.58   0.000     .5254735    .7726719
            HCC161 |   .8576179   .0220045    -5.99   0.000     .8155563    .9018487
            HCC162 |   1.340647    .389425     1.01   0.313     .7586845    2.369013
            HCC166 |   .4323181   .1536768    -2.36   0.018       .21539    .8677235
            HCC167 |   1.013441   .0604229     0.22   0.823     .9016721    1.139065
            HCC169 |   .8126633    .037484    -4.50   0.000     .7424191    .8895538
            HCC170 |   .7889695   .0409465    -4.57   0.000     .7126626    .8734469
            HCC173 |   1.100562   .0679977     1.55   0.121     .9750419     1.24224
            HCC176 |   .9905719   .0264726    -0.35   0.723     .9400221     1.04384
            HCC186 |   .9943361   .0660044    -0.09   0.932      .873032    1.132495
            HCC188 |   .7499612   .0379887    -5.68   0.000     .6790814    .8282392
            HCC189 |   .6958959   .0420445    -6.00   0.000     .6181822    .7833792
                   |
      providertype |
                1  |   1.191701   .1378665     1.52   0.130      .949933    1.495002
                2  |   1.124318   .0620654     2.12   0.034     1.009022    1.252789
                   |
            n_pcps |   .9999643   .0001084    -0.33   0.742     .9997519    1.000177
            n_spec |   .9999708   .0000514    -0.57   0.570       .99987    1.000072
     lives_covered |   1.000003   1.26e-06     2.53   0.011     1.000001    1.000006
             _cons |   .4825265   .0301147   -11.68   0.000     .4269698    .5453121
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -223534.36  
Iteration 1:   log pseudolikelihood = -215730.91  
Iteration 2:   log pseudolikelihood = -215696.43  
Iteration 3:   log pseudolikelihood = -215696.42  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(93)     =   17920.72
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -215696.42               Pseudo R2         =     0.0351

                              (Std. Err. adjusted for 313 clusters in cluster_id)
---------------------------------------------------------------------------------
                |               Robust
alldiabtest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           year |
          2014  |   .9694837   .0257731    -1.17   0.244     .9202628    1.021337
          2015  |   1.075497   .0627838     1.25   0.212     .9592215    1.205867
          2016  |   .9542065   .0272183    -1.64   0.100     .9023234    1.009073
                |
   1.death_year |   .9347985   .0633759    -0.99   0.320     .8184831    1.067644
                |
         agegrp |
             1  |   1.199616   .0137984    15.82   0.000     1.172875    1.226968
             2  |   1.266513   .0209418    14.29   0.000     1.226126     1.30823
                |
       1.female |   1.235393   .0123549    21.14   0.000     1.211413    1.259847
                |
        race_g3 |
             1  |     .79584   .0379994    -4.78   0.000     .7247412    .8739138
             2  |   1.039595   .0326856     1.24   0.217     .9774661    1.105673
                |
           HCC1 |   .9983445    .136943    -0.01   0.990     .7629938    1.306291
           HCC2 |   .8483212   .0209553    -6.66   0.000      .808228    .8904032
           HCC6 |   1.087632    .068175     1.34   0.180     .9618936    1.229807
           HCC8 |   .5425451   .0239423   -13.86   0.000     .4975912    .5915604
           HCC9 |   .9147094   .0311299    -2.62   0.009     .8556862    .9778038
          HCC10 |   .9675985   .0343939    -0.93   0.354     .9024822    1.037413
          HCC11 |   1.005873   .0279606     0.21   0.833      .952537    1.062195
          HCC12 |    1.20826   .0195886    11.67   0.000     1.170471     1.24727
          HCC17 |   2.324144   .1058058    18.53   0.000     2.125751    2.541052
          HCC18 |   2.529106   .0642293    36.54   0.000       2.4063    2.658178
          HCC19 |   1.669089   .0406604    21.03   0.000     1.591268    1.750715
          HCC21 |   .7684989   .0348624    -5.80   0.000     .7031194    .8399578
          HCC22 |   1.015544     .01893     0.83   0.408     .9791115    1.053332
          HCC23 |   1.085478   .0226946     3.92   0.000     1.041896    1.130883
          HCC27 |    .730902   .0396102    -5.78   0.000     .6572483    .8128097
          HCC28 |   .8567616   .0397447    -3.33   0.001     .7822999    .9383109
          HCC29 |   1.074615   .0590607     1.31   0.190     .9648749    1.196836
          HCC33 |   .9422382   .0296029    -1.89   0.058     .8859678    1.002082
          HCC34 |   .8869907   .0692985    -1.53   0.125     .7610561    1.033764
          HCC35 |   1.100557   .0462729     2.28   0.023       1.0135    1.195092
          HCC39 |   .8865418   .0343535    -3.11   0.002     .8217034    .9564963
          HCC40 |   1.102461   .0245054     4.39   0.000     1.055463    1.151552
          HCC46 |   .9427326   .0534836    -1.04   0.299     .8435245    1.053609
          HCC47 |   .9376953   .0349183    -1.73   0.084     .8716946    1.008693
          HCC48 |   1.033307   .0232335     1.46   0.145     .9887594    1.079863
          HCC54 |   .6754113   .0860172    -3.08   0.002     .5262151    .8669087
          HCC55 |   .8656656   .0597997    -2.09   0.037     .7560484    .9911758
          HCC57 |   .6957266   .0441024    -5.72   0.000     .6144415    .7877649
          HCC58 |   .8877622   .0210659    -5.02   0.000     .8474191    .9300258
          HCC70 |   .6882572   .0799031    -3.22   0.001     .5481894    .8641136
          HCC71 |   .7004368   .0721553    -3.46   0.001     .5723777    .8571468
          HCC72 |   1.008936   .0559666     0.16   0.873     .9049961    1.124814
          HCC73 |   .7087704   .1747627    -1.40   0.163     .4371429    1.149179
          HCC74 |   .9857623   .1708217    -0.08   0.934     .7018889    1.384446
          HCC75 |   1.066241   .0334624     2.04   0.041     1.002632    1.133885
          HCC76 |   1.106429   .2709895     0.41   0.680     .6846129    1.788142
          HCC77 |   .9731136   .0665507    -0.40   0.690     .8510408    1.112696
          HCC78 |   .8316347   .0377559    -4.06   0.000     .7608312    .9090271
          HCC79 |   .8408979   .0242906    -6.00   0.000      .794612    .8898801
          HCC80 |   .8641202   .0835992    -1.51   0.131     .7148663    1.044536
          HCC82 |    .696349   .0587915    -4.29   0.000     .5901488    .8216605
          HCC83 |     1.1157   .2393373     0.51   0.610     .7327397    1.698811
          HCC84 |   .8046937   .0203977    -8.57   0.000     .7656918    .8456823
          HCC85 |   .8463609   .0131945   -10.70   0.000     .8208912    .8726208
          HCC86 |   .8923193   .0314975    -3.23   0.001     .8326725    .9562387
          HCC87 |   1.060557   .0299674     2.08   0.037     1.003419    1.120949
          HCC88 |   1.108677   .0288221     3.97   0.000     1.053602    1.166632
          HCC96 |    1.00325   .0143406     0.23   0.820     .9755331    1.031754
          HCC99 |   .8807883   .0554811    -2.02   0.044      .778492    .9965268
         HCC100 |   .8830043   .0209826    -5.24   0.000     .8428223    .9251021
         HCC103 |   .7260659   .0297276    -7.82   0.000     .6700773    .7867326
         HCC104 |   .9278989    .105574    -0.66   0.511     .7424259    1.159707
         HCC106 |   .7442517   .0338098    -6.50   0.000     .6808501    .8135572
         HCC107 |   .9455887   .0272415    -1.94   0.052     .8936757    1.000517
         HCC108 |   1.032938   .0142897     2.34   0.019     1.005307    1.061329
         HCC110 |   .4443306   .1120202    -3.22   0.001     .2710876    .7282873
         HCC111 |   .7790767     .01302   -14.94   0.000     .7539713    .8050181
         HCC112 |    1.10376   .0386096     2.82   0.005     1.030622    1.182088
         HCC114 |   .9692555   .0500013    -0.61   0.545     .8760462    1.072382
         HCC115 |    .910019    .067926    -1.26   0.207     .7861669    1.053383
         HCC122 |   2.120971   .0720888    22.12   0.000     1.984283    2.267075
         HCC124 |   3.121963   .2041882    17.41   0.000      2.74635    3.548947
         HCC134 |   .4528213   .0199012   -18.03   0.000     .4154483    .4935562
         HCC135 |   .7734525   .0165202   -12.03   0.000     .7417418    .8065188
         HCC136 |    .801539   .0375372    -4.72   0.000     .7312429    .8785929
         HCC137 |   .8578571   .0315506    -4.17   0.000     .7981952    .9219785
         HCC157 |   .7694352   .1029486    -1.96   0.050     .5919477     1.00014
         HCC158 |   .6371959   .0626731    -4.58   0.000     .5254735    .7726719
         HCC161 |   .8576179   .0220045    -5.99   0.000     .8155563    .9018487
         HCC162 |   1.340647    .389425     1.01   0.313     .7586845    2.369013
         HCC166 |   .4323181   .1536768    -2.36   0.018       .21539    .8677235
         HCC167 |   1.013441   .0604229     0.22   0.823     .9016721    1.139065
         HCC169 |   .8126633    .037484    -4.50   0.000     .7424191    .8895538
         HCC170 |   .7889695   .0409465    -4.57   0.000     .7126626    .8734469
         HCC173 |   1.100562   .0679977     1.55   0.121     .9750419     1.24224
         HCC176 |   .9905719   .0264726    -0.35   0.723     .9400221     1.04384
         HCC186 |   .9943361   .0660044    -0.09   0.932      .873032    1.132495
         HCC188 |   .7499612   .0379887    -5.68   0.000     .6790814    .8282392
         HCC189 |   .6958959   .0420445    -6.00   0.000     .6181822    .7833792
                |
   providertype |
             1  |   1.191701   .1378665     1.52   0.130      .949933    1.495002
             2  |   1.124318   .0620654     2.12   0.034     1.009022    1.252789
                |
         n_pcps |   .9999643   .0001084    -0.33   0.742     .9997519    1.000177
         n_spec |   .9999708   .0000514    -0.57   0.570       .99987    1.000072
  lives_covered |   1.000003   1.26e-06     2.53   0.011     1.000001    1.000006
          _cons |   .4825265   .0301147   -11.68   0.000     .4269698    .5453121
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    322,604
Model VCE    : Robust

Expression   : Pr(alldiabtest_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .5113436   .0070961    72.06   0.000     .4974355    .5252518
          1  |   .4952839   .0169311    29.25   0.000     .4620994    .5284683
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -212295.38  
Iteration 1:   log pseudolikelihood = -204656.18  
Iteration 2:   log pseudolikelihood =  -204623.7  
Iteration 3:   log pseudolikelihood =  -204623.7  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(96)     =   20492.47
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -204623.7               Pseudo R2         =     0.0361

                               (Std. Err. adjusted for 298 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
 alldiabtest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   .9655369   .0290834    -1.16   0.244     .9101845    1.024256
           2015  |   1.089346   .0717157     1.30   0.194      .957476    1.239377
           2016  |   .9437396   .0286313    -1.91   0.056     .8892591    1.001558
                 |
     aco_exit_gr |
           2014  |   .8244427   .0640655    -2.48   0.013     .7079712    .9600755
                 |
year#aco_exit_gr |
      2014 2014  |   1.059934   .0640326     0.96   0.335     .9415772    1.193167
      2015 2014  |   .9073606   .0697871    -1.26   0.206     .7803908    1.054989
      2016 2014  |   1.033325   .0534619     0.63   0.526     .9336796    1.143606
                 |
          agegrp |
              1  |   1.203167    .014405    15.45   0.000     1.175263    1.231734
              2  |   1.268145   .0216232    13.93   0.000     1.226465    1.311242
                 |
        1.female |   1.234743   .0128651    20.24   0.000     1.209783    1.260217
                 |
         race_g3 |
              1  |   .7820732   .0396818    -4.84   0.000     .7080406    .8638467
              2  |   1.036462   .0341413     1.09   0.277     .9716602    1.105585
                 |
            HCC1 |    1.02836   .1466639     0.20   0.845     .7775847    1.360013
            HCC2 |   .8605186   .0225804    -5.72   0.000     .8173807    .9059331
            HCC6 |   1.085451   .0702278     1.27   0.205      .956177    1.232203
            HCC8 |   .5425321   .0247973   -13.38   0.000     .4960436    .5933774
            HCC9 |   .9009416   .0316341    -2.97   0.003     .8410252    .9651266
           HCC10 |   .9758879   .0355468    -0.67   0.503     .9086463    1.048106
           HCC11 |   1.032354   .0286679     1.15   0.252     .9776678      1.0901
           HCC12 |   1.215457   .0205776    11.53   0.000     1.175788    1.256466
           HCC17 |    2.31154   .1086316    17.83   0.000     2.108138    2.534568
           HCC18 |    2.54896   .0671964    35.49   0.000     2.420602    2.684124
           HCC19 |    1.68239   .0422188    20.73   0.000     1.601644    1.767206
           HCC21 |   .7641124   .0372788    -5.51   0.000     .6944319    .8407849
           HCC22 |   1.027654   .0188799     1.48   0.138     .9913086    1.065332
           HCC23 |   1.090022   .0237407     3.96   0.000     1.044471    1.137561
           HCC27 |   .7292132   .0401661    -5.73   0.000     .6545896    .8123438
           HCC28 |   .8650659   .0411512    -3.05   0.002     .7880567    .9496004
           HCC29 |   1.083804   .0574056     1.52   0.129     .9769339    1.202364
           HCC33 |   .9461117   .0306781    -1.71   0.088     .8878545    1.008192
           HCC34 |    .930473   .0724527    -0.93   0.355     .7987735    1.083887
           HCC35 |   1.125774   .0492039     2.71   0.007     1.033351    1.226463
           HCC39 |    .862962   .0350907    -3.62   0.000     .7968548    .9345535
           HCC40 |    1.10278   .0257139     4.20   0.000     1.053516    1.154347
           HCC46 |   .9413376   .0560147    -1.02   0.310     .8377111    1.057783
           HCC47 |   .9517647   .0356621    -1.32   0.187     .8843731    1.024292
           HCC48 |   1.043499   .0236438     1.88   0.060     .9981722    1.090885
           HCC54 |   .6447219   .0825885    -3.43   0.001     .5015729    .8287258
           HCC55 |   .8690191   .0596428    -2.05   0.041     .7596427    .9941439
           HCC57 |   .6744244   .0439564    -6.04   0.000     .5935472     .766322
           HCC58 |   .8855084   .0215389    -5.00   0.000     .8442833    .9287464
           HCC70 |   .6905856    .078091    -3.27   0.001     .5533045    .8619276
           HCC71 |   .7358382   .0798247    -2.83   0.005     .5948985    .9101685
           HCC72 |   1.020479    .057075     0.36   0.717     .9145268    1.138705
           HCC73 |   .6235632   .1561832    -1.89   0.059     .3816638    1.018779
           HCC74 |   .9408569   .1662249    -0.35   0.730     .6654852    1.330175
           HCC75 |   1.056908   .0352382     1.66   0.097     .9900509    1.128281
           HCC76 |   1.067763   .2801087     0.25   0.803     .6385238    1.785552
           HCC77 |   .9234147   .0660495    -1.11   0.265     .8026246    1.062383
           HCC78 |   .8180382    .039171    -4.19   0.000      .744757    .8985299
           HCC79 |    .831073   .0249571    -6.16   0.000     .7835696    .8814562
           HCC80 |   .8847401   .0857831    -1.26   0.207     .7316181    1.069909
           HCC82 |   .7565874   .0655628    -3.22   0.001     .6384067    .8966456
           HCC83 |   1.004382   .2139313     0.02   0.984     .6615984    1.524765
           HCC84 |   .7944609   .0197732    -9.24   0.000     .7566363    .8341764
           HCC85 |   .8494395    .013841   -10.01   0.000     .8227403    .8770052
           HCC86 |   .9017401    .032268    -2.89   0.004     .8406628    .9672548
           HCC87 |   1.045854    .031221     1.50   0.133     .9864179    1.108872
           HCC88 |   1.111988    .030787     3.83   0.000     1.053255    1.173997
           HCC96 |   .9954498   .0146163    -0.31   0.756     .9672107    1.024514
           HCC99 |   .8813456    .057016    -1.95   0.051     .7763907    1.000489
          HCC100 |   .8815939   .0211627    -5.25   0.000     .8410765    .9240632
          HCC103 |   .7126221    .031756    -7.60   0.000     .6530221    .7776617
          HCC104 |   .8796447   .1015322    -1.11   0.267     .7015492    1.102952
          HCC106 |   .7337154   .0355327    -6.39   0.000     .6672757    .8067704
          HCC107 |   .9313155   .0254444    -2.60   0.009     .8827571     .982545
          HCC108 |   1.029775   .0135884     2.22   0.026     1.003483    1.056755
          HCC110 |   .3816918   .0930194    -3.95   0.000     .2367405    .6153938
          HCC111 |   .7758623   .0136162   -14.46   0.000     .7496289    .8030138
          HCC112 |   1.132026   .0409938     3.42   0.001     1.054464    1.215292
          HCC114 |   .9589301   .0499275    -0.81   0.421     .8659014    1.061953
          HCC115 |    .920452   .0708958    -1.08   0.282     .7914786    1.070442
          HCC122 |   2.189262   .0719302    23.85   0.000     2.052725    2.334881
          HCC124 |   3.180221   .2108703    17.45   0.000     2.792652    3.621577
          HCC134 |   .4449466   .0203193   -17.73   0.000     .4068517    .4866085
          HCC135 |   .7667811    .015539   -13.10   0.000     .7369221      .79785
          HCC136 |   .7845351   .0391364    -4.86   0.000     .7114597    .8651161
          HCC137 |    .843761   .0325264    -4.41   0.000     .7823592    .9099818
          HCC157 |     .70589   .1012345    -2.43   0.015      .532921    .9349992
          HCC158 |   .6843095   .0678636    -3.83   0.000     .5634277    .8311262
          HCC161 |     .86448   .0237245    -5.31   0.000     .8192093    .9122524
          HCC162 |   1.017538   .3552474     0.05   0.960     .5133044    2.017093
          HCC166 |   .5381405   .1903168    -1.75   0.080     .2690685    1.076288
          HCC167 |   1.023401   .0626163     0.38   0.705     .9077483    1.153788
          HCC169 |   .8471912     .03909    -3.59   0.000     .7739384    .9273774
          HCC170 |   .8052619   .0423145    -4.12   0.000     .7264548    .8926182
          HCC173 |   1.046673   .0651887     0.73   0.464      .926396    1.182566
          HCC176 |   .9666046   .0266395    -1.23   0.218     .9157772    1.020253
          HCC186 |   .9476457   .0659724    -0.77   0.440     .8267759    1.086186
          HCC188 |    .772247   .0407244    -4.90   0.000      .696415    .8563362
          HCC189 |   .6843188   .0422585    -6.14   0.000     .6063098    .7723647
                 |
    providertype |
              1  |   1.194585   .1412061     1.50   0.133     .9475469    1.506029
              2  |   1.129023   .0681307     2.01   0.044     1.003084    1.270774
                 |
          n_pcps |   .9999336   .0001175    -0.57   0.572     .9997034    1.000164
          n_spec |   .9999706    .000052    -0.57   0.571     .9998687    1.000072
   lives_covered |   1.000004   1.37e-06     2.58   0.010     1.000001    1.000006
           _cons |   .4838451   .0321031   -10.94   0.000     .4248436    .5510406
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(alldiabtest_ind), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |    .511296   .0064825    78.87   0.000     .4985905    .5240015
           2014  |   .5038576   .0074524    67.61   0.000     .4892512    .5184639
           2015  |   .5300967    .013743    38.57   0.000     .5031608    .5570325
           2016  |   .4980388   .0074474    66.87   0.000     .4834421    .5126354
                 |
     aco_exit_gr |
              0  |   .5138899   .0076539    67.14   0.000     .4988886    .5288912
           2014  |     .46741   .0177068    26.40   0.000     .4327054    .5021146
                 |
year#aco_exit_gr |
      2013    0  |    .514271   .0068475    75.10   0.000     .5008502    .5276918
      2013 2014  |   .4684116   .0170057    27.54   0.000      .435081    .5017422
      2014    0  |   .5059362   .0077063    65.65   0.000     .4908321    .5210402
      2014 2014  |   .4738959   .0208321    22.75   0.000     .4330656    .5147261
      2015    0  |   .5345661   .0144405    37.02   0.000     .5062633    .5628689
      2015 2014  |   .4656554   .0193505    24.06   0.000      .427729    .5035817
      2016    0  |   .5005073   .0077707    64.41   0.000     .4852771    .5157375
      2016 2014  |   .4624643   .0170044    27.20   0.000     .4291362    .4957924
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -223534.36  
Iteration 1:   log pseudolikelihood = -215706.09  
Iteration 2:   log pseudolikelihood = -215671.57  
Iteration 3:   log pseudolikelihood = -215671.57  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(96)     =   20580.41
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -215671.57               Pseudo R2         =     0.0352

                               (Std. Err. adjusted for 313 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
 alldiabtest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   .9672461   .0291427    -1.11   0.269     .9117813    1.026085
           2015  |   1.075782    .069822     1.13   0.260       .94728    1.221716
           2016  |   .9434481    .028539    -1.92   0.054     .8891386    1.001075
                 |
     aco_exit_gr |
           2015  |   .9130377   .0496618    -1.67   0.094      .820711    1.015751
                 |
year#aco_exit_gr |
      2014 2015  |    1.02031   .0504188     0.41   0.684     .9261252    1.124072
      2015 2015  |   .9763215   .0725925    -0.32   0.747     .8439241     1.12949
      2016 2015  |   1.016934   .0594846     0.29   0.774     .9067814    1.140468
                 |
          agegrp |
              1  |   1.199695   .0138215    15.80   0.000     1.172909    1.227092
              2  |   1.266966   .0209497    14.31   0.000     1.226563    1.308699
                 |
        1.female |   1.235445   .0123706    21.12   0.000     1.211436    1.259931
                 |
         race_g3 |
              1  |   .7962942   .0382513    -4.74   0.000     .7247441    .8749079
              2  |   1.037602   .0319855     1.20   0.231     .9767681    1.102225
                 |
            HCC1 |   .9966762   .1373955    -0.02   0.981      .760699    1.305856
            HCC2 |   .8482156   .0209626    -6.66   0.000     .8081089    .8903128
            HCC6 |   1.087444   .0682584     1.34   0.182     .9615621    1.229806
            HCC8 |   .5420514   .0239297   -13.87   0.000     .4971218    .5910418
            HCC9 |   .9141593   .0310707    -2.64   0.008     .8552459    .9771309
           HCC10 |   .9677526   .0343483    -0.92   0.356     .9027194    1.037471
           HCC11 |   1.005829   .0278889     0.21   0.834     .9526264    1.062003
           HCC12 |   1.207671   .0196343    11.61   0.000     1.169795    1.246773
           HCC17 |   2.322942    .105653    18.53   0.000     2.124827    2.539528
           HCC18 |   2.530622   .0643572    36.51   0.000     2.407576    2.659956
           HCC19 |   1.669548   .0406744    21.04   0.000     1.591701    1.751203
           HCC21 |   .7683561   .0348423    -5.81   0.000     .7030133    .8397724
           HCC22 |   1.015447   .0189479     0.82   0.411     .9789802    1.053271
           HCC23 |   1.084835   .0225966     3.91   0.000     1.041438     1.13004
           HCC27 |   .7311255   .0395989    -5.78   0.000     .6574905    .8130072
           HCC28 |    .856059   .0398087    -3.34   0.001     .7814854    .9377489
           HCC29 |   1.072889   .0586833     1.29   0.198     .9638227    1.194298
           HCC33 |   .9416693    .029629    -1.91   0.056     .8853519    1.001569
           HCC34 |    .886763   .0691548    -1.54   0.123     .7610726    1.033211
           HCC35 |    1.09985   .0461989     2.27   0.023     1.012929     1.19423
           HCC39 |   .8858651   .0343721    -3.12   0.002     .8209949     .955861
           HCC40 |   1.102615   .0245203     4.39   0.000     1.055588    1.151736
           HCC46 |   .9408351   .0535305    -1.07   0.284     .8415557    1.051827
           HCC47 |   .9373089   .0348969    -1.74   0.082     .8713482    1.008263
           HCC48 |   1.033039   .0230658     1.46   0.145     .9888055    1.079251
           HCC54 |   .6750421   .0858974    -3.09   0.002     .5260385    .8662518
           HCC55 |    .864351   .0596793    -2.11   0.035     .7549509    .9896044
           HCC57 |   .6978659   .0442176    -5.68   0.000     .6163662     .790142
           HCC58 |   .8884548   .0210268    -5.00   0.000     .8481843    .9306374
           HCC70 |   .6870143   .0798353    -3.23   0.001       .54708    .8627415
           HCC71 |   .7014785   .0721826    -3.45   0.001     .5733571    .8582298
           HCC72 |   1.008843   .0558606     0.16   0.874     .9050903     1.12449
           HCC73 |   .7071859   .1748334    -1.40   0.161     .4356082    1.148077
           HCC74 |   .9856467   .1714171    -0.08   0.934     .7009483    1.385979
           HCC75 |   1.067029   .0334365     2.07   0.038     1.003467    1.134618
           HCC76 |    1.10752   .2712966     0.42   0.677     .6852396    1.790032
           HCC77 |   .9744754   .0666607    -0.38   0.705     .8522027    1.114292
           HCC78 |   .8314949   .0376879    -4.07   0.000     .7608139    .9087423
           HCC79 |   .8407941   .0243142    -6.00   0.000     .7944645    .8898254
           HCC80 |   .8656465   .0836163    -1.49   0.135     .7163406    1.046072
           HCC82 |   .6976281    .058637    -4.28   0.000      .591669    .8225629
           HCC83 |   1.113316   .2391927     0.50   0.617     .7307017    1.696276
           HCC84 |   .8052617   .0205351    -8.49   0.000     .7660028    .8465326
           HCC85 |   .8462564   .0131662   -10.73   0.000     .8208406    .8724592
           HCC86 |   .8921314   .0314786    -3.23   0.001     .8325195    .9560118
           HCC87 |   1.061085   .0300979     2.09   0.037     1.003704    1.121747
           HCC88 |   1.108182   .0287701     3.96   0.000     1.053204    1.166029
           HCC96 |   1.003039   .0143716     0.21   0.832     .9752635    1.031606
           HCC99 |   .8801884   .0554234    -2.03   0.043     .7779962    .9958038
          HCC100 |   .8833853   .0209822    -5.22   0.000     .8432034    .9254819
          HCC103 |   .7271092   .0297372    -7.79   0.000     .6711002    .7877926
          HCC104 |   .9283273   .1056492    -0.65   0.513     .7427271    1.160307
          HCC106 |   .7448055   .0338993    -6.47   0.000     .6812414    .8143004
          HCC107 |   .9459253   .0273048    -1.93   0.054     .8938946    1.000984
          HCC108 |   1.033064    .014505     2.32   0.021     1.005022    1.061888
          HCC110 |   .4465661   .1129002    -3.19   0.001     .2720734    .7329686
          HCC111 |   .7791592   .0130387   -14.91   0.000     .7540184    .8051382
          HCC112 |   1.104396   .0386468     2.84   0.005     1.031189    1.182801
          HCC114 |   .9697935   .0501978    -0.59   0.553     .8762337    1.073343
          HCC115 |   .9101158   .0679666    -1.26   0.207     .7861939    1.053571
          HCC122 |   2.121963   .0717875    22.24   0.000     1.985825    2.267433
          HCC124 |    3.11947   .2038421    17.41   0.000     2.744473    3.545706
          HCC134 |   .4530649    .019892   -18.03   0.000     .4157078    .4937791
          HCC135 |   .7736462   .0166075   -11.96   0.000     .7417713    .8068908
          HCC136 |    .802238   .0375012    -4.71   0.000     .7320036    .8792113
          HCC137 |   .8582162   .0315616    -4.16   0.000     .7985334    .9223598
          HCC157 |   .7703569   .1029033    -1.95   0.051     .5929111    1.000908
          HCC158 |   .6376616   .0627055    -4.58   0.000     .5258792    .7732048
          HCC161 |   .8578586   .0219651    -5.99   0.000     .8158702    .9020079
          HCC162 |   1.357807   .3939005     1.05   0.292     .7689602    2.397574
          HCC166 |   .4316114   .1532131    -2.37   0.018     .2152454    .8654694
          HCC167 |   1.013104   .0603185     0.22   0.827     .9015193      1.1385
          HCC169 |   .8121449   .0374647    -4.51   0.000     .7419372    .8889962
          HCC170 |   .7893109   .0408898    -4.57   0.000     .7131027    .8736634
          HCC173 |   1.099739   .0679204     1.54   0.124     .9743587    1.241252
          HCC176 |   .9903911    .026465    -0.36   0.718     .9398556    1.043644
          HCC186 |   .9935747     .06601    -0.10   0.923     .8722668    1.131753
          HCC188 |   .7497432   .0379787    -5.69   0.000     .6788823    .8280006
          HCC189 |   .6968169   .0421661    -5.97   0.000     .6188856    .7845613
                 |
    providertype |
              1  |    1.19117   .1374009     1.52   0.129     .9501412    1.493343
              2  |   1.135726   .0649846     2.22   0.026     1.015241     1.27051
                 |
          n_pcps |   .9999714    .000111    -0.26   0.796     .9997539    1.000189
          n_spec |    .999966   .0000521    -0.65   0.514     .9998639    1.000068
   lives_covered |   1.000003   1.27e-06     2.48   0.013     1.000001    1.000006
           _cons |   .4872091   .0318228   -11.01   0.000     .4286649     .553749
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    322,604
Model VCE    : Robust

Expression   : Pr(alldiabtest_ind), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |    .511944   .0062047    82.51   0.000      .499783     .524105
           2014  |   .5045544    .007074    71.33   0.000     .4906897    .5184192
           2015  |   .5286608   .0131239    40.28   0.000     .5029385    .5543832
           2016  |   .4985367   .0072366    68.89   0.000     .4843531    .5127202
                 |
     aco_exit_gr |
              0  |   .5133231    .007508    68.37   0.000     .4986077    .5280384
           2015  |   .4923971   .0113634    43.33   0.000     .4701253    .5146689
                 |
year#aco_exit_gr |
      2013    0  |   .5143643   .0069096    74.44   0.000     .5008217    .5279068
      2013 2015  |   .4927095   .0106734    46.16   0.000     .4717899     .513629
      2014    0  |   .5064398   .0076517    66.19   0.000     .4914428    .5214368
      2014 2015  |   .4895686   .0119949    40.81   0.000     .4660591     .513078
      2015    0  |   .5317153   .0140283    37.90   0.000     .5042205    .5592102
      2015 2015  |   .5043948   .0145867    34.58   0.000     .4758053    .5329842
      2016    0  |   .5005095    .007713    64.89   0.000     .4853923    .5156266
      2016 2015  |   .4828532   .0155119    31.13   0.000     .4524504     .513256
----------------------------------------------------------------------------------
***********************************************************
                    Oct 2019 New Models                    
               All Years of Data eyeexam_ind               
18:38:34 28 Sep 2021
***********************************************************

Iteration 0:   log pseudolikelihood = -206268.28  
Iteration 1:   log pseudolikelihood =    -200010  
Iteration 2:   log pseudolikelihood = -199891.02  
Iteration 3:   log pseudolikelihood = -199889.24  
Iteration 4:   log pseudolikelihood = -199889.24  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(93)     =   20318.57
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -199889.24               Pseudo R2         =     0.0309

                                 (Std. Err. adjusted for 298 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
       eyeexam_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |    .972729   .0249123    -1.08   0.280     .9251069    1.022802
             2015  |   1.084807   .0681881     1.30   0.195      .959065    1.227034
             2016  |   .9851864   .0307748    -0.48   0.633     .9266782    1.047389
                   |
1.aco_death_active |   .8697276   .0587756    -2.07   0.039     .7618327    .9929031
                   |
            agegrp |
                1  |   1.264909   .0150318    19.78   0.000     1.235788    1.294716
                2  |   1.389129   .0250318    18.24   0.000     1.340924    1.439067
                   |
          1.female |   1.284535   .0148766    21.62   0.000     1.255706    1.314026
                   |
           race_g3 |
                1  |   .8280768   .0397189    -3.93   0.000     .7537764     .909701
                2  |   1.012505   .0289522     0.43   0.664      .957321    1.070871
                   |
              HCC1 |   1.028977   .1199117     0.25   0.806     .8188623    1.293005
              HCC2 |   .9032775   .0253515    -3.62   0.000     .8549314    .9543575
              HCC6 |   1.139213   .0794855     1.87   0.062      .993607    1.306156
              HCC8 |   .6508065   .0253865   -11.01   0.000     .6029044    .7025145
              HCC9 |   .9647871   .0342399    -1.01   0.312     .8999589    1.034285
             HCC10 |   1.036102   .0394218     0.93   0.351     .9616479    1.116322
             HCC11 |   1.062771   .0303298     2.13   0.033     1.004958     1.12391
             HCC12 |   1.254677    .022541    12.63   0.000     1.211266    1.299643
             HCC17 |   1.848349   .0843134    13.47   0.000     1.690269    2.021212
             HCC18 |    2.03249   .0460075    31.33   0.000     1.944288    2.124693
             HCC19 |   1.317092   .0276918    13.10   0.000      1.26392    1.372501
             HCC21 |   .8072155   .0357853    -4.83   0.000     .7400383    .8804906
             HCC22 |   1.014953   .0196529     0.77   0.443     .9771554    1.054212
             HCC23 |   1.128525   .0260326     5.24   0.000     1.078639    1.180719
             HCC27 |   .8753735   .0516145    -2.26   0.024     .7798375    .9826134
             HCC28 |   .9316671   .0478451    -1.38   0.168     .8424574    1.030324
             HCC29 |   1.073531   .0543298     1.40   0.161      .972157    1.185475
             HCC33 |   .9280866   .0309779    -2.24   0.025     .8693145    .9908321
             HCC34 |   .9561283    .069259    -0.62   0.536      .829579    1.101982
             HCC35 |   1.210419   .0545344     4.24   0.000     1.108117    1.322166
             HCC39 |   .9221594   .0378456    -1.97   0.048     .8508883    .9994002
             HCC40 |   1.227716   .0278191     9.05   0.000     1.174384    1.283469
             HCC46 |   1.110527    .069073     1.69   0.092     .9830732    1.254506
             HCC47 |   1.035432   .0340913     1.06   0.290     .9707246    1.104453
             HCC48 |   1.064822   .0236858     2.82   0.005     1.019396    1.112272
             HCC54 |   .6957464    .078294    -3.22   0.001     .5580373    .8674385
             HCC55 |   .8635628   .0576852    -2.20   0.028     .7575903    .9843588
             HCC57 |   .8404541   .0662752    -2.20   0.028     .7200974    .9809271
             HCC58 |   .9832705   .0255844    -0.65   0.517     .9343831    1.034716
             HCC70 |   .7671637   .0897881    -2.26   0.024     .6099079    .9649656
             HCC71 |   .8442614    .101147    -1.41   0.158     .6675725    1.067715
             HCC72 |   1.057152   .0597245     0.98   0.325     .9463423    1.180937
             HCC73 |   .5754721   .1184555    -2.68   0.007     .3844258    .8614619
             HCC74 |    1.19869   .2013938     1.08   0.281     .8623731    1.666167
             HCC75 |   1.161428   .0387934     4.48   0.000      1.08783    1.240006
             HCC76 |    1.26491   .3710912     0.80   0.423       .71177    2.247914
             HCC77 |   1.137516   .0737029     1.99   0.047     1.001857    1.291545
             HCC78 |   .9461333   .0443147    -1.18   0.237     .8631456      1.0371
             HCC79 |   .9333019   .0289348    -2.23   0.026     .8782793    .9917716
             HCC80 |   .9287295   .0955588    -0.72   0.472     .7591148    1.136242
             HCC82 |   .8115367   .0718621    -2.36   0.018     .6822346     .965345
             HCC83 |    1.00184   .2064743     0.01   0.993     .6689133    1.500468
             HCC84 |   .8384589   .0202357    -7.30   0.000     .7997211    .8790732
             HCC85 |    .872869   .0160778    -7.38   0.000     .8419191    .9049566
             HCC86 |   .8718631   .0301128    -3.97   0.000     .8147964    .9329265
             HCC87 |   1.000941   .0280487     0.03   0.973     .9474495    1.057454
             HCC88 |    1.11676    .031423     3.92   0.000      1.05684    1.180078
             HCC96 |   1.034819   .0149338     2.37   0.018     1.005959    1.064507
             HCC99 |   .9230224   .0583209    -1.27   0.205     .8155102    1.044709
            HCC100 |   .8788374    .019228    -5.90   0.000     .8419478    .9173432
            HCC103 |   .8097429   .0392964    -4.35   0.000     .7362729    .8905443
            HCC104 |   .8601624   .1087009    -1.19   0.233     .6714474    1.101917
            HCC106 |   .7518214   .0350375    -6.12   0.000     .6861922    .8237276
            HCC107 |   .9537738   .0260968    -1.73   0.084     .9039724    1.006319
            HCC108 |   1.050215   .0148919     3.46   0.001     1.021429    1.079812
            HCC110 |   .4721994   .1164211    -3.04   0.002     .2912467    .7655787
            HCC111 |   .7983852   .0144434   -12.45   0.000     .7705726    .8272016
            HCC112 |   1.215077   .0482386     4.91   0.000     1.124116    1.313398
            HCC114 |   1.020487   .0585815     0.35   0.724      .911893    1.142013
            HCC115 |   .8880025    .070977    -1.49   0.137     .7592392    1.038603
            HCC122 |   3.708091   .1402917    34.64   0.000     3.443072    3.993509
            HCC124 |   8.629871   .9052454    20.55   0.000     7.026127    10.59968
            HCC134 |   .6269077   .0276488   -10.59   0.000     .5749931    .6835095
            HCC135 |   .8190765    .017938    -9.11   0.000     .7846625    .8549998
            HCC136 |   .8736086   .0406088    -2.91   0.004     .7975349    .9569386
            HCC137 |   .8784921   .0347518    -3.27   0.001     .8129534    .9493144
            HCC157 |     .73378   .1069008    -2.12   0.034     .5515165    .9762774
            HCC158 |   .7504917   .0688464    -3.13   0.002     .6269903    .8983197
            HCC161 |   .9115643   .0235556    -3.58   0.000     .8665457    .9589216
            HCC162 |   1.347837   .4491233     0.90   0.370     .7014583     2.58984
            HCC166 |   .4346635   .1432564    -2.53   0.011     .2278317    .8292629
            HCC167 |   1.042157   .0691132     0.62   0.534     .9151321    1.186814
            HCC169 |   .9393713   .0404191    -1.45   0.146     .8633998    1.022027
            HCC170 |   .8276796   .0433498    -3.61   0.000      .746931    .9171577
            HCC173 |   1.057785   .0662441     0.90   0.370     .9356005    1.195925
            HCC176 |   .9903962   .0312916    -0.31   0.760     .9309262    1.053665
            HCC186 |   .9472434   .0648117    -0.79   0.428      .828364    1.083183
            HCC188 |   .8633693   .0427867    -2.96   0.003      .783453    .9514376
            HCC189 |   .7699128   .0511983    -3.93   0.000     .6758302    .8770925
                   |
      providertype |
                1  |   1.165409   .1467624     1.22   0.224     .9105102    1.491667
                2  |   1.041782   .0576463     0.74   0.459     .9347087    1.161121
                   |
            n_pcps |   .9999717    .000117    -0.24   0.809     .9997423    1.000201
            n_spec |   1.000013   .0000457     0.29   0.771     .9999237    1.000103
     lives_covered |   1.000002   1.16e-06     1.93   0.053            1    1.000005
             _cons |   .7548434   .0497137    -4.27   0.000      .663433    .8588486
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -206268.28  
Iteration 1:   log pseudolikelihood = -200008.01  
Iteration 2:   log pseudolikelihood = -199889.01  
Iteration 3:   log pseudolikelihood = -199887.24  
Iteration 4:   log pseudolikelihood = -199887.23  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(94)     =   20843.96
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -199887.23               Pseudo R2         =     0.0309

                            (Std. Err. adjusted for 298 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
  eyeexam_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |   .9724883    .024851    -1.09   0.275     .9249809    1.022436
        2015  |    1.09074   .0716021     1.32   0.186     .9590559    1.240506
        2016  |   .9826378   .0301429    -0.57   0.568     .9252997    1.043529
              |
   death_year |
           1  |   .8332848    .066985    -2.27   0.023     .7118167    .9754809
           2  |    .910918   .0597812    -1.42   0.155     .8009715    1.035956
              |
       agegrp |
           1  |   1.264687   .0150454    19.74   0.000      1.23554    1.294522
           2  |   1.388989   .0250481    18.22   0.000     1.340753     1.43896
              |
     1.female |   1.284548   .0148733    21.63   0.000     1.255726    1.314033
              |
      race_g3 |
           1  |   .8281181   .0397032    -3.93   0.000     .7538455    .9097083
           2  |   1.012687   .0289148     0.44   0.659     .9575716    1.070975
              |
         HCC1 |   1.029124   .1199225     0.25   0.805     .8189892    1.293174
         HCC2 |   .9031803    .025349    -3.63   0.000      .854839    .9542554
         HCC6 |   1.139251   .0794628     1.87   0.062     .9936832    1.306143
         HCC8 |   .6508097   .0253836   -11.01   0.000     .6029128    .7025117
         HCC9 |   .9647457   .0342395    -1.01   0.312     .8999183    1.034243
        HCC10 |   1.036035   .0394167     0.93   0.352     .9615899    1.116244
        HCC11 |   1.062843   .0303396     2.14   0.033     1.005012    1.124003
        HCC12 |   1.254696   .0225465    12.63   0.000     1.211275    1.299674
        HCC17 |   1.848652   .0842452    13.48   0.000     1.690694    2.021369
        HCC18 |   2.032572   .0459811    31.35   0.000     1.944419    2.124721
        HCC19 |   1.317108   .0276842    13.10   0.000     1.263951    1.372501
        HCC21 |   .8072056   .0357683    -4.83   0.000      .740059    .8804444
        HCC22 |   1.014949   .0196625     0.77   0.444     .9771338    1.054228
        HCC23 |   1.128565   .0260264     5.24   0.000      1.07869    1.180746
        HCC27 |    .875263   .0516009    -2.26   0.024     .7797515    .9824737
        HCC28 |   .9317067   .0478403    -1.38   0.168     .8425053    1.030352
        HCC29 |   1.073815   .0543279     1.41   0.159     .9724432    1.185754
        HCC33 |   .9281604   .0309753    -2.23   0.025     .8693929    .9909004
        HCC34 |    .956435   .0692637    -0.62   0.539     .8298748    1.102296
        HCC35 |   1.210394   .0545445     4.24   0.000     1.108074    1.322163
        HCC39 |   .9223242   .0378408    -1.97   0.049     .8510612    .9995543
        HCC40 |   1.227644   .0278053     9.06   0.000     1.174338    1.283369
        HCC46 |   1.110318   .0690776     1.68   0.093     .9828577    1.254309
        HCC47 |   1.035464   .0340943     1.06   0.290      .970751    1.104491
        HCC48 |    1.06487   .0236722     2.83   0.005      1.01947    1.112293
        HCC54 |   .6959654   .0782969    -3.22   0.001     .5582471    .8676585
        HCC55 |    .861801   .0575677    -2.23   0.026     .7560445    .9823509
        HCC57 |   .8406265    .066266    -2.20   0.028     .7202834    .9810761
        HCC58 |   .9832807   .0255886    -0.65   0.517     .9343855    1.034734
        HCC70 |   .7667215   .0897829    -2.27   0.023     .6094838    .9645241
        HCC71 |    .843996   .1010985    -1.42   0.157     .6673886    1.067338
        HCC72 |   1.056662   .0596841     0.98   0.329     .9459259    1.180361
        HCC73 |   .5756379   .1184705    -2.68   0.007     .3845616    .8616539
        HCC74 |   1.198434   .2014191     1.08   0.281     .8620925    1.665997
        HCC75 |   1.161627   .0387999     4.49   0.000     1.088016    1.240218
        HCC76 |   1.264193   .3707934     0.80   0.424     .7114627    2.246335
        HCC77 |   1.137144   .0737507     1.98   0.048     1.001405    1.291282
        HCC78 |   .9461582   .0443061    -1.18   0.237     .8631856    1.037106
        HCC79 |   .9332309    .028925    -2.23   0.026     .8782266    .9916802
        HCC80 |   .9288325    .095605    -0.72   0.473      .759142    1.136454
        HCC82 |   .8120808   .0719163    -2.35   0.019      .682682    .9660065
        HCC83 |   1.000605   .2063995     0.00   0.998     .6678537    1.499146
        HCC84 |   .8383351   .0202048    -7.32   0.000     .7996552    .8788861
        HCC85 |   .8729206    .016088    -7.37   0.000     .8419514    .9050289
        HCC86 |   .8718939   .0301204    -3.97   0.000     .8148133    .9329732
        HCC87 |   1.001116   .0280537     0.04   0.968     .9476143    1.057638
        HCC88 |   1.116867   .0313872     3.93   0.000     1.057013    1.180111
        HCC96 |   1.034817   .0149324     2.37   0.018      1.00596    1.064502
        HCC99 |   .9233055   .0583231    -1.26   0.207     .8157873    1.044994
       HCC100 |   .8789399   .0192337    -5.90   0.000     .8420394    .9174574
       HCC103 |   .8096658   .0392972    -4.35   0.000     .7361947    .8904692
       HCC104 |   .8605854   .1086799    -1.19   0.234     .6718914    1.102272
       HCC106 |    .751902   .0350457    -6.12   0.000     .6862577    .8238254
       HCC107 |   .9537956   .0260798    -1.73   0.084     .9040256    1.006306
       HCC108 |   1.050227    .014883     3.46   0.001     1.021459    1.079806
       HCC110 |   .4726635   .1165735    -3.04   0.002     .2914871    .7664517
       HCC111 |   .7983857   .0144415   -12.45   0.000     .7705767    .8271984
       HCC112 |   1.215144   .0482297     4.91   0.000     1.124199    1.313447
       HCC114 |   1.020335   .0585878     0.35   0.726     .9117305    1.141876
       HCC115 |   .8883586   .0709071    -1.48   0.138     .7597084    1.038794
       HCC122 |   3.707924   .1402924    34.64   0.000     3.442904    3.993345
       HCC124 |   8.632363   .9051663    20.56   0.000       7.0287    10.60192
       HCC134 |   .6269156   .0276523   -10.59   0.000     .5749947    .6835249
       HCC135 |   .8191233   .0179332    -9.11   0.000     .7847182    .8550368
       HCC136 |   .8736068   .0406109    -2.91   0.004     .7975293    .9569414
       HCC137 |   .8785927   .0347588    -3.27   0.001     .8130411    .9494295
       HCC157 |   .7339432   .1068931    -2.12   0.034     .5516855    .9764126
       HCC158 |   .7502688   .0688508    -3.13   0.002     .6267636    .8981111
       HCC161 |    .911554   .0235559    -3.58   0.000      .866535     .958912
       HCC162 |   1.349355   .4493327     0.90   0.368     .7025505     2.59164
       HCC166 |   .4349308   .1433485    -2.53   0.012     .2279677    .8297878
       HCC167 |   1.042397   .0691071     0.63   0.531     .9153806    1.187038
       HCC169 |   .9394327   .0404457    -1.45   0.147     .8634131    1.022146
       HCC170 |   .8276337   .0433573    -3.61   0.000     .7468721    .9171283
       HCC173 |   1.057845   .0662659     0.90   0.369     .9356225    1.196033
       HCC176 |   .9905012   .0313158    -0.30   0.763     .9309864    1.053821
       HCC186 |   .9472445   .0647975    -0.79   0.428     .8283893    1.083153
       HCC188 |   .8633712   .0427676    -2.97   0.003     .7834888    .9513982
       HCC189 |   .7700298   .0512298    -3.93   0.000     .6758922    .8772787
              |
 providertype |
           1  |   1.165602    .146735     1.22   0.224     .9107404    1.491785
           2  |    1.04183   .0576423     0.74   0.459     .9347636    1.161161
              |
       n_pcps |   .9999657   .0001176    -0.29   0.770     .9997351    1.000196
       n_spec |   1.000014   .0000458     0.30   0.766     .9999239    1.000103
lives_covered |   1.000002   1.22e-06     1.92   0.055     .9999999    1.000005
        _cons |   .7539532   .0499378    -4.26   0.000     .6621637    .8584667
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(eyeexam_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .6004536   .0073868    81.29   0.000     .5859758    .6149314
          1  |   .5578241   .0164889    33.83   0.000     .5255065    .5901418
          2  |   .5787823   .0155589    37.20   0.000     .5482875    .6092772
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -217152.05  
Iteration 1:   log pseudolikelihood = -210677.45  
Iteration 2:   log pseudolikelihood = -210557.08  
Iteration 3:   log pseudolikelihood = -210555.43  
Iteration 4:   log pseudolikelihood = -210555.42  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(93)     =   16115.76
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -210555.42               Pseudo R2         =     0.0304

                                 (Std. Err. adjusted for 313 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
       eyeexam_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   .9747797   .0235335    -1.06   0.290     .9297292    1.022013
             2015  |   1.069686   .0630925     1.14   0.253     .9529067    1.200776
             2016  |   .9800241   .0295608    -0.67   0.504     .9237653    1.039709
                   |
1.aco_death_active |   .9609058   .0553394    -0.69   0.489     .8583401    1.075727
                   |
            agegrp |
                1  |   1.260056   .0143962    20.23   0.000     1.232154    1.288591
                2  |   1.385758   .0244126    18.52   0.000     1.338727    1.434442
                   |
          1.female |   1.279949   .0139361    22.67   0.000     1.252924    1.307557
                   |
           race_g3 |
                1  |   .8307861   .0376695    -4.09   0.000     .7601409    .9079969
                2  |   1.010248   .0283845     0.36   0.717     .9561195    1.067441
                   |
              HCC1 |   1.040186   .1175012     0.35   0.727     .8336003    1.297969
              HCC2 |   .8880841     .02397    -4.40   0.000     .8423247    .9363292
              HCC6 |   1.107183   .0754776     1.49   0.135     .9687068    1.265455
              HCC8 |   .6476722   .0240835   -11.68   0.000     .6021485    .6966376
              HCC9 |   .9740383    .033703    -0.76   0.447     .9101717    1.042386
             HCC10 |   1.034873   .0379651     0.93   0.350     .9630753    1.112024
             HCC11 |   1.033736   .0305861     1.12   0.262     .9754937    1.095456
             HCC12 |   1.240768   .0212932    12.57   0.000     1.199728    1.283211
             HCC17 |   1.873478   .0795297    14.79   0.000      1.72391    2.036021
             HCC18 |   2.030449   .0439402    32.73   0.000     1.946129    2.118423
             HCC19 |   1.311242   .0264366    13.44   0.000     1.260437    1.364094
             HCC21 |   .8193392   .0330089    -4.95   0.000     .7571313    .8866584
             HCC22 |   1.003721   .0198803     0.19   0.851     .9655028    1.043452
             HCC23 |   1.117953   .0249926     4.99   0.000     1.070026    1.168027
             HCC27 |   .8596242   .0496064    -2.62   0.009     .7676942    .9625625
             HCC28 |   .9069575   .0449755    -1.97   0.049     .8229556    .9995339
             HCC29 |   1.051864    .053172     1.00   0.317     .9526454    1.161417
             HCC33 |    .930075   .0300048    -2.25   0.025     .8730872    .9907824
             HCC34 |   .9154854   .0651562    -1.24   0.215     .7962883    1.052525
             HCC35 |   1.186309   .0516477     3.92   0.000      1.08928    1.291981
             HCC39 |   .9328926   .0363662    -1.78   0.075      .864271    1.006963
             HCC40 |    1.23357   .0266492     9.72   0.000     1.182429    1.286923
             HCC46 |   1.075832   .0655676     1.20   0.230     .9547009    1.212333
             HCC47 |   1.022692   .0341595     0.67   0.502     .9578854    1.091884
             HCC48 |   1.052883   .0228098     2.38   0.017     1.009112    1.098552
             HCC54 |   .7170122   .0804569    -2.96   0.003     .5754559    .8933898
             HCC55 |   .8625006   .0587066    -2.17   0.030     .7547825    .9855915
             HCC57 |   .8880316   .0655428    -1.61   0.108     .7684294    1.026249
             HCC58 |   .9832373   .0249221    -0.67   0.505     .9355843    1.033317
             HCC70 |    .812539   .0938632    -1.80   0.072     .6479102    1.018999
             HCC71 |   .8341904   .0960937    -1.57   0.116     .6655979    1.045487
             HCC72 |   1.059719   .0585754     1.05   0.294     .9509131    1.180974
             HCC73 |   .6784654   .1438469    -1.83   0.067     .4477728    1.028011
             HCC74 |   1.275445   .2109668     1.47   0.141     .9222898    1.763827
             HCC75 |   1.153444   .0374207     4.40   0.000     1.082383    1.229169
             HCC76 |   1.307446   .3585879     0.98   0.328     .7637796    2.238099
             HCC77 |   1.218904   .0787126     3.07   0.002     1.073994    1.383366
             HCC78 |   .9601336   .0419892    -0.93   0.352     .8812648    1.046061
             HCC79 |   .9484475   .0286854    -1.75   0.080     .8938591     1.00637
             HCC80 |   .9167516    .089604    -0.89   0.374      .756928    1.110322
             HCC82 |   .8241279   .0745161    -2.14   0.032     .6902884    .9839174
             HCC83 |   1.120953   .2334233     0.55   0.583     .7453084    1.685926
             HCC84 |   .8487967   .0202937    -6.86   0.000     .8099393    .8895183
             HCC85 |   .8704105   .0152003    -7.95   0.000     .8411224    .9007183
             HCC86 |   .8536993   .0294542    -4.58   0.000     .7978787    .9134252
             HCC87 |    1.00136    .027057     0.05   0.960     .9497086     1.05582
             HCC88 |   1.093631   .0287129     3.41   0.001     1.038778     1.15138
             HCC96 |   1.033239   .0148452     2.28   0.023     1.004549    1.062749
             HCC99 |   .9255726   .0558008    -1.28   0.200     .8224194    1.041664
            HCC100 |   .8812955   .0186421    -5.97   0.000     .8455047    .9186013
            HCC103 |   .8182934   .0368814    -4.45   0.000      .749108    .8938685
            HCC104 |     .97975   .1291762    -0.16   0.877     .7566372    1.268653
            HCC106 |   .7745731   .0356581    -5.55   0.000     .7077448    .8477116
            HCC107 |   .9645941   .0258041    -1.35   0.178     .9153219    1.016519
            HCC108 |   1.055055   .0152148     3.72   0.000     1.025652    1.085301
            HCC110 |   .4978999   .1152245    -3.01   0.003     .3163415    .7836604
            HCC111 |   .8062231   .0138545   -12.53   0.000      .779521    .8338399
            HCC112 |   1.172061   .0442869     4.20   0.000     1.088397    1.262157
            HCC114 |   1.030976   .0562016     0.56   0.576     .9265038    1.147229
            HCC115 |   .8922418   .0709693    -1.43   0.152     .7634447    1.042768
            HCC122 |   3.618665   .1429878    32.55   0.000     3.348991    3.910053
            HCC124 |   8.112271    .808602    21.00   0.000      6.67264    9.862503
            HCC134 |   .6290295   .0265446   -10.99   0.000     .5790964    .6832681
            HCC135 |   .8244262   .0180754    -8.81   0.000     .7897494    .8606256
            HCC136 |   .8870123    .040171    -2.65   0.008     .8116718    .9693461
            HCC137 |    .887949   .0340298    -3.10   0.002     .8236952    .9572151
            HCC157 |   .8268489     .10935    -1.44   0.151     .6380512    1.071511
            HCC158 |   .6793951   .0607964    -4.32   0.000      .570101    .8096421
            HCC161 |   .9138833   .0226942    -3.63   0.000     .8704687    .9594633
            HCC162 |    1.42047   .4299623     1.16   0.246     .7848407    2.570883
            HCC166 |    .429444   .1428371    -2.54   0.011     .2237633    .8241841
            HCC167 |   1.048207    .066695     0.74   0.459     .9253092    1.187427
            HCC169 |   .8933659   .0381972    -2.64   0.008     .8215519    .9714574
            HCC170 |    .801617   .0409718    -4.33   0.000     .7252049    .8860803
            HCC173 |   1.117096   .0667163     1.85   0.064      .993698    1.255819
            HCC176 |   1.014285   .0319021     0.45   0.652     .9536466     1.07878
            HCC186 |   1.007688    .067425     0.11   0.909      .883836    1.148895
            HCC188 |   .8552564   .0434845    -3.08   0.002     .7741373    .9448757
            HCC189 |   .7909514   .0508274    -3.65   0.000     .6973497    .8971167
                   |
      providertype |
                1  |   1.175356   .1447585     1.31   0.190     .9232819    1.496252
                2  |    1.04165   .0539496     0.79   0.431     .9411006    1.152943
                   |
            n_pcps |   .9999836    .000111    -0.15   0.882     .9997661    1.000201
            n_spec |   1.000016   .0000453     0.36   0.722     .9999273    1.000105
     lives_covered |   1.000002   1.13e-06     1.78   0.076     .9999998    1.000004
             _cons |   .7632717   .0485676    -4.25   0.000     .6737775     .864653
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -217152.05  
Iteration 1:   log pseudolikelihood = -210677.45  
Iteration 2:   log pseudolikelihood = -210557.08  
Iteration 3:   log pseudolikelihood = -210555.43  
Iteration 4:   log pseudolikelihood = -210555.42  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(93)     =   16115.76
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -210555.42               Pseudo R2         =     0.0304

                            (Std. Err. adjusted for 313 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
  eyeexam_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |   .9747797   .0235335    -1.06   0.290     .9297292    1.022013
        2015  |   1.069686   .0630925     1.14   0.253     .9529067    1.200776
        2016  |   .9800241   .0295608    -0.67   0.504     .9237653    1.039709
              |
 1.death_year |   .9609058   .0553394    -0.69   0.489     .8583401    1.075727
              |
       agegrp |
           1  |   1.260056   .0143962    20.23   0.000     1.232154    1.288591
           2  |   1.385758   .0244126    18.52   0.000     1.338727    1.434442
              |
     1.female |   1.279949   .0139361    22.67   0.000     1.252924    1.307557
              |
      race_g3 |
           1  |   .8307861   .0376695    -4.09   0.000     .7601409    .9079969
           2  |   1.010248   .0283845     0.36   0.717     .9561195    1.067441
              |
         HCC1 |   1.040186   .1175012     0.35   0.727     .8336003    1.297969
         HCC2 |   .8880841     .02397    -4.40   0.000     .8423247    .9363292
         HCC6 |   1.107183   .0754776     1.49   0.135     .9687068    1.265455
         HCC8 |   .6476722   .0240835   -11.68   0.000     .6021485    .6966376
         HCC9 |   .9740383    .033703    -0.76   0.447     .9101717    1.042386
        HCC10 |   1.034873   .0379651     0.93   0.350     .9630753    1.112024
        HCC11 |   1.033736   .0305861     1.12   0.262     .9754937    1.095456
        HCC12 |   1.240768   .0212932    12.57   0.000     1.199728    1.283211
        HCC17 |   1.873478   .0795297    14.79   0.000      1.72391    2.036021
        HCC18 |   2.030449   .0439402    32.73   0.000     1.946129    2.118423
        HCC19 |   1.311242   .0264366    13.44   0.000     1.260437    1.364094
        HCC21 |   .8193392   .0330089    -4.95   0.000     .7571313    .8866584
        HCC22 |   1.003721   .0198803     0.19   0.851     .9655028    1.043452
        HCC23 |   1.117953   .0249926     4.99   0.000     1.070026    1.168027
        HCC27 |   .8596242   .0496064    -2.62   0.009     .7676942    .9625625
        HCC28 |   .9069575   .0449755    -1.97   0.049     .8229556    .9995339
        HCC29 |   1.051864    .053172     1.00   0.317     .9526454    1.161417
        HCC33 |    .930075   .0300048    -2.25   0.025     .8730872    .9907824
        HCC34 |   .9154854   .0651562    -1.24   0.215     .7962883    1.052525
        HCC35 |   1.186309   .0516477     3.92   0.000      1.08928    1.291981
        HCC39 |   .9328926   .0363662    -1.78   0.075      .864271    1.006963
        HCC40 |    1.23357   .0266492     9.72   0.000     1.182429    1.286923
        HCC46 |   1.075832   .0655676     1.20   0.230     .9547009    1.212333
        HCC47 |   1.022692   .0341595     0.67   0.502     .9578854    1.091884
        HCC48 |   1.052883   .0228098     2.38   0.017     1.009112    1.098552
        HCC54 |   .7170122   .0804569    -2.96   0.003     .5754559    .8933898
        HCC55 |   .8625006   .0587066    -2.17   0.030     .7547825    .9855915
        HCC57 |   .8880316   .0655428    -1.61   0.108     .7684294    1.026249
        HCC58 |   .9832373   .0249221    -0.67   0.505     .9355843    1.033317
        HCC70 |    .812539   .0938632    -1.80   0.072     .6479102    1.018999
        HCC71 |   .8341904   .0960937    -1.57   0.116     .6655979    1.045487
        HCC72 |   1.059719   .0585754     1.05   0.294     .9509131    1.180974
        HCC73 |   .6784654   .1438469    -1.83   0.067     .4477728    1.028011
        HCC74 |   1.275445   .2109668     1.47   0.141     .9222898    1.763827
        HCC75 |   1.153444   .0374207     4.40   0.000     1.082383    1.229169
        HCC76 |   1.307446   .3585879     0.98   0.328     .7637796    2.238099
        HCC77 |   1.218904   .0787126     3.07   0.002     1.073994    1.383366
        HCC78 |   .9601336   .0419892    -0.93   0.352     .8812648    1.046061
        HCC79 |   .9484475   .0286854    -1.75   0.080     .8938591     1.00637
        HCC80 |   .9167516    .089604    -0.89   0.374      .756928    1.110322
        HCC82 |   .8241279   .0745161    -2.14   0.032     .6902884    .9839174
        HCC83 |   1.120953   .2334233     0.55   0.583     .7453084    1.685926
        HCC84 |   .8487967   .0202937    -6.86   0.000     .8099393    .8895183
        HCC85 |   .8704105   .0152003    -7.95   0.000     .8411224    .9007183
        HCC86 |   .8536993   .0294542    -4.58   0.000     .7978787    .9134252
        HCC87 |    1.00136    .027057     0.05   0.960     .9497086     1.05582
        HCC88 |   1.093631   .0287129     3.41   0.001     1.038778     1.15138
        HCC96 |   1.033239   .0148452     2.28   0.023     1.004549    1.062749
        HCC99 |   .9255726   .0558008    -1.28   0.200     .8224194    1.041664
       HCC100 |   .8812955   .0186421    -5.97   0.000     .8455047    .9186013
       HCC103 |   .8182934   .0368814    -4.45   0.000      .749108    .8938685
       HCC104 |     .97975   .1291762    -0.16   0.877     .7566372    1.268653
       HCC106 |   .7745731   .0356581    -5.55   0.000     .7077448    .8477116
       HCC107 |   .9645941   .0258041    -1.35   0.178     .9153219    1.016519
       HCC108 |   1.055055   .0152148     3.72   0.000     1.025652    1.085301
       HCC110 |   .4978999   .1152245    -3.01   0.003     .3163415    .7836604
       HCC111 |   .8062231   .0138545   -12.53   0.000      .779521    .8338399
       HCC112 |   1.172061   .0442869     4.20   0.000     1.088397    1.262157
       HCC114 |   1.030976   .0562016     0.56   0.576     .9265038    1.147229
       HCC115 |   .8922418   .0709693    -1.43   0.152     .7634447    1.042768
       HCC122 |   3.618665   .1429878    32.55   0.000     3.348991    3.910053
       HCC124 |   8.112271    .808602    21.00   0.000      6.67264    9.862503
       HCC134 |   .6290295   .0265446   -10.99   0.000     .5790964    .6832681
       HCC135 |   .8244262   .0180754    -8.81   0.000     .7897494    .8606256
       HCC136 |   .8870123    .040171    -2.65   0.008     .8116718    .9693461
       HCC137 |    .887949   .0340298    -3.10   0.002     .8236952    .9572151
       HCC157 |   .8268489     .10935    -1.44   0.151     .6380512    1.071511
       HCC158 |   .6793951   .0607964    -4.32   0.000      .570101    .8096421
       HCC161 |   .9138833   .0226942    -3.63   0.000     .8704687    .9594633
       HCC162 |    1.42047   .4299623     1.16   0.246     .7848407    2.570883
       HCC166 |    .429444   .1428371    -2.54   0.011     .2237633    .8241841
       HCC167 |   1.048207    .066695     0.74   0.459     .9253092    1.187427
       HCC169 |   .8933659   .0381972    -2.64   0.008     .8215519    .9714574
       HCC170 |    .801617   .0409718    -4.33   0.000     .7252049    .8860803
       HCC173 |   1.117096   .0667163     1.85   0.064      .993698    1.255819
       HCC176 |   1.014285   .0319021     0.45   0.652     .9536466     1.07878
       HCC186 |   1.007688    .067425     0.11   0.909      .883836    1.148895
       HCC188 |   .8552564   .0434845    -3.08   0.002     .7741373    .9448757
       HCC189 |   .7909514   .0508274    -3.65   0.000     .6973497    .8971167
              |
 providertype |
           1  |   1.175356   .1447585     1.31   0.190     .9232819    1.496252
           2  |    1.04165   .0539496     0.79   0.431     .9411006    1.152943
              |
       n_pcps |   .9999836    .000111    -0.15   0.882     .9997661    1.000201
       n_spec |   1.000016   .0000453     0.36   0.722     .9999273    1.000105
lives_covered |   1.000002   1.13e-06     1.78   0.076     .9999998    1.000004
        _cons |   .7632717   .0485676    -4.25   0.000     .6737775     .864653
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    322,604
Model VCE    : Robust

Expression   : Pr(eyeexam_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .5999408   .0068991    86.96   0.000     .5864187    .6134628
          1  |   .5907086   .0143298    41.22   0.000     .5626228    .6187944
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -206268.28  
Iteration 1:   log pseudolikelihood = -200002.07  
Iteration 2:   log pseudolikelihood = -199882.97  
Iteration 3:   log pseudolikelihood =  -199881.2  
Iteration 4:   log pseudolikelihood = -199881.19  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(96)     =   21068.46
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -199881.19               Pseudo R2         =     0.0310

                               (Std. Err. adjusted for 298 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
     eyeexam_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   .9720842   .0265683    -1.04   0.300     .9213814    1.025577
           2015  |   1.081742   .0725514     1.17   0.241     .9484935     1.23371
           2016  |   .9768528   .0312777    -0.73   0.465     .9174335     1.04012
                 |
     aco_exit_gr |
           2014  |   .9292102   .0573842    -1.19   0.234     .8232795    1.048771
                 |
year#aco_exit_gr |
      2014 2014  |   .9972863   .0558941    -0.05   0.961     .8935384     1.11308
      2015 2014  |   .8965711   .0710749    -1.38   0.168     .7675496     1.04728
      2016 2014  |   .9777935    .048546    -0.45   0.651      .887128    1.077725
                 |
          agegrp |
              1  |    1.26455   .0150409    19.73   0.000     1.235411    1.294376
              2  |   1.388918   .0250456    18.22   0.000     1.340687    1.438885
                 |
        1.female |     1.2843   .0148625    21.62   0.000     1.255498    1.313763
                 |
         race_g3 |
              1  |   .8280043   .0397309    -3.93   0.000     .7536828    .9096548
              2  |    1.01184   .0288687     0.41   0.680     .9568111    1.070033
                 |
            HCC1 |   1.028555   .1198432     0.24   0.809     .8185569    1.292428
            HCC2 |   .9035029   .0253557    -3.62   0.000     .8551487    .9545914
            HCC6 |   1.138811   .0794443     1.86   0.062     .9932789    1.305666
            HCC8 |   .6504808   .0253529   -11.03   0.000     .6026406    .7021188
            HCC9 |    .964704   .0342381    -1.01   0.311     .8998793    1.034198
           HCC10 |   1.035888   .0394014     0.93   0.354      .961471    1.116065
           HCC11 |   1.062945   .0303703     2.14   0.033     1.005056    1.124168
           HCC12 |     1.2545     .02255    12.61   0.000     1.211072    1.299485
           HCC17 |   1.848091   .0840608    13.50   0.000     1.690466    2.020415
           HCC18 |   2.032878    .045944    31.39   0.000     1.944795    2.124951
           HCC19 |   1.317444   .0276476    13.14   0.000     1.264355    1.372762
           HCC21 |   .8070088   .0357405    -4.84   0.000     .7399128    .8801891
           HCC22 |   1.014618   .0196074     0.75   0.453     .9769064    1.053784
           HCC23 |   1.128707   .0260351     5.25   0.000     1.078816    1.180906
           HCC27 |   .8753107   .0516474    -2.26   0.024     .7797178    .9826233
           HCC28 |   .9317928   .0478551    -1.38   0.169     .8425647     1.03047
           HCC29 |   1.073493   .0542894     1.40   0.161      .972191     1.18535
           HCC33 |   .9283371   .0310096    -2.23   0.026     .8695062    .9911485
           HCC34 |   .9561686   .0692196    -0.62   0.536     .8296859    1.101933
           HCC35 |   1.209741   .0545185     4.23   0.000      1.10747    1.321456
           HCC39 |   .9220692   .0378169    -1.98   0.048     .8508502    .9992494
           HCC40 |   1.227713   .0277827     9.07   0.000      1.17445    1.283391
           HCC46 |   1.110038   .0690794     1.68   0.093     .9825765    1.254035
           HCC47 |   1.035425   .0340767     1.06   0.290     .9707443    1.104415
           HCC48 |   1.064897   .0235964     2.84   0.005     1.019639    1.112164
           HCC54 |    .695775   .0782454    -3.23   0.001     .5581418    .8673475
           HCC55 |    .861253   .0575331    -2.24   0.025     .7555602    .9817308
           HCC57 |   .8411814   .0663034    -2.19   0.028     .7207696    .9817092
           HCC58 |   .9832772   .0255901    -0.65   0.517     .9343792    1.034734
           HCC70 |   .7663824   .0897731    -2.27   0.023     .6091677    .9641714
           HCC71 |    .843685    .101109    -1.42   0.156     .6670686    1.067063
           HCC72 |   1.056643   .0597121     0.97   0.330     .9458582    1.180404
           HCC73 |   .5754331   .1183796    -2.69   0.007     .3844886    .8612044
           HCC74 |   1.197215   .2012072     1.07   0.284      .861225    1.664283
           HCC75 |   1.161894   .0388086     4.49   0.000     1.088267    1.240502
           HCC76 |   1.261933   .3698253     0.79   0.427     .7105275    2.241257
           HCC77 |   1.138322   .0738163     2.00   0.046     1.002462    1.292596
           HCC78 |   .9463108    .044318    -1.18   0.239     .8633165    1.037284
           HCC79 |    .933143   .0289265    -2.23   0.026      .878136    .9915956
           HCC80 |   .9288991   .0956425    -0.72   0.474     .7591473    1.136609
           HCC82 |   .8121619   .0719144    -2.35   0.019     .6827651    .9660818
           HCC83 |   1.002129   .2059033     0.01   0.992     .6699318    1.499051
           HCC84 |   .8388375   .0201959    -7.30   0.000     .8001737    .8793696
           HCC85 |   .8728537   .0160702    -7.39   0.000     .8419181     .904926
           HCC86 |   .8719028   .0301102    -3.97   0.000     .8148408    .9329609
           HCC87 |   1.000978   .0280973     0.03   0.972     .9473957     1.05759
           HCC88 |   1.116873   .0312271     3.95   0.000     1.057316    1.179785
           HCC96 |   1.034524   .0149293     2.35   0.019     1.005673    1.064202
           HCC99 |   .9232988   .0583592    -1.26   0.207     .8157182    1.045068
          HCC100 |   .8795756   .0192269    -5.87   0.000     .8426875    .9180785
          HCC103 |   .8093729    .039293    -4.36   0.000     .7359105    .8901687
          HCC104 |   .8600629   .1086542    -1.19   0.233     .6714218    1.101704
          HCC106 |   .7523156   .0350534    -6.11   0.000     .6866559    .8242539
          HCC107 |   .9539938   .0259918    -1.73   0.084     .9043871    1.006321
          HCC108 |   1.049767   .0148744     3.43   0.001     1.021015    1.079329
          HCC110 |   .4725644    .116657    -3.04   0.002     .2912955    .7666342
          HCC111 |   .7985612   .0144321   -12.45   0.000     .7707699    .8273545
          HCC112 |   1.214927    .048198     4.91   0.000      1.12404    1.313163
          HCC114 |   1.020751   .0586759     0.36   0.721       .91199    1.142482
          HCC115 |   .8886751   .0710768    -1.48   0.140     .7597371    1.039496
          HCC122 |   3.707098   .1402298    34.64   0.000     3.442194    3.992388
          HCC124 |   8.635756   .9055811    20.56   0.000     7.031368    10.60623
          HCC134 |   .6268644   .0276641   -10.58   0.000     .5749224     .683499
          HCC135 |    .819301   .0179482    -9.10   0.000     .7848676     .855245
          HCC136 |   .8741567   .0404861    -2.90   0.004     .7983004     .957221
          HCC137 |   .8787063   .0347964    -3.27   0.001     .8130861    .9496223
          HCC157 |   .7340982   .1068685    -2.12   0.034     .5518716    .9764956
          HCC158 |   .7501792   .0688597    -3.13   0.002     .6266606    .8980441
          HCC161 |   .9115718   .0235214    -3.59   0.000     .8666171    .9588585
          HCC162 |   1.347347   .4486749     0.90   0.371     .7014939    2.587825
          HCC166 |   .4344651   .1431432    -2.53   0.011     .2277769    .8287056
          HCC167 |   1.042105   .0690542     0.62   0.534     .9151814    1.186631
          HCC169 |   .9391763   .0404521    -1.46   0.145     .8631459    1.021904
          HCC170 |   .8278175   .0433552    -3.61   0.000     .7470587    .9173065
          HCC173 |   1.058265   .0662489     0.90   0.366      .936069    1.196412
          HCC176 |   .9905481   .0313285    -0.30   0.764     .9310098    1.053894
          HCC186 |   .9465781   .0647858    -0.80   0.422     .8277486    1.082467
          HCC188 |   .8630102    .042808    -2.97   0.003     .7830575    .9511264
          HCC189 |   .7705309   .0512632    -3.92   0.000     .6763319    .8778499
                 |
    providertype |
              1  |   1.165312   .1466873     1.22   0.224     .9105309    1.491385
              2  |   1.045581   .0583199     0.80   0.424     .9373021    1.166368
                 |
          n_pcps |   .9999733   .0001181    -0.23   0.821     .9997418    1.000205
          n_spec |   1.000011   .0000459     0.24   0.807     .9999213    1.000101
   lives_covered |   1.000002   1.22e-06     1.86   0.063     .9999999    1.000005
           _cons |   .7588629    .051378    -4.08   0.000     .6645591    .8665488
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(eyeexam_ind), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |   .5981748   .0059019   101.35   0.000     .5866073    .6097423
           2014  |   .5915831   .0067389    87.79   0.000     .5783751    .6047911
           2015  |    .614521    .013571    45.28   0.000     .5879224    .6411196
           2016  |   .5924162   .0074828    79.17   0.000     .5777502    .6070821
                 |
     aco_exit_gr |
              0  |   .6010549   .0074459    80.72   0.000     .5864612    .6156486
           2014  |   .5756441   .0136011    42.32   0.000     .5489864    .6023018
                 |
year#aco_exit_gr |
      2013    0  |   .5992847   .0062631    95.69   0.000     .5870093    .6115601
      2013 2014  |   .5822476   .0128553    45.29   0.000     .5570517    .6074434
      2014    0  |   .5927391   .0069738    85.00   0.000     .5790707    .6064074
      2014 2014  |   .5749891   .0156424    36.76   0.000     .5443305    .6056478
      2015    0  |   .6172696   .0142803    43.23   0.000     .5892807    .6452585
      2015 2014  |   .5750888   .0150228    38.28   0.000     .5456448    .6045329
      2016    0  |   .5938727   .0077595    76.54   0.000     .5786644     .609081
      2016 2014  |   .5715057   .0151633    37.69   0.000     .5417861    .6012253
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -217152.05  
Iteration 1:   log pseudolikelihood = -210675.44  
Iteration 2:   log pseudolikelihood = -210555.03  
Iteration 3:   log pseudolikelihood = -210553.38  
Iteration 4:   log pseudolikelihood = -210553.38  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(96)     =   16266.58
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -210553.38               Pseudo R2         =     0.0304

                               (Std. Err. adjusted for 313 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
     eyeexam_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   .9725056   .0266663    -1.02   0.309     .9216203    1.026201
           2015  |   1.072791   .0713508     1.06   0.291     .9416777    1.222161
           2016  |   .9775105    .031344    -0.71   0.478      .917968    1.040915
                 |
     aco_exit_gr |
           2015  |   .9797567   .0578728    -0.35   0.729     .8726478    1.100012
                 |
year#aco_exit_gr |
      2014 2015  |   1.018388   .0423737     0.44   0.661     .9386329    1.104919
      2015 2015  |   .9787103   .0697302    -0.30   0.763     .8511548    1.125381
      2016 2015  |   .9799538   .0569452    -0.35   0.727     .8744646    1.098169
                 |
          agegrp |
              1  |   1.260072   .0144067    20.22   0.000     1.232149    1.288627
              2  |   1.385874    .024427    18.51   0.000     1.338815    1.434586
                 |
        1.female |   1.279978    .013938    22.67   0.000      1.25295     1.30759
                 |
         race_g3 |
              1  |   .8308696   .0377638    -4.08   0.000      .760055    .9082821
              2  |   1.009813    .028357     0.35   0.728     .9557358    1.066949
                 |
            HCC1 |   1.039947   .1175784     0.35   0.729     .8332454    1.297926
            HCC2 |   .8880896   .0239605    -4.40   0.000      .842348    .9363151
            HCC6 |   1.106936   .0754397     1.49   0.136     .9685266    1.265125
            HCC8 |   .6475703   .0240938   -11.68   0.000      .602028    .6965578
            HCC9 |   .9738637   .0336944    -0.77   0.444     .9100133    1.042194
           HCC10 |   1.034897    .037955     0.94   0.350      .963117    1.112026
           HCC11 |   1.033744   .0305609     1.12   0.262     .9755476    1.095411
           HCC12 |   1.240617   .0212848    12.57   0.000     1.199593    1.283043
           HCC17 |   1.873356   .0795113    14.79   0.000     1.723823    2.035861
           HCC18 |   2.030714   .0439379    32.74   0.000     1.946398    2.118683
           HCC19 |   1.311346   .0264455    13.44   0.000     1.260524    1.364216
           HCC21 |   .8193287   .0329909    -4.95   0.000     .7571534    .8866096
           HCC22 |   1.003683   .0198868     0.19   0.853     .9654525    1.043427
           HCC23 |   1.117806   .0249656     4.99   0.000      1.06993    1.167824
           HCC27 |   .8597039   .0495977    -2.62   0.009     .7677887    .9626226
           HCC28 |   .9067338   .0449901    -1.97   0.048     .8227067     .999343
           HCC29 |   1.051599   .0532081     0.99   0.320     .9523176    1.161231
           HCC33 |     .92991   .0300337    -2.25   0.024     .8728695    .9906781
           HCC34 |   .9155026   .0650898    -1.24   0.214     .7964186    1.052392
           HCC35 |   1.186084   .0515593     3.93   0.000     1.089215    1.291569
           HCC39 |   .9327414   .0364115    -1.78   0.074     .8640379    1.006908
           HCC40 |   1.233615   .0266385     9.72   0.000     1.182494    1.286946
           HCC46 |   1.075198   .0655689     1.19   0.234     .9540689    1.211706
           HCC47 |   1.022627    .034159     0.67   0.503      .957821    1.091818
           HCC48 |     1.0528   .0227594     2.38   0.017     1.009125    1.098366
           HCC54 |   .7169447   .0804278    -2.97   0.003     .5754357    .8932531
           HCC55 |   .8622376   .0587048    -2.18   0.029     .7545248    .9853271
           HCC57 |   .8886382   .0656184    -1.60   0.110      .768902     1.02702
           HCC58 |   .9834544   .0249126    -0.66   0.510      .935819    1.033515
           HCC70 |   .8120262   .0938453    -1.80   0.072     .6474367    1.018457
           HCC71 |   .8346117   .0961348    -1.57   0.117     .6659456    1.045996
           HCC72 |   1.059681    .058557     1.05   0.294     .9509084    1.180897
           HCC73 |   .6782802   .1439499    -1.83   0.067     .4474665    1.028153
           HCC74 |   1.275631   .2109505     1.47   0.141     .9224912    1.763956
           HCC75 |   1.153636   .0374177     4.41   0.000     1.082581    1.229355
           HCC76 |   1.308257   .3588024     0.98   0.327     .7642629    2.239461
           HCC77 |   1.219159   .0786828     3.07   0.002     1.074298    1.383553
           HCC78 |   .9600024   .0419562    -0.93   0.350     .8811934     1.04586
           HCC79 |   .9484146   .0286909    -1.75   0.080      .893816    1.006348
           HCC80 |   .9170115   .0896297    -0.89   0.375     .7571421    1.110637
           HCC82 |   .8245308   .0745532    -2.13   0.033     .6906247    .9844001
           HCC83 |   1.120284   .2334394     0.55   0.586     .7446618    1.685379
           HCC84 |   .8489099   .0203485    -6.83   0.000       .80995    .8897439
           HCC85 |   .8703454   .0151788    -7.96   0.000     .8410981    .9006096
           HCC86 |   .8536824    .029453    -4.59   0.000      .797864    .9134058
           HCC87 |   1.001498   .0270833     0.06   0.956     .9497979    1.056012
           HCC88 |   1.093564   .0286869     3.41   0.001      1.03876     1.15126
           HCC96 |   1.033204   .0148527     2.27   0.023       1.0045    1.062729
           HCC99 |   .9254871   .0558146    -1.28   0.199     .8223105    1.041609
          HCC100 |   .8813235   .0186576    -5.97   0.000     .8455035     .918661
          HCC103 |   .8185443    .036839    -4.45   0.000     .7494341    .8940276
          HCC104 |   .9798366   .1291847    -0.15   0.877     .7567085    1.268758
          HCC106 |   .7748137   .0357202    -5.53   0.000     .7078732    .8480844
          HCC107 |    .964652   .0258401    -1.34   0.179      .915313    1.016651
          HCC108 |   1.055084   .0152489     3.71   0.000     1.025616    1.085398
          HCC110 |   .4986286   .1154091    -3.01   0.003     .3167846    .7848566
          HCC111 |   .8062298   .0138528   -12.54   0.000     .7795309    .8338432
          HCC112 |   1.172157   .0443028     4.20   0.000     1.088463    1.262286
          HCC114 |    1.03099   .0562556     0.56   0.576     .9264226    1.147361
          HCC115 |   .8924921    .071062    -1.43   0.153     .7635369    1.043227
          HCC122 |   3.619244   .1430272    32.55   0.000     3.349497    3.910715
          HCC124 |   8.111688   .8086224    21.00   0.000     6.672035    9.861982
          HCC134 |   .6290745   .0265358   -10.99   0.000     .5791573    .6832942
          HCC135 |    .824516   .0180772    -8.80   0.000     .7898358    .8607191
          HCC136 |   .8871999    .040154    -2.64   0.008     .8118892    .9694964
          HCC137 |   .8881187   .0340009    -3.10   0.002      .823917    .9573231
          HCC157 |   .8271139   .1092642    -1.44   0.151     .6384385    1.071548
          HCC158 |   .6795585   .0608531    -4.31   0.000     .5701688    .8099351
          HCC161 |   .9138821   .0226805    -3.63   0.000     .8704929     .959434
          HCC162 |   1.423871   .4302276     1.17   0.242      .787548     2.57433
          HCC166 |   .4292093   .1427225    -2.54   0.011     .2236784     .823596
          HCC167 |   1.048224   .0665827     0.74   0.458      .925521    1.187195
          HCC169 |   .8932762   .0382527    -2.64   0.008     .8213625    .9714863
          HCC170 |   .8017776   .0409362    -4.33   0.000     .7254279     .886163
          HCC173 |   1.116926   .0666764     1.85   0.064     .9935977    1.255561
          HCC176 |   1.014171    .031892     0.45   0.655     .9535508    1.078644
          HCC186 |   1.007525   .0673941     0.11   0.911     .8837272    1.148665
          HCC188 |   .8552222   .0434658    -3.08   0.002     .7741364    .9448013
          HCC189 |    .791211    .050818    -3.65   0.000     .6976237    .8973533
                 |
    providertype |
              1  |   1.175251   .1446163     1.31   0.189     .9233981    1.495795
              2  |   1.044156   .0558509     0.81   0.419     .9402326    1.159565
                 |
          n_pcps |   .9999825   .0001134    -0.15   0.877     .9997603    1.000205
          n_spec |   1.000015   .0000457     0.34   0.736     .9999258    1.000105
   lives_covered |   1.000002   1.17e-06     1.74   0.082     .9999997    1.000004
           _cons |   .7645767   .0509153    -4.03   0.000     .6710227     .871174
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    322,604
Model VCE    : Robust

Expression   : Pr(eyeexam_ind), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |    .598512   .0057245   104.55   0.000     .5872922    .6097318
           2014  |   .5925353   .0063981    92.61   0.000     .5799953    .6050752
           2015  |   .6140734    .012976    47.32   0.000     .5886409    .6395059
           2016  |   .5927197   .0072706    81.52   0.000     .5784696    .6069698
                 |
     aco_exit_gr |
              0  |   .6003832   .0072443    82.88   0.000     .5861846    .6145817
           2015  |   .5941277    .011101    53.52   0.000     .5723701    .6158854
                 |
year#aco_exit_gr |
      2013    0  |   .5990439   .0063571    94.23   0.000     .5865842    .6115036
      2013 2015  |   .5943152    .011763    50.52   0.000       .57126    .6173703
      2014    0  |   .5925934   .0069199    85.64   0.000     .5790307    .6061562
      2014 2015  |   .5920761   .0118592    49.93   0.000     .5688324    .6153197
      2015    0  |   .6151538   .0138622    44.38   0.000     .5879843    .6423233
      2015 2015  |   .6055573   .0143868    42.09   0.000     .5773597    .6337548
      2016    0  |   .5937834   .0076719    77.40   0.000     .5787468      .60882
      2016 2015  |   .5843207   .0134269    43.52   0.000     .5580046    .6106369
----------------------------------------------------------------------------------
***********************************************************
                    Oct 2019 New Models                    
              All Years of Data hba1ctest_ind              
20:44:09 28 Sep 2021
***********************************************************

Iteration 0:   log pseudolikelihood = -102822.59  
Iteration 1:   log pseudolikelihood = -96414.177  
Iteration 2:   log pseudolikelihood = -95101.062  
Iteration 3:   log pseudolikelihood = -95095.189  
Iteration 4:   log pseudolikelihood = -95095.188  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(93)     =    9650.70
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -95095.188               Pseudo R2         =     0.0752

                                 (Std. Err. adjusted for 298 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
     hba1ctest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   1.011749   .0273058     0.43   0.665     .9596217    1.066708
             2015  |   1.197575   .0572088     3.77   0.000     1.090537    1.315119
             2016  |    1.22613   .0394451     6.34   0.000     1.151206     1.30593
                   |
1.aco_death_active |   .6629979   .0532535    -5.12   0.000     .5664241    .7760374
                   |
            agegrp |
                1  |   1.001188   .0152531     0.08   0.938     .9717343    1.031534
                2  |   .9396669   .0277109    -2.11   0.035     .8868944    .9955795
                   |
          1.female |   1.175932   .0209195     9.11   0.000     1.135637    1.217657
                   |
           race_g3 |
                1  |   .7179509   .0412383    -5.77   0.000     .6415089    .8035018
                2  |   .9702872   .0654237    -0.45   0.655     .8501708    1.107374
                   |
              HCC1 |   1.115593   .1545182     0.79   0.430     .8503702    1.463538
              HCC2 |   .8872343   .0379943    -2.79   0.005     .8158062    .9649162
              HCC6 |   .8218319   .0779493    -2.07   0.039     .6824141    .9897327
              HCC8 |   .3687747   .0211321   -17.41   0.000     .3295977    .4126084
              HCC9 |   .7306015   .0346273    -6.62   0.000     .6657901    .8017219
             HCC10 |   .7938198   .0427789    -4.28   0.000     .7142508    .8822529
             HCC11 |   .9550603   .0344438    -1.27   0.202     .8898824    1.025012
             HCC12 |   1.080375   .0318775     2.62   0.009     1.019669    1.144696
             HCC17 |   5.267513   .4836598    18.10   0.000     4.399961    6.306123
             HCC18 |   5.254196   .2855829    30.52   0.000     4.723247     5.84483
             HCC19 |   3.466911   .1499856    28.74   0.000     3.185063      3.7737
             HCC21 |   .6721236   .0379175    -7.04   0.000     .6017679    .7507049
             HCC22 |   1.104249    .034234     3.20   0.001     1.039149    1.173427
             HCC23 |   1.020702   .0360872     0.58   0.562     .9523675     1.09394
             HCC27 |   .7007027   .0503457    -4.95   0.000     .6086599    .8066645
             HCC28 |   .8200949   .0595639    -2.73   0.006     .7112806    .9455562
             HCC29 |    1.05741   .1103706     0.53   0.593     .8617804     1.29745
             HCC33 |   .8752389   .0451033    -2.59   0.010     .7911557    .9682583
             HCC34 |   1.065152   .1367022     0.49   0.623     .8282627    1.369794
             HCC35 |   .9601377   .0568125    -0.69   0.492     .8550015    1.078202
             HCC39 |    .816473   .0422809    -3.92   0.000     .7376707    .9036935
             HCC40 |   .8990651    .030677    -3.12   0.002     .8409057    .9612468
             HCC46 |   .7551841   .0658732    -3.22   0.001     .6365085    .8959865
             HCC47 |   .7675993    .038455    -5.28   0.000     .6958111    .8467941
             HCC48 |   .9841846   .0375012    -0.42   0.676     .9133612      1.0605
             HCC54 |   .7361681   .1126149    -2.00   0.045     .5454625    .9935485
             HCC55 |    .945937   .1001098    -0.53   0.599      .768738    1.163981
             HCC57 |   .6428335   .0460039    -6.17   0.000     .5587056    .7396292
             HCC58 |   .8371262   .0269831    -5.52   0.000     .7858761    .8917184
             HCC70 |   .8014313   .1092342    -1.62   0.104     .6135478    1.046849
             HCC71 |   .7940853   .1101054    -1.66   0.096      .605121    1.042059
             HCC72 |     .99435   .0692482    -0.08   0.935     .8674814    1.139773
             HCC73 |   .8147514   .2997888    -0.56   0.578     .3961179    1.675814
             HCC74 |   .7243031    .123988    -1.88   0.060     .5178566    1.013051
             HCC75 |   .9689642   .0533158    -0.57   0.567     .8699046    1.079304
             HCC76 |   .8935627    .216228    -0.47   0.642     .5560934    1.435828
             HCC77 |   .7116985   .0691693    -3.50   0.000     .5882591    .8610404
             HCC78 |   .6653711   .0374686    -7.23   0.000     .5958415    .7430143
             HCC79 |   .7061227   .0273202    -8.99   0.000      .654556     .761752
             HCC80 |   .7455245   .0903591    -2.42   0.015      .587888    .9454298
             HCC82 |   .8076651   .0866912    -1.99   0.047     .6544358    .9967713
             HCC83 |   .6859893   .1557266    -1.66   0.097     .4396285    1.070407
             HCC84 |   .7646424   .0297215    -6.90   0.000      .708553    .8251718
             HCC85 |   .8343963   .0203912    -7.41   0.000     .7953723    .8753349
             HCC86 |   .8584095   .0412572    -3.18   0.001     .7812387    .9432032
             HCC87 |   .9787454   .0380633    -0.55   0.581     .9069151    1.056265
             HCC88 |   .9845647   .0379952    -0.40   0.687     .9128422    1.061923
             HCC96 |   .8792469    .019575    -5.78   0.000     .8417056    .9184626
             HCC99 |   .8591969   .0779159    -1.67   0.094     .7192864    1.026322
            HCC100 |   .8501415   .0294115    -4.69   0.000     .7944071    .9097862
            HCC103 |   .7546792   .0446114    -4.76   0.000     .6721176    .8473824
            HCC104 |   .7497673   .1142767    -1.89   0.059      .556147    1.010796
            HCC106 |    .693501   .0512495    -4.95   0.000     .5999893     .801587
            HCC107 |   .8671044   .0316398    -3.91   0.000     .8072572    .9313886
            HCC108 |   .8886263   .0194249    -5.40   0.000     .8513583    .9275257
            HCC110 |   .6593653   .2732045    -1.01   0.315     .2927084    1.485309
            HCC111 |   .7606776   .0159698   -13.03   0.000     .7300126    .7926308
            HCC112 |   .9051461   .0486926    -1.85   0.064     .8145693    1.005795
            HCC114 |   .8455961   .0509056    -2.79   0.005     .7514842    .9514939
            HCC115 |   .9307831   .0960947    -0.69   0.487     .7602734    1.139534
            HCC122 |   1.127139   .0743097     1.82   0.069     .9905118    1.282612
            HCC124 |    1.07043   .0949014     0.77   0.443       .89969    1.273572
            HCC134 |   .7619978   .0456073    -4.54   0.000      .677653    .8568407
            HCC135 |   .7468624   .0280899    -7.76   0.000     .6937875    .8039975
            HCC136 |   .7259842   .0610331    -3.81   0.000     .6156971    .8560264
            HCC137 |   .7486602   .0528994    -4.10   0.000     .6518383    .8598636
            HCC157 |   .6805052    .094128    -2.78   0.005     .5189108     .892422
            HCC158 |   .6336331   .0623599    -4.64   0.000     .5224751    .7684402
            HCC161 |   .7853548   .0320547    -5.92   0.000      .724976    .8507623
            HCC162 |   1.240894   .6141102     0.44   0.663     .4704142    3.273321
            HCC166 |   1.067779   .5661492     0.12   0.902     .3777151    3.018551
            HCC167 |   .8598317    .081249    -1.60   0.110     .7144633    1.034777
            HCC169 |   .7575182   .0501893    -4.19   0.000     .6652683    .8625601
            HCC170 |   .7285056   .0535403    -4.31   0.000      .630776    .8413768
            HCC173 |   .9984976   .0947592    -0.02   0.987     .8290228    1.202618
            HCC176 |   .8409016   .0313249    -4.65   0.000     .7816938    .9045941
            HCC186 |   .9248609   .0777846    -0.93   0.353     .7843084    1.090601
            HCC188 |   .7838901   .0566149    -3.37   0.001     .6804228    .9030911
            HCC189 |   .8158856   .0896585    -1.85   0.064     .6577939    1.011973
                   |
      providertype |
                1  |   1.202254   .0944544     2.34   0.019     1.030676    1.402395
                2  |   1.239611   .0821973     3.24   0.001     1.088537    1.411652
                   |
            n_pcps |   1.000126   .0001898     0.66   0.506     .9997542    1.000498
            n_spec |   .9999277   .0000938    -0.77   0.441      .999744    1.000112
     lives_covered |   1.000002   1.19e-06     1.91   0.056     .9999999    1.000005
             _cons |   3.070707    .177194    19.44   0.000     2.742332    3.438401
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -102822.59  
Iteration 1:   log pseudolikelihood = -96413.732  
Iteration 2:   log pseudolikelihood = -95100.625  
Iteration 3:   log pseudolikelihood = -95094.754  
Iteration 4:   log pseudolikelihood = -95094.753  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(94)     =    9822.85
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -95094.753               Pseudo R2         =     0.0752

                            (Std. Err. adjusted for 298 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
hba1ctest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |    1.01155   .0272519     0.43   0.670     .9595228    1.066398
        2015  |   1.202856   .0606782     3.66   0.000     1.089619    1.327861
        2016  |    1.22332   .0397368     6.21   0.000     1.147864    1.303735
              |
   death_year |
           1  |    .643551   .0586766    -4.83   0.000      .538237    .7694712
           2  |   .6856488   .0644937    -4.01   0.000     .5702113    .8244563
              |
       agegrp |
           1  |   1.001048   .0152739     0.07   0.945     .9715554    1.031437
           2  |   .9395553   .0276901    -2.12   0.034     .8868214    .9954249
              |
     1.female |   1.175934   .0209167     9.11   0.000     1.135645    1.217653
              |
      race_g3 |
           1  |   .7179977   .0412384    -5.77   0.000     .6415551    .8035485
           2  |   .9704326   .0653935    -0.45   0.656     .8503669    1.107451
              |
         HCC1 |    1.11571   .1545032     0.79   0.429     .8505058    1.463611
         HCC2 |   .8871331   .0379791    -2.80   0.005     .8157329    .9647829
         HCC6 |    .821704    .077906    -2.07   0.038     .6823586    .9895053
         HCC8 |   .3687674   .0211295   -17.41   0.000     .3295952    .4125954
         HCC9 |   .7306006   .0346303    -6.62   0.000     .6657838    .8017276
        HCC10 |   .7937646    .042765    -4.29   0.000     .7142203    .8821678
        HCC11 |   .9551176   .0344433    -1.27   0.203     .8899404    1.025068
        HCC12 |   1.080404   .0318799     2.62   0.009     1.019693    1.144729
        HCC17 |   5.267821   .4837531    18.09   0.000     4.400111    6.306644
        HCC18 |   5.254338   .2855425    30.53   0.000     4.723459    5.844883
        HCC19 |   3.466986   .1499625    28.74   0.000     3.185179    3.773726
        HCC21 |   .6721262   .0379192    -7.04   0.000     .6017676    .7507111
        HCC22 |   1.104231   .0342425     3.20   0.001     1.039116    1.173426
        HCC23 |   1.020774   .0360949     0.58   0.561     .9524254    1.094028
        HCC27 |   .7006483   .0503488    -4.95   0.000     .6086008    .8066175
        HCC28 |   .8201281   .0595857    -2.73   0.006     .7112765    .9456382
        HCC29 |    1.05781   .1103813     0.54   0.590     .8621556    1.297865
        HCC33 |   .8752641   .0450953    -2.59   0.010      .791195    .9682661
        HCC34 |   1.065545   .1367413     0.49   0.621     .8285855    1.370271
        HCC35 |   .9601203   .0568094    -0.69   0.492     .8549897    1.078178
        HCC39 |   .8166064   .0422867    -3.91   0.000     .7377932    .9038387
        HCC40 |     .89902   .0306588    -3.12   0.002      .840894    .9611639
        HCC46 |   .7551179   .0658661    -3.22   0.001      .636455    .8959047
        HCC47 |   .7676284   .0384591    -5.28   0.000     .6958327    .8468321
        HCC48 |   .9841978   .0374878    -0.42   0.676     .9133987    1.060485
        HCC54 |   .7365672    .112695    -2.00   0.046     .5457305    .9941375
        HCC55 |   .9441264   .0999114    -0.54   0.587     .7672774    1.161737
        HCC57 |   .6429458   .0460053    -6.17   0.000     .5588144    .7397435
        HCC58 |     .83708    .026986    -5.52   0.000     .7858248    .8916783
        HCC70 |   .8010766   .1091457    -1.63   0.104     .6133365    1.046283
        HCC71 |   .7937191   .1099373    -1.67   0.095     .6050172    1.041276
        HCC72 |    .994045   .0692194    -0.09   0.932     .8672283    1.139406
        HCC73 |   .8149881   .2998485    -0.56   0.578     .3962591     1.67619
        HCC74 |   .7241234   .1239043    -1.89   0.059     .5178023    1.012654
        HCC75 |   .9691865   .0533008    -0.57   0.569     .8701521    1.079492
        HCC76 |   .8931569   .2161065    -0.47   0.641     .5558693    1.435102
        HCC77 |   .7115141   .0691128    -3.50   0.000     .5881692    .8607257
        HCC78 |   .6654116   .0374848    -7.23   0.000     .5958534    .7430899
        HCC79 |   .7060759   .0273196    -8.99   0.000     .6545105    .7617039
        HCC80 |   .7455321   .0903437    -2.42   0.015     .5879191     .945399
        HCC82 |   .8080984   .0867142    -1.99   0.047     .6548244    .9972492
        HCC83 |   .6851801   .1555343    -1.67   0.096     .4391208    1.069118
        HCC84 |   .7645674   .0297116    -6.91   0.000     .7084961    .8250762
        HCC85 |   .8344322   .0203902    -7.41   0.000     .7954102    .8753687
        HCC86 |   .8583963   .0412558    -3.18   0.001     .7812281    .9431871
        HCC87 |   .9788801    .038095    -0.55   0.583     .9069918    1.056466
        HCC88 |   .9845985   .0379686    -0.40   0.687     .9129241      1.0619
        HCC96 |   .8792499   .0195792    -5.78   0.000     .8417007    .9184743
        HCC99 |   .8593638   .0779589    -1.67   0.095     .7193804    1.026586
       HCC100 |   .8502224   .0294093    -4.69   0.000     .7944917    .9098624
       HCC103 |   .7546036   .0445844    -4.77   0.000     .6720896    .8472481
       HCC104 |   .7500198   .1142889    -1.89   0.059     .5563725    1.011067
       HCC106 |   .6935253   .0512427    -4.95   0.000      .600025    .8015954
       HCC107 |   .8670752   .0316358    -3.91   0.000     .8072353     .931351
       HCC108 |   .8886274   .0194252    -5.40   0.000     .8513588    .9275274
       HCC110 |   .6597325   .2734697    -1.00   0.316     .2927731    1.486636
       HCC111 |   .7606727   .0159697   -13.03   0.000      .730008    .7926256
       HCC112 |   .9052043    .048709    -1.85   0.064     .8145982    1.005888
       HCC114 |   .8456161   .0509125    -2.79   0.005     .7514922    .9515289
       HCC115 |   .9311317   .0960848    -0.69   0.489     .7606316     1.13985
       HCC122 |   1.127096    .074324     1.81   0.070     .9904444    1.282601
       HCC124 |   1.070563   .0949247     0.77   0.442     .8997828    1.273757
       HCC134 |   .7619532   .0456027    -4.54   0.000     .6776167    .8567863
       HCC135 |   .7468953   .0280831    -7.76   0.000     .6938327    .8040159
       HCC136 |   .7259739     .06103    -3.81   0.000     .6156921    .8560092
       HCC137 |   .7487059   .0528799    -4.10   0.000     .6519169     .859865
       HCC157 |   .6805811   .0940854    -2.78   0.005     .5190479    .8923851
       HCC158 |   .6333724   .0623021    -4.64   0.000     .5223122    .7680476
       HCC161 |   .7854101   .0320652    -5.92   0.000     .7250122    .8508396
       HCC162 |   1.242923   .6142608     0.44   0.660     .4718181    3.274264
       HCC166 |   1.067964   .5664439     0.12   0.901     .3776441    3.020164
       HCC167 |   .8600167   .0813012    -1.60   0.111     .7145606    1.035082
       HCC169 |   .7575293   .0501961    -4.19   0.000     .6652674    .8625863
       HCC170 |   .7284252   .0535249    -4.31   0.000     .6307226    .8412625
       HCC173 |   .9986287   .0947625    -0.01   0.988     .8291466    1.202754
       HCC176 |   .8409719   .0313413    -4.65   0.000     .7817339    .9046987
       HCC186 |   .9248402    .077782    -0.93   0.353     .7842923    1.090575
       HCC188 |   .7838915   .0566048    -3.37   0.001     .6804413    .9030697
       HCC189 |   .8160105   .0896682    -1.85   0.064     .6579009    1.012118
              |
 providertype |
           1  |   1.202398   .0944403     2.35   0.019     1.030842    1.402506
           2  |   1.239696   .0821794     3.24   0.001     1.088651    1.411696
              |
       n_pcps |   1.000122    .000189     0.64   0.520     .9997513    1.000492
       n_spec |   .9999279   .0000937    -0.77   0.442     .9997442    1.000112
lives_covered |   1.000002   1.25e-06     1.88   0.060     .9999999    1.000005
        _cons |   3.067813   .1779046    19.33   0.000     2.738212    3.437088
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(hba1ctest_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .8962992   .0025725   348.41   0.000     .8912571    .9013412
          1  |   .8514303   .0104762    81.27   0.000     .8308973    .8719633
          2  |    .858704    .010504    81.75   0.000     .8381165    .8792915
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -107699.84  
Iteration 1:   log pseudolikelihood = -101156.95  
Iteration 2:   log pseudolikelihood = -99817.439  
Iteration 3:   log pseudolikelihood = -99811.556  
Iteration 4:   log pseudolikelihood = -99811.556  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(93)     =    9046.57
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -99811.556               Pseudo R2         =     0.0732

                                 (Std. Err. adjusted for 313 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
     hba1ctest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   1.005359   .0264926     0.20   0.839     .9547527    1.058648
             2015  |   1.158865   .0513197     3.33   0.001     1.062522    1.263944
             2016  |   1.202073   .0382339     5.79   0.000     1.129424    1.279395
                   |
1.aco_death_active |   .7489429   .0609735    -3.55   0.000     .6384841    .8785112
                   |
            agegrp |
                1  |   .9944436   .0147835    -0.37   0.708     .9658864    1.023845
                2  |   .9364937   .0258634    -2.38   0.018     .8871499     .988582
                   |
          1.female |   1.184027   .0201973     9.90   0.000     1.145095    1.224282
                   |
           race_g3 |
                1  |   .7356822   .0412699    -5.47   0.000     .6590829     .821184
                2  |   1.003682   .0648518     0.06   0.955     .8842946    1.139189
                   |
              HCC1 |   1.062502   .1520589     0.42   0.672     .8026221    1.406529
              HCC2 |   .8953644   .0366405    -2.70   0.007     .8263548     .970137
              HCC6 |   .8390458   .0756708    -1.95   0.052     .7031024    1.001274
              HCC8 |   .3730354   .0205331   -17.91   0.000     .3348861    .4155307
              HCC9 |    .727686   .0334091    -6.92   0.000     .6650651    .7962032
             HCC10 |    .778348   .0391602    -4.98   0.000     .7052584    .8590123
             HCC11 |   .9372945   .0342473    -1.77   0.076      .872518     1.00688
             HCC12 |   1.091608   .0311187     3.07   0.002     1.032289    1.154336
             HCC17 |    5.30168    .474104    18.65   0.000      4.44933    6.317314
             HCC18 |   5.135388   .2738428    30.68   0.000     4.625762    5.701161
             HCC19 |   3.415921   .1437394    29.19   0.000     3.145502    3.709589
             HCC21 |   .6938068   .0373412    -6.79   0.000     .6243472    .7709938
             HCC22 |   1.121864   .0337806     3.82   0.000     1.057571    1.190065
             HCC23 |   1.025859   .0363357     0.72   0.471     .9570578    1.099605
             HCC27 |   .7188897   .0509398    -4.66   0.000     .6256724    .8259953
             HCC28 |   .8439161   .0607295    -2.36   0.018     .7329013    .9717467
             HCC29 |   1.068035   .1080484     0.65   0.515     .8759374     1.30226
             HCC33 |   .8966566   .0444297    -2.20   0.028     .8136708     .988106
             HCC34 |   .9509075   .1186649    -0.40   0.687     .7445875    1.214397
             HCC35 |   .9077093   .0505463    -1.74   0.082     .8138553    1.012387
             HCC39 |   .8491728    .041864    -3.32   0.001     .7709604    .9353196
             HCC40 |   .8896549   .0292028    -3.56   0.000     .8342207    .9487727
             HCC46 |   .7682436   .0661709    -3.06   0.002     .6489073    .9095263
             HCC47 |   .7493991   .0368261    -5.87   0.000     .6805882    .8251673
             HCC48 |   .9742676   .0345242    -0.74   0.462     .9088978    1.044339
             HCC54 |   .8471422   .1324592    -1.06   0.289     .6235373    1.150934
             HCC55 |   .9454829   .1011509    -0.52   0.600     .7666362    1.166052
             HCC57 |   .6306845   .0427679    -6.80   0.000     .5521925    .7203338
             HCC58 |   .8366442   .0269474    -5.54   0.000     .7854608    .8911628
             HCC70 |   .7192185     .09978    -2.38   0.018      .547987    .9439552
             HCC71 |   .6403555   .0790807    -3.61   0.000      .502692    .8157185
             HCC72 |   .9594274   .0670767    -0.59   0.554     .8365692    1.100329
             HCC73 |   .7694138   .2562877    -0.79   0.431     .4005246    1.478056
             HCC74 |   .7947189   .1362368    -1.34   0.180      .567929    1.112072
             HCC75 |   .9978885   .0533183    -0.04   0.968     .8986724    1.108058
             HCC76 |   .7710302   .1812631    -1.11   0.269     .4863631    1.222312
             HCC77 |   .7345093   .0716561    -3.16   0.002     .6066765    .8892778
             HCC78 |   .6732237   .0392888    -6.78   0.000     .6004598    .7548051
             HCC79 |   .7268259    .026279    -8.82   0.000     .6771025    .7802007
             HCC80 |   .8111005   .0972774    -1.75   0.081     .6411917    1.026033
             HCC82 |   .7471678   .0753546    -2.89   0.004     .6131566    .9104684
             HCC83 |   .7093438   .1665211    -1.46   0.144     .4477485    1.123775
             HCC84 |   .7690202   .0297069    -6.80   0.000     .7129454    .8295055
             HCC85 |   .8372565   .0195434    -7.61   0.000     .7998151    .8764507
             HCC86 |    .852678   .0396514    -3.43   0.001     .7783991    .9340451
             HCC87 |    .997733   .0390285    -0.06   0.954     .9240974    1.077236
             HCC88 |   1.002434   .0374707     0.07   0.948     .9316183    1.078632
             HCC96 |   .8738288   .0187215    -6.30   0.000     .8378951    .9113035
             HCC99 |   .9077437   .0808381    -1.09   0.277     .7623606    1.080851
            HCC100 |   .8518613   .0279549    -4.89   0.000     .7987957    .9084523
            HCC103 |   .7531354   .0422994    -5.05   0.000     .6746303    .8407759
            HCC104 |   .7256656   .1070767    -2.17   0.030     .5434208    .9690293
            HCC106 |   .6769529   .0471998    -5.60   0.000     .5904856     .776082
            HCC107 |   .8825187   .0334199    -3.30   0.001     .8193887    .9505126
            HCC108 |   .8898619   .0190137    -5.46   0.000     .8533652    .9279195
            HCC110 |   .6195682   .2325232    -1.28   0.202     .2969163    1.292838
            HCC111 |   .7610497   .0152146   -13.66   0.000     .7318064    .7914616
            HCC112 |   .9048525   .0472932    -1.91   0.056     .8167491     1.00246
            HCC114 |   .8521756   .0497931    -2.74   0.006     .7599638    .9555761
            HCC115 |   .9102966   .0932082    -0.92   0.359      .744776    1.112603
            HCC122 |   1.122656   .0728385     1.78   0.075     .9885993    1.274891
            HCC124 |   1.126501   .0938548     1.43   0.153      .956783    1.326324
            HCC134 |   .7664384   .0451034    -4.52   0.000      .682945    .8601394
            HCC135 |   .7638969   .0279292    -7.37   0.000      .711072    .8206461
            HCC136 |   .7562396   .0610894    -3.46   0.001      .645504    .8859717
            HCC137 |   .7571304   .0528834    -3.98   0.000     .6602625    .8682099
            HCC157 |   .6863213   .0927884    -2.78   0.005     .5265599    .8945552
            HCC158 |   .6097329   .0591679    -5.10   0.000     .5041268    .7374617
            HCC161 |   .7655863   .0296653    -6.89   0.000     .7095964     .825994
            HCC162 |   1.390398   .8043004     0.57   0.569     .4474522    4.320478
            HCC166 |   1.278608   .7432459     0.42   0.672     .4092037    3.995167
            HCC167 |   .8257587   .0731749    -2.16   0.031     .6941025    .9823872
            HCC169 |   .7385525   .0470844    -4.75   0.000     .6518014    .8368496
            HCC170 |   .7073689   .0513133    -4.77   0.000     .6136191    .8154419
            HCC173 |   1.073073   .1068511     0.71   0.479     .8828173     1.30433
            HCC176 |   .8398656    .030516    -4.80   0.000     .7821354    .9018569
            HCC186 |   .9056296   .0749121    -1.20   0.231     .7700887    1.065027
            HCC188 |   .7503486   .0516866    -4.17   0.000     .6555856    .8588093
            HCC189 |   .7933636   .0832893    -2.20   0.027     .6458192    .9746161
                   |
      providertype |
                1  |    1.17935   .0927332     2.10   0.036     1.010909    1.375857
                2  |   1.234709   .0777672     3.35   0.001      1.09132    1.396937
                   |
            n_pcps |   1.000145   .0001789     0.81   0.419     .9997939    1.000495
            n_spec |   .9999227   .0000934    -0.83   0.408     .9997397    1.000106
     lives_covered |   1.000002   1.16e-06     1.65   0.099     .9999996    1.000004
             _cons |   3.176369   .1820305    20.17   0.000     2.838903    3.553951
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -107699.84  
Iteration 1:   log pseudolikelihood = -101156.95  
Iteration 2:   log pseudolikelihood = -99817.439  
Iteration 3:   log pseudolikelihood = -99811.556  
Iteration 4:   log pseudolikelihood = -99811.556  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(93)     =    9046.57
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -99811.556               Pseudo R2         =     0.0732

                            (Std. Err. adjusted for 313 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
hba1ctest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |   1.005359   .0264926     0.20   0.839     .9547527    1.058648
        2015  |   1.158865   .0513197     3.33   0.001     1.062522    1.263944
        2016  |   1.202073   .0382339     5.79   0.000     1.129424    1.279395
              |
 1.death_year |   .7489429   .0609735    -3.55   0.000     .6384841    .8785112
              |
       agegrp |
           1  |   .9944436   .0147835    -0.37   0.708     .9658864    1.023845
           2  |   .9364937   .0258634    -2.38   0.018     .8871499     .988582
              |
     1.female |   1.184027   .0201973     9.90   0.000     1.145095    1.224282
              |
      race_g3 |
           1  |   .7356822   .0412699    -5.47   0.000     .6590829     .821184
           2  |   1.003682   .0648518     0.06   0.955     .8842946    1.139189
              |
         HCC1 |   1.062502   .1520589     0.42   0.672     .8026221    1.406529
         HCC2 |   .8953644   .0366405    -2.70   0.007     .8263548     .970137
         HCC6 |   .8390458   .0756708    -1.95   0.052     .7031024    1.001274
         HCC8 |   .3730354   .0205331   -17.91   0.000     .3348861    .4155307
         HCC9 |    .727686   .0334091    -6.92   0.000     .6650651    .7962032
        HCC10 |    .778348   .0391602    -4.98   0.000     .7052584    .8590123
        HCC11 |   .9372945   .0342473    -1.77   0.076      .872518     1.00688
        HCC12 |   1.091608   .0311187     3.07   0.002     1.032289    1.154336
        HCC17 |    5.30168    .474104    18.65   0.000      4.44933    6.317314
        HCC18 |   5.135388   .2738428    30.68   0.000     4.625762    5.701161
        HCC19 |   3.415921   .1437394    29.19   0.000     3.145502    3.709589
        HCC21 |   .6938068   .0373412    -6.79   0.000     .6243472    .7709938
        HCC22 |   1.121864   .0337806     3.82   0.000     1.057571    1.190065
        HCC23 |   1.025859   .0363357     0.72   0.471     .9570578    1.099605
        HCC27 |   .7188897   .0509398    -4.66   0.000     .6256724    .8259953
        HCC28 |   .8439161   .0607295    -2.36   0.018     .7329013    .9717467
        HCC29 |   1.068035   .1080484     0.65   0.515     .8759374     1.30226
        HCC33 |   .8966566   .0444297    -2.20   0.028     .8136708     .988106
        HCC34 |   .9509075   .1186649    -0.40   0.687     .7445875    1.214397
        HCC35 |   .9077093   .0505463    -1.74   0.082     .8138553    1.012387
        HCC39 |   .8491728    .041864    -3.32   0.001     .7709604    .9353196
        HCC40 |   .8896549   .0292028    -3.56   0.000     .8342207    .9487727
        HCC46 |   .7682436   .0661709    -3.06   0.002     .6489073    .9095263
        HCC47 |   .7493991   .0368261    -5.87   0.000     .6805882    .8251673
        HCC48 |   .9742676   .0345242    -0.74   0.462     .9088978    1.044339
        HCC54 |   .8471422   .1324592    -1.06   0.289     .6235373    1.150934
        HCC55 |   .9454829   .1011509    -0.52   0.600     .7666362    1.166052
        HCC57 |   .6306845   .0427679    -6.80   0.000     .5521925    .7203338
        HCC58 |   .8366442   .0269474    -5.54   0.000     .7854608    .8911628
        HCC70 |   .7192185     .09978    -2.38   0.018      .547987    .9439552
        HCC71 |   .6403555   .0790807    -3.61   0.000      .502692    .8157185
        HCC72 |   .9594274   .0670767    -0.59   0.554     .8365692    1.100329
        HCC73 |   .7694138   .2562877    -0.79   0.431     .4005246    1.478056
        HCC74 |   .7947189   .1362368    -1.34   0.180      .567929    1.112072
        HCC75 |   .9978885   .0533183    -0.04   0.968     .8986724    1.108058
        HCC76 |   .7710302   .1812631    -1.11   0.269     .4863631    1.222312
        HCC77 |   .7345093   .0716561    -3.16   0.002     .6066765    .8892778
        HCC78 |   .6732237   .0392888    -6.78   0.000     .6004598    .7548051
        HCC79 |   .7268259    .026279    -8.82   0.000     .6771025    .7802007
        HCC80 |   .8111005   .0972774    -1.75   0.081     .6411917    1.026033
        HCC82 |   .7471678   .0753546    -2.89   0.004     .6131566    .9104684
        HCC83 |   .7093438   .1665211    -1.46   0.144     .4477485    1.123775
        HCC84 |   .7690202   .0297069    -6.80   0.000     .7129454    .8295055
        HCC85 |   .8372565   .0195434    -7.61   0.000     .7998151    .8764507
        HCC86 |    .852678   .0396514    -3.43   0.001     .7783991    .9340451
        HCC87 |    .997733   .0390285    -0.06   0.954     .9240974    1.077236
        HCC88 |   1.002434   .0374707     0.07   0.948     .9316183    1.078632
        HCC96 |   .8738288   .0187215    -6.30   0.000     .8378951    .9113035
        HCC99 |   .9077437   .0808381    -1.09   0.277     .7623606    1.080851
       HCC100 |   .8518613   .0279549    -4.89   0.000     .7987957    .9084523
       HCC103 |   .7531354   .0422994    -5.05   0.000     .6746303    .8407759
       HCC104 |   .7256656   .1070767    -2.17   0.030     .5434208    .9690293
       HCC106 |   .6769529   .0471998    -5.60   0.000     .5904856     .776082
       HCC107 |   .8825187   .0334199    -3.30   0.001     .8193887    .9505126
       HCC108 |   .8898619   .0190137    -5.46   0.000     .8533652    .9279195
       HCC110 |   .6195682   .2325232    -1.28   0.202     .2969163    1.292838
       HCC111 |   .7610497   .0152146   -13.66   0.000     .7318064    .7914616
       HCC112 |   .9048525   .0472932    -1.91   0.056     .8167491     1.00246
       HCC114 |   .8521756   .0497931    -2.74   0.006     .7599638    .9555761
       HCC115 |   .9102966   .0932082    -0.92   0.359      .744776    1.112603
       HCC122 |   1.122656   .0728385     1.78   0.075     .9885993    1.274891
       HCC124 |   1.126501   .0938548     1.43   0.153      .956783    1.326324
       HCC134 |   .7664384   .0451034    -4.52   0.000      .682945    .8601394
       HCC135 |   .7638969   .0279292    -7.37   0.000      .711072    .8206461
       HCC136 |   .7562396   .0610894    -3.46   0.001      .645504    .8859717
       HCC137 |   .7571304   .0528834    -3.98   0.000     .6602625    .8682099
       HCC157 |   .6863213   .0927884    -2.78   0.005     .5265599    .8945552
       HCC158 |   .6097329   .0591679    -5.10   0.000     .5041268    .7374617
       HCC161 |   .7655863   .0296653    -6.89   0.000     .7095964     .825994
       HCC162 |   1.390398   .8043004     0.57   0.569     .4474522    4.320478
       HCC166 |   1.278608   .7432459     0.42   0.672     .4092037    3.995167
       HCC167 |   .8257587   .0731749    -2.16   0.031     .6941025    .9823872
       HCC169 |   .7385525   .0470844    -4.75   0.000     .6518014    .8368496
       HCC170 |   .7073689   .0513133    -4.77   0.000     .6136191    .8154419
       HCC173 |   1.073073   .1068511     0.71   0.479     .8828173     1.30433
       HCC176 |   .8398656    .030516    -4.80   0.000     .7821354    .9018569
       HCC186 |   .9056296   .0749121    -1.20   0.231     .7700887    1.065027
       HCC188 |   .7503486   .0516866    -4.17   0.000     .6555856    .8588093
       HCC189 |   .7933636   .0832893    -2.20   0.027     .6458192    .9746161
              |
 providertype |
           1  |    1.17935   .0927332     2.10   0.036     1.010909    1.375857
           2  |   1.234709   .0777672     3.35   0.001      1.09132    1.396937
              |
       n_pcps |   1.000145   .0001789     0.81   0.419     .9997939    1.000495
       n_spec |   .9999227   .0000934    -0.83   0.408     .9997397    1.000106
lives_covered |   1.000002   1.16e-06     1.65   0.099     .9999996    1.000004
        _cons |   3.176369   .1820305    20.17   0.000     2.838903    3.553951
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    322,604
Model VCE    : Robust

Expression   : Pr(hba1ctest_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .8965619   .0024806   361.42   0.000        .8917    .9014239
          1  |   .8686298   .0085985   101.02   0.000      .851777    .8854825
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -102822.59  
Iteration 1:   log pseudolikelihood = -96392.508  
Iteration 2:   log pseudolikelihood =  -95076.24  
Iteration 3:   log pseudolikelihood = -95070.346  
Iteration 4:   log pseudolikelihood = -95070.346  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(96)     =    9963.16
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -95070.346               Pseudo R2         =     0.0754

                               (Std. Err. adjusted for 298 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
   hba1ctest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   1.000018   .0285501     0.00   0.999     .9455977    1.057571
           2015  |   1.166237   .0572461     3.13   0.002     1.059265    1.284011
           2016  |   1.194839   .0382675     5.56   0.000     1.122142    1.272246
                 |
     aco_exit_gr |
           2014  |   .7569887   .0776538    -2.71   0.007     .6191145    .9255669
                 |
year#aco_exit_gr |
      2014 2014  |   1.124276   .0815767     1.61   0.106     .9752378    1.296092
      2015 2014  |    .849221   .0735393    -1.89   0.059     .7166546    1.006309
      2016 2014  |   .8982539   .0725373    -1.33   0.184     .7667635    1.052293
                 |
          agegrp |
              1  |    1.00061   .0152983     0.04   0.968     .9710709    1.031048
              2  |   .9394418   .0276624    -2.12   0.034     .8867594    .9952541
                 |
        1.female |   1.175381   .0209307     9.07   0.000     1.135066    1.217129
                 |
         race_g3 |
              1  |   .7175743   .0411901    -5.78   0.000     .6412189    .8030221
              2  |    .968157   .0644483    -0.49   0.627      .849734    1.103084
                 |
            HCC1 |   1.115367   .1549961     0.79   0.432     .8494372    1.464551
            HCC2 |   .8876935   .0380213    -2.78   0.005     .8162153    .9654312
            HCC6 |   .8213947   .0778463    -2.08   0.038     .6821513    .9890609
            HCC8 |   .3680249    .021083   -17.45   0.000     .3289384     .411756
            HCC9 |   .7304593   .0345923    -6.63   0.000      .665711    .8015051
           HCC10 |   .7938254   .0428594    -4.28   0.000     .7141144    .8824339
           HCC11 |   .9548573   .0343343    -1.28   0.199     .8898799    1.024579
           HCC12 |    1.07982   .0318307     2.61   0.009     1.019201    1.144044
           HCC17 |   5.266374    .484261    18.07   0.000     4.397854    6.306415
           HCC18 |    5.25785   .2857732    30.54   0.000     4.726546    5.848876
           HCC19 |   3.471016    .149991    28.80   0.000     3.189144    3.777801
           HCC21 |   .6712473   .0378042    -7.08   0.000     .6010955    .7495862
           HCC22 |   1.102836   .0343085     3.15   0.002     1.037601    1.172172
           HCC23 |   1.021109   .0360661     0.59   0.554     .9528116    1.094301
           HCC27 |    .700734   .0502729    -4.96   0.000     .6088149     .806531
           HCC28 |   .8197173   .0594725    -2.74   0.006     .7110618    .9449762
           HCC29 |   1.055928   .1094981     0.52   0.600       .86172    1.293906
           HCC33 |   .8760262   .0450084    -2.58   0.010     .7921075    .9688356
           HCC34 |   1.062774   .1365256     0.47   0.636      .826217     1.36706
           HCC35 |   .9579776   .0565493    -0.73   0.467     .8533143    1.075478
           HCC39 |   .8162001   .0421852    -3.93   0.000     .7375685    .9032145
           HCC40 |   .8990838   .0306749    -3.12   0.002     .8409283    .9612612
           HCC46 |   .7549589   .0657211    -3.23   0.001     .6365377    .8954113
           HCC47 |   .7677738   .0385067    -5.27   0.000     .6958928    .8470796
           HCC48 |   .9840974   .0371852    -0.42   0.671     .9138491    1.059746
           HCC54 |   .7360629   .1127285    -2.00   0.045     .5451962    .9937498
           HCC55 |   .9422186   .0996378    -0.56   0.574     .7658412    1.159217
           HCC57 |   .6435465   .0460667    -6.16   0.000      .559305    .7404762
           HCC58 |   .8371905   .0269404    -5.52   0.000      .786019    .8916934
           HCC70 |   .8010617   .1091852    -1.63   0.104      .613263     1.04637
           HCC71 |   .7920441   .1096413    -1.68   0.092      .603836    1.038914
           HCC72 |   .9932002   .0691206    -0.10   0.922     .8665596    1.138348
           HCC73 |   .8107195   .2976385    -0.57   0.568     .3947935    1.664835
           HCC74 |   .7204509   .1233349    -1.92   0.055     .5150935     1.00768
           HCC75 |   .9696757   .0533994    -0.56   0.576     .8704651    1.080194
           HCC76 |   .8872381   .2145377    -0.49   0.621     .5523524    1.425161
           HCC77 |   .7141878   .0696749    -3.45   0.001     .5898895    .8646775
           HCC78 |   .6653974   .0374693    -7.23   0.000     .5958665    .7430418
           HCC79 |   .7055427   .0273643    -8.99   0.000     .6538975    .7612668
           HCC80 |   .7453598    .090166    -2.43   0.015     .5880257    .9447907
           HCC82 |   .8079509   .0864601    -1.99   0.046     .6550833     .996491
           HCC83 |   .6898847   .1562263    -1.64   0.101     .4426083    1.075309
           HCC84 |   .7660023   .0296602    -6.88   0.000     .7100205    .8263979
           HCC85 |    .834168   .0203913    -7.42   0.000     .7951441    .8751071
           HCC86 |    .858238   .0412547    -3.18   0.001     .7810724    .9430271
           HCC87 |   .9780063   .0380683    -0.57   0.568     .9061689    1.055539
           HCC88 |   .9849971   .0375434    -0.40   0.692     .9140947    1.061399
           HCC96 |   .8784197   .0195258    -5.83   0.000     .8409716    .9175354
           HCC99 |   .8602207   .0781494    -1.66   0.097     .7199128    1.027874
          HCC100 |   .8525271   .0295576    -4.60   0.000     .7965197    .9124727
          HCC103 |   .7533273   .0443547    -4.81   0.000     .6712223    .8454757
          HCC104 |   .7492401   .1143523    -1.89   0.059     .5555292    1.010497
          HCC106 |   .6943032    .051313    -4.94   0.000     .6006761    .8025237
          HCC107 |   .8677687   .0317595    -3.88   0.000     .8077013    .9323032
          HCC108 |   .8875217   .0193053    -5.49   0.000     .8504792    .9261776
          HCC110 |   .6578741   .2726291    -1.01   0.312     .2920096    1.482138
          HCC111 |   .7612113   .0159706   -13.00   0.000     .7305443    .7931656
          HCC112 |   .9041503   .0486072    -1.87   0.061     .8137294    1.004619
          HCC114 |   .8465872   .0511177    -2.76   0.006     .7520997    .9529454
          HCC115 |   .9339152   .0961987    -0.66   0.507      .763183    1.142842
          HCC122 |   1.126324   .0743297     1.80   0.071     .9896691    1.281849
          HCC124 |   1.071945   .0950236     0.78   0.433     .9009838    1.275346
          HCC134 |   .7616966   .0455191    -4.55   0.000     .6775074    .8563474
          HCC135 |   .7477597   .0281032    -7.73   0.000     .6946581    .8049204
          HCC136 |   .7269731    .060927    -3.80   0.000     .6168504    .8567554
          HCC137 |    .748642   .0529197    -4.10   0.000     .6517857    .8598913
          HCC157 |   .6807904    .094114    -2.78   0.005      .519208    .8926587
          HCC158 |   .6338887   .0623684    -4.63   0.000     .5227129    .7687106
          HCC161 |   .7856023   .0320309    -5.92   0.000     .7252658    .8509583
          HCC162 |   1.236892   .6119757     0.43   0.667     .4690116    3.261969
          HCC166 |   1.060988   .5622104     0.11   0.911      .375547    2.997481
          HCC167 |   .8587148   .0812661    -1.61   0.108     .7133356    1.033723
          HCC169 |   .7565496   .0500741    -4.22   0.000     .6645055    .8613433
          HCC170 |   .7284984   .0536287    -4.30   0.000      .630619    .8415699
          HCC173 |    1.00043   .0947717     0.00   0.996      .830905    1.204541
          HCC176 |   .8411469   .0314095    -4.63   0.000     .7817842    .9050172
          HCC186 |    .922488   .0776637    -0.96   0.338     .7821653    1.087985
          HCC188 |   .7829981   .0566537    -3.38   0.001     .6794729    .9022965
          HCC189 |   .8164728   .0898039    -1.84   0.065     .6581396    1.012897
                 |
    providertype |
              1  |   1.201433   .0945046     2.33   0.020     1.029779    1.401699
              2  |   1.254005   .0831849     3.41   0.001      1.10112    1.428118
                 |
          n_pcps |   1.000144   .0001886     0.76   0.445     .9997746    1.000514
          n_spec |   .9999208   .0000943    -0.84   0.401     .9997359    1.000106
   lives_covered |   1.000002   1.23e-06     1.73   0.084     .9999997    1.000005
           _cons |   3.147604   .1882372    19.17   0.000     2.799467    3.539034
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(hba1ctest_ind), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |    .887522   .0030455   291.42   0.000     .8815529    .8934911
           2014  |   .8883042    .002962   299.90   0.000     .8824989    .8941096
           2015  |   .9000689   .0037193   242.00   0.000     .8927793    .9073586
           2016  |   .9024779    .003065   294.44   0.000     .8964706    .9084853
                 |
     aco_exit_gr |
              0  |   .8970432   .0026036   344.54   0.000     .8919402    .9021462
           2014  |   .8657879   .0088638    97.68   0.000     .8484152    .8831607
                 |
year#aco_exit_gr |
      2013    0  |   .8892803   .0031076   286.17   0.000     .8831896     .895371
      2013 2014  |   .8610036   .0111144    77.47   0.000     .8392199    .8827874
      2014    0  |    .889282   .0030237   294.10   0.000     .8833557    .8952083
      2014 2014  |   .8735449   .0105379    82.90   0.000     .8528909    .8941988
      2015    0  |   .9027282   .0038893   232.11   0.000     .8951054     .910351
      2015 2014  |   .8599273   .0090925    94.58   0.000     .8421063    .8777482
      2016    0  |   .9047149   .0031867   283.91   0.000     .8984691    .9109606
      2016 2014  |    .868687   .0096463    90.05   0.000     .8497806    .8875933
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -107699.84  
Iteration 1:   log pseudolikelihood = -101155.25  
Iteration 2:   log pseudolikelihood = -99815.468  
Iteration 3:   log pseudolikelihood = -99809.582  
Iteration 4:   log pseudolikelihood = -99809.582  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(96)     =    9467.24
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -99809.582               Pseudo R2         =     0.0733

                               (Std. Err. adjusted for 313 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
   hba1ctest_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   1.001297   .0284368     0.05   0.964     .9470849    1.058613
           2015  |   1.158539   .0561981     3.03   0.002     1.053466    1.274091
           2016  |   1.194673   .0378323     5.62   0.000     1.122778    1.271173
                 |
     aco_exit_gr |
           2015  |   .9519785   .0726563    -0.64   0.519     .8197139    1.105585
                 |
year#aco_exit_gr |
      2014 2015  |   1.033091   .0724196     0.46   0.642     .9004704    1.185244
      2015 2015  |   .9944493    .066949    -0.08   0.934     .8715203    1.134718
      2016 2015  |   .7845747   .0774789    -2.46   0.014     .6465109    .9521224
                 |
          agegrp |
              1  |   .9944843   .0147881    -0.37   0.710     .9659185    1.023895
              2  |   .9366829   .0258951    -2.37   0.018       .88728    .9888365
                 |
        1.female |   1.184038   .0201974     9.90   0.000     1.145106    1.224293
                 |
         race_g3 |
              1  |   .7358821   .0413025    -5.46   0.000     .6592244    .8214539
              2  |   1.002867   .0643289     0.04   0.964     .8843879    1.137218
                 |
            HCC1 |   1.062017   .1521461     0.42   0.674      .802023    1.406293
            HCC2 |   .8952799   .0366585    -2.70   0.007     .8262381    .9700911
            HCC6 |   .8389293   .0757045    -1.95   0.052     .7029321    1.001238
            HCC8 |   .3728934   .0205184   -17.93   0.000     .3347708    .4153574
            HCC9 |   .7275067    .033381    -6.93   0.000     .6649368    .7959643
           HCC10 |    .778289   .0391693    -4.98   0.000     .7051834    .8589733
           HCC11 |   .9372786   .0342497    -1.77   0.076     .8724979    1.006869
           HCC12 |   1.091415   .0311093     3.07   0.002     1.032113    1.154123
           HCC17 |   5.299064   .4737835    18.65   0.000     4.447277    6.313994
           HCC18 |   5.136736   .2741065    30.67   0.000     4.626637    5.703074
           HCC19 |   3.416382   .1437285    29.20   0.000     3.145981    3.710025
           HCC21 |   .6937685   .0373398    -6.79   0.000     .6243117    .7709525
           HCC22 |   1.121932   .0337769     3.82   0.000     1.057646    1.190126
           HCC23 |   1.025647   .0362176     0.72   0.473     .9570628    1.099146
           HCC27 |    .718959   .0508775    -4.66   0.000     .6258474    .8259235
           HCC28 |   .8437746    .060699    -2.36   0.018     .7328131    .9715378
           HCC29 |   1.067638   .1078474     0.65   0.517     .8758705    1.301392
           HCC33 |   .8963081   .0444615    -2.21   0.027     .8132673    .9878279
           HCC34 |   .9506395   .1187147    -0.41   0.685     .7442501    1.214263
           HCC35 |   .9073366   .0505173    -1.75   0.081     .8135356    1.011953
           HCC39 |   .8489161    .041899    -3.32   0.001     .7706425      .93514
           HCC40 |   .8896436   .0292136    -3.56   0.000     .8341896     .948784
           HCC46 |   .7674103   .0660042    -3.08   0.002     .6483606    .9083195
           HCC47 |   .7493449   .0368133    -5.87   0.000     .6805569    .8250857
           HCC48 |   .9742307   .0345319    -0.74   0.461     .9088469    1.044318
           HCC54 |   .8469574   .1323666    -1.06   0.288     .6234931    1.150513
           HCC55 |   .9449568   .1009087    -0.53   0.596     .7665051    1.164954
           HCC57 |   .6314604   .0428314    -6.78   0.000     .5528532    .7212443
           HCC58 |   .8368985   .0269369    -5.53   0.000      .785734    .8913948
           HCC70 |   .7186181   .0997526    -2.38   0.017     .5474462    .9433109
           HCC71 |   .6408899   .0790615    -3.61   0.000     .5032428    .8161864
           HCC72 |   .9593217   .0670387    -0.59   0.552     .8365293    1.100139
           HCC73 |   .7695658   .2565455    -0.79   0.432     .4003925    1.479128
           HCC74 |   .7946508   .1365235    -1.34   0.181     .5674626    1.112796
           HCC75 |   .9982761   .0532941    -0.03   0.974     .8991006    1.108391
           HCC76 |   .7720355   .1813354    -1.10   0.271     .4872001    1.223396
           HCC77 |   .7347507   .0717383    -3.16   0.002     .6067809    .8897093
           HCC78 |   .6730533   .0392309    -6.79   0.000     .6003916    .7545088
           HCC79 |   .7267708   .0262895    -8.82   0.000     .6770284    .7801678
           HCC80 |   .8114027   .0971702    -1.75   0.081     .6416529     1.02606
           HCC82 |   .7473236   .0753803    -2.89   0.004     .6132683    .9106823
           HCC83 |   .7095218   .1670702    -1.46   0.145     .4472335    1.125634
           HCC84 |   .7692103    .029757    -6.78   0.000      .713044    .8298009
           HCC85 |   .8372003   .0195468    -7.61   0.000     .7997527    .8764014
           HCC86 |   .8525462   .0396167    -3.43   0.001     .7783299    .9338392
           HCC87 |   .9979859   .0390925    -0.05   0.959     .9242334    1.077624
           HCC88 |   1.002231   .0374777     0.06   0.952     .9314033    1.078445
           HCC96 |   .8737266   .0187459    -6.29   0.000     .8377471    .9112514
           HCC99 |   .9077552   .0808942    -1.09   0.277     .7622795    1.080994
          HCC100 |   .8520244   .0279349    -4.88   0.000     .7989951    .9085733
          HCC103 |   .7535079   .0423337    -5.04   0.000     .6749406     .841221
          HCC104 |    .726291   .1069715    -2.17   0.030      .544179    .9693476
          HCC106 |   .6772002   .0472005    -5.59   0.000     .5907297    .7763282
          HCC107 |   .8825317   .0334169    -3.30   0.001      .819407    .9505193
          HCC108 |   .8898527   .0190259    -5.46   0.000     .8533331    .9279351
          HCC110 |   .6209263   .2334497    -1.27   0.205      .297176    1.297377
          HCC111 |   .7610835   .0152105   -13.66   0.000     .7318478     .791487
          HCC112 |   .9051596   .0472888    -1.91   0.056     .8170626    1.002755
          HCC114 |   .8525611   .0499103    -2.72   0.006     .7601422    .9562164
          HCC115 |   .9111356   .0932854    -0.91   0.363     .7454764    1.113607
          HCC122 |    1.12279   .0728786     1.78   0.074      .988663    1.275113
          HCC124 |   1.126385   .0938311     1.43   0.153     .9567075    1.326155
          HCC134 |   .7665354   .0450686    -4.52   0.000     .6831021    .8601591
          HCC135 |   .7639784    .027959    -7.36   0.000     .7110989    .8207903
          HCC136 |   .7566318   .0610639    -3.46   0.001     .6459346    .8862999
          HCC137 |   .7573178   .0528784    -3.98   0.000     .6604569    .8683841
          HCC157 |   .6864144   .0927304    -2.79   0.005     .5267376    .8944962
          HCC158 |   .6101487   .0592429    -5.09   0.000     .5044145    .7380468
          HCC161 |   .7656309   .0296472    -6.90   0.000     .7096736    .8260003
          HCC162 |   1.395331   .8073657     0.58   0.565     .4489058    4.337096
          HCC166 |   1.280821   .7487054     0.42   0.672     .4073027     4.02772
          HCC167 |   .8256162     .07316    -2.16   0.031     .6939865    .9822123
          HCC169 |   .7384278   .0471459    -4.75   0.000     .6515714    .8368625
          HCC170 |   .7074761   .0512939    -4.77   0.000     .6137583    .8155042
          HCC173 |   1.072953   .1067597     0.71   0.479     .8828472    1.303995
          HCC176 |   .8398224   .0305265    -4.80   0.000     .7820731     .901836
          HCC186 |   .9050404   .0749134    -1.21   0.228     .7695042    1.064449
          HCC188 |   .7501939   .0516101    -4.18   0.000     .6555632    .8584845
          HCC189 |   .7937496   .0833756    -2.20   0.028     .6460604    .9752006
                 |
    providertype |
              1  |   1.179089    .092588     2.10   0.036     1.010894    1.375267
              2  |   1.240192   .0797425     3.35   0.001     1.093347     1.40676
                 |
          n_pcps |   1.000147   .0001784     0.82   0.411      .999797    1.000496
          n_spec |   .9999207   .0000934    -0.85   0.396     .9997377    1.000104
   lives_covered |   1.000002   1.17e-06     1.63   0.102     .9999996    1.000004
           _cons |   3.193574   .1869951    19.83   0.000     2.847319    3.581936
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    322,604
Model VCE    : Robust

Expression   : Pr(hba1ctest_ind), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |   .8887754   .0029229   304.07   0.000     .8830466    .8945043
           2014  |   .8892341    .002927   303.80   0.000     .8834973     .894971
           2015  |   .9016913   .0035806   251.83   0.000     .8946735    .9087092
           2016  |   .9018258   .0029451   306.21   0.000     .8960535    .9075981
                 |
     aco_exit_gr |
              0  |   .8968785   .0025778   347.93   0.000     .8918261    .9019308
           2015  |    .887347   .0060267   147.24   0.000     .8755349     .899159
                 |
year#aco_exit_gr |
      2013    0  |   .8892846   .0031098   285.96   0.000     .8831895    .8953798
      2013 2015  |   .8846567   .0068164   129.78   0.000     .8712967    .8980167
      2014    0  |   .8894044   .0030287   293.66   0.000     .8834683    .8953405
      2014 2015  |    .887857   .0082458   107.67   0.000     .8716955    .9040186
      2015    0  |   .9022028   .0037804   238.65   0.000     .8947933    .9096123
      2015 2015  |    .897552   .0067757   132.47   0.000     .8842719    .9108322
      2016    0  |   .9047306   .0031877   283.82   0.000     .8984828    .9109785
      2016 2015  |    .878325   .0073804   119.01   0.000     .8638596    .8927904
----------------------------------------------------------------------------------
***********************************************************
                    Oct 2019 New Models                    
             All Years of Data ldlcscreen_ind              
22:18:10 28 Sep 2021
***********************************************************

Iteration 0:   log pseudolikelihood = -125994.25  
Iteration 1:   log pseudolikelihood = -121648.07  
Iteration 2:   log pseudolikelihood = -120990.79  
Iteration 3:   log pseudolikelihood = -120988.75  
Iteration 4:   log pseudolikelihood = -120988.75  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(93)     =   11677.58
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -120988.75               Pseudo R2         =     0.0397

                                 (Std. Err. adjusted for 298 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
    ldlcscreen_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   .9434749   .0247126    -2.22   0.026     .8962613    .9931756
             2015  |   1.000564   .0579453     0.01   0.992     .8932017    1.120831
             2016  |   .8394965   .0314212    -4.67   0.000     .7801167    .9033961
                   |
1.aco_death_active |   .6931674    .077819    -3.26   0.001     .5562594    .8637716
                   |
            agegrp |
                1  |   1.073772   .0147512     5.18   0.000     1.045246    1.103077
                2  |     1.0245    .021863     1.13   0.257     .9825332     1.06826
                   |
          1.female |   1.135738   .0176912     8.17   0.000     1.101588    1.170947
                   |
           race_g3 |
                1  |   .6943742   .0390681    -6.48   0.000     .6218732    .7753278
                2  |    1.08969   .0837268     1.12   0.264     .9373478    1.266793
                   |
              HCC1 |   1.387604   .1811481     2.51   0.012     1.074344    1.792205
              HCC2 |   .8001265   .0256147    -6.97   0.000     .7514651    .8519389
              HCC6 |   .9669944   .0817793    -0.40   0.691     .8192893    1.141328
              HCC8 |   .3555019   .0166819   -22.04   0.000     .3242644    .3897487
              HCC9 |   .6928565    .029558    -8.60   0.000     .6372798    .7532801
             HCC10 |   .8515858   .0355877    -3.84   0.000     .7846153    .9242726
             HCC11 |    .946517   .0356492    -1.46   0.144     .8791625    1.019032
             HCC12 |    1.19336   .0256336     8.23   0.000     1.144162    1.244674
             HCC17 |   1.504718   .0948869     6.48   0.000     1.329777    1.702674
             HCC18 |   1.576287   .0509138    14.09   0.000     1.479591    1.679302
             HCC19 |    1.46237   .0387236    14.35   0.000      1.38841    1.540271
             HCC21 |   .7297492   .0371092    -6.20   0.000     .6605236      .80623
             HCC22 |   1.023786   .0247706     0.97   0.331     .9763697    1.073505
             HCC23 |   1.015383   .0316454     0.49   0.624     .9552151     1.07934
             HCC27 |   .4909163   .0313657   -11.14   0.000      .433134     .556407
             HCC28 |   .7316973    .044182    -5.17   0.000     .6500301    .8236249
             HCC29 |   .9827985   .0741125    -0.23   0.818     .8477654     1.13934
             HCC33 |   .9659171   .0450833    -0.74   0.458     .8814767    1.058446
             HCC34 |   .8387972   .0955413    -1.54   0.123     .6709695    1.048603
             HCC35 |   1.020538   .0663442     0.31   0.754     .8984488    1.159218
             HCC39 |   .8867013   .0388651    -2.74   0.006     .8137073    .9662432
             HCC40 |   .9706749   .0313217    -0.92   0.356     .9111864    1.034047
             HCC46 |   .7910996    .056552    -3.28   0.001     .6876743    .9100799
             HCC47 |   .7996019    .032494    -5.50   0.000     .7383851    .8658939
             HCC48 |   1.069744   .0328258     2.20   0.028     1.007304    1.136056
             HCC54 |   .9063769   .1195879    -0.75   0.456     .6998432    1.173862
             HCC55 |   .9379341   .0913339    -0.66   0.511     .7749687    1.135169
             HCC57 |     .57451    .044595    -7.14   0.000     .4934294    .6689137
             HCC58 |   .8105843   .0233254    -7.30   0.000     .7661327     .857615
             HCC70 |   .7395657   .1017446    -2.19   0.028     .5647732    .9684549
             HCC71 |   .7274276   .0886944    -2.61   0.009      .572801    .9237953
             HCC72 |   .8427583   .0539589    -2.67   0.008     .7433674    .9554381
             HCC73 |   .7498469   .2407767    -0.90   0.370     .3996233    1.407001
             HCC74 |   .8657897   .1552973    -0.80   0.422     .6091605    1.230532
             HCC75 |   .9071287   .0400029    -2.21   0.027     .8320172    .9890209
             HCC76 |    .889726   .2243096    -0.46   0.643     .5428242    1.458322
             HCC77 |   .6927231   .0663035    -3.84   0.000     .5742322    .8356643
             HCC78 |   .7030655   .0366907    -6.75   0.000     .6347085    .7787843
             HCC79 |   .7771208   .0307628    -6.37   0.000     .7191065    .8398154
             HCC80 |   .9554395   .1065504    -0.41   0.683     .7678517    1.188855
             HCC82 |   .7363734   .0583144    -3.86   0.000     .6305075    .8600147
             HCC83 |   .9610005   .2477831    -0.15   0.877     .5797635    1.592929
             HCC84 |   .7406081   .0233079    -9.54   0.000     .6963057    .7877291
             HCC85 |   .8313774   .0188178    -8.16   0.000     .7953013    .8690901
             HCC86 |   1.061307   .0462583     1.37   0.172      .974407    1.155957
             HCC87 |   1.206852   .0429043     5.29   0.000     1.125624    1.293942
             HCC88 |   1.273008   .0533062     5.76   0.000     1.172702    1.381893
             HCC96 |   .9626023   .0160703    -2.28   0.022     .9316149    .9946203
             HCC99 |   .8366459   .0697515    -2.14   0.032     .7105207    .9851598
            HCC100 |   .9307548    .027537    -2.43   0.015     .8783182    .9863219
            HCC103 |    .739561   .0335398    -6.65   0.000      .676661    .8083079
            HCC104 |   .7065344   .0929778    -2.64   0.008     .5459058    .9144266
            HCC106 |   .7110676   .0411209    -5.90   0.000     .6348719    .7964082
            HCC107 |   .9860031   .0361235    -0.38   0.700     .9176844    1.059408
            HCC108 |    1.07369   .0207791     3.67   0.000     1.033727    1.115198
            HCC110 |   .5066825   .1281592    -2.69   0.007     .3086277    .8318346
            HCC111 |   .8130799   .0163593   -10.28   0.000     .7816402    .8457841
            HCC112 |   .9670176   .0454657    -0.71   0.476     .8818891    1.060364
            HCC114 |   .8404197   .0487556    -3.00   0.003     .7500931    .9416235
            HCC115 |   .9000907   .0884841    -1.07   0.284     .7423492    1.091351
            HCC122 |   .9674519   .0427923    -0.75   0.454     .8871133    1.055066
            HCC124 |   1.088335   .0878362     1.05   0.294     .9291046    1.274854
            HCC134 |   .3415067   .0212094   -17.30   0.000     .3023675    .3857123
            HCC135 |   .7127531   .0196783   -12.26   0.000     .6752093    .7523843
            HCC136 |   .6097947   .0390439    -7.73   0.000      .537877    .6913281
            HCC137 |   .7166153   .0388333    -6.15   0.000     .6444059    .7969161
            HCC157 |   .6802445   .0965622    -2.71   0.007      .515033    .8984522
            HCC158 |   .6413597   .0639813    -4.45   0.000     .5274566    .7798599
            HCC161 |   .7546584   .0244815    -8.68   0.000     .7081692    .8041994
            HCC162 |   .5364879   .1880014    -1.78   0.076     .2699438    1.066219
            HCC166 |   .9777314   .4038967    -0.05   0.957     .4351028    2.197087
            HCC167 |   .9822451   .0749681    -0.23   0.814     .8457724    1.140739
            HCC169 |   .7528201   .0457929    -4.67   0.000     .6682114    .8481418
            HCC170 |    .747882   .0439949    -4.94   0.000     .6664389    .8392779
            HCC173 |   .9585262   .0709191    -0.57   0.567     .8291357    1.108109
            HCC176 |   .9433684    .033669    -1.63   0.102     .8796336    1.011721
            HCC186 |   1.198695   .1044806     2.08   0.038     1.010453    1.422005
            HCC188 |   .6856687   .0404101    -6.40   0.000     .6108695    .7696268
            HCC189 |   .6645593   .0572866    -4.74   0.000     .5612524    .7868815
                   |
      providertype |
                1  |   1.160946   .1075658     1.61   0.107     .9681551    1.392127
                2  |   1.398703   .1285164     3.65   0.000     1.168194    1.674696
                   |
            n_pcps |   1.000023   .0002159     0.11   0.915     .9995999    1.000446
            n_spec |   .9998342   .0000931    -1.78   0.075     .9996517    1.000017
     lives_covered |   1.000004   1.53e-06     2.95   0.003     1.000002    1.000007
             _cons |   4.602916   .3465226    20.28   0.000     3.971475    5.334753
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -125994.25  
Iteration 1:   log pseudolikelihood = -121645.95  
Iteration 2:   log pseudolikelihood = -120988.58  
Iteration 3:   log pseudolikelihood = -120986.55  
Iteration 4:   log pseudolikelihood = -120986.55  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(94)     =   11805.53
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -120986.55               Pseudo R2         =     0.0397

                             (Std. Err. adjusted for 298 clusters in cluster_id)
--------------------------------------------------------------------------------
               |               Robust
ldlcscreen_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
          year |
         2014  |    .943042   .0245744    -2.25   0.024     .8960863    .9924582
         2015  |     1.0091   .0617349     0.15   0.882     .8950745    1.137651
         2016  |   .8361708   .0308456    -4.85   0.000     .7778483    .8988664
               |
    death_year |
            1  |   .6521947   .0833419    -3.34   0.001     .5076974    .8378179
            2  |   .7370842   .0782143    -2.87   0.004     .5986782    .9074878
               |
        agegrp |
            1  |   1.073471   .0147381     5.16   0.000     1.044971     1.10275
            2  |    1.02434    .021839     1.13   0.259     .9824181     1.06805
               |
      1.female |   1.135745   .0176907     8.17   0.000     1.101596    1.170953
               |
       race_g3 |
            1  |   .6944359   .0390252    -6.49   0.000     .6220097    .7752954
            2  |   1.090037   .0837008     1.12   0.262     .9377349    1.267076
               |
          HCC1 |   1.387809   .1811559     2.51   0.012     1.074532    1.792422
          HCC2 |   .7999976   .0256352    -6.96   0.000     .7512988     .851853
          HCC6 |   .9668374   .0817361    -0.40   0.690     .8192061    1.141074
          HCC8 |    .355497   .0166808   -22.04   0.000     .3242616    .3897412
          HCC9 |    .692848   .0295657    -8.60   0.000     .6372574     .753288
         HCC10 |   .8515438   .0355911    -3.84   0.000     .7845673    .9242379
         HCC11 |   .9466376   .0356607    -1.46   0.145     .8792617    1.019176
         HCC12 |    1.19338   .0256372     8.23   0.000     1.144176    1.244701
         HCC17 |   1.504947   .0948435     6.49   0.000     1.330079    1.702805
         HCC18 |   1.576386   .0508838    14.10   0.000     1.479745    1.679339
         HCC19 |   1.462392   .0387053    14.36   0.000     1.388465    1.540255
         HCC21 |   .7297477   .0371073    -6.20   0.000     .6605255    .8062243
         HCC22 |   1.023808   .0247895     0.97   0.331     .9763562    1.073566
         HCC23 |   1.015476   .0316606     0.49   0.622     .9552801    1.079465
         HCC27 |   .4908129   .0313731   -11.13   0.000     .4330186     .556321
         HCC28 |   .7317623   .0441849    -5.17   0.000     .6500897    .8236957
         HCC29 |   .9831894   .0741292    -0.22   0.822     .8481242    1.139764
         HCC33 |   .9659114    .045065    -0.74   0.457     .8815037    1.058401
         HCC34 |   .8392463   .0956131    -1.54   0.124     .6712964    1.049215
         HCC35 |   1.020414   .0663036     0.31   0.756      .898396    1.159005
         HCC39 |   .8869479   .0388827    -2.74   0.006     .8139214    .9665265
         HCC40 |   .9705998   .0313179    -0.92   0.355     .9111185    1.033964
         HCC46 |   .7909072   .0565419    -3.28   0.001     .6875009    .9098669
         HCC47 |   .7996252   .0325003    -5.50   0.000     .7383969    .8659306
         HCC48 |   1.069754   .0328083     2.20   0.028     1.007345    1.136029
         HCC54 |   .9070371   .1197081    -0.74   0.460     .7003029    1.174801
         HCC55 |   .9349849   .0909734    -0.69   0.490     .7726509    1.131425
         HCC57 |   .5747222   .0445856    -7.14   0.000     .4936553    .6691018
         HCC58 |   .8105622   .0233203    -7.30   0.000     .7661201    .8575823
         HCC70 |   .7390806   .1016321    -2.20   0.028     .5644712    .9677023
         HCC71 |    .726999   .0885991    -2.62   0.009       .57253    .9231439
         HCC72 |   .8422737   .0539113    -2.68   0.007     .7429686    .9548518
         HCC73 |   .7501627   .2408671    -0.90   0.371     .3998031    1.407553
         HCC74 |   .8653783   .1551188    -0.81   0.420     .6090156    1.229656
         HCC75 |   .9074835   .0400385    -2.20   0.028     .8323068    .9894504
         HCC76 |   .8890947   .2242062    -0.47   0.641     .5423723    1.457467
         HCC77 |   .6923417   .0663057    -3.84   0.000     .5738531    .8352957
         HCC78 |   .7031159   .0366892    -6.75   0.000     .6347614    .7788312
         HCC79 |    .777061   .0307667    -6.37   0.000     .7190397    .8397641
         HCC80 |   .9554251   .1066109    -0.41   0.683     .7677424    1.188989
         HCC82 |   .7369579   .0583693    -3.85   0.000     .6309936    .8607171
         HCC83 |    .959273    .247574    -0.16   0.872      .578442    1.590833
         HCC84 |   .7404547    .023311    -9.54   0.000      .696147    .7875825
         HCC85 |   .8314292   .0188197    -8.16   0.000     .7953495    .8691456
         HCC86 |   1.061336   .0462784     1.37   0.172     .9743997    1.156029
         HCC87 |   1.207192   .0429161     5.30   0.000     1.125941    1.294305
         HCC88 |   1.273149   .0532987     5.77   0.000     1.172856    1.382018
         HCC96 |   .9626039   .0160755    -2.28   0.022     .9316067    .9946326
         HCC99 |   .8370237   .0697649    -2.13   0.033     .7108716    .9855629
        HCC100 |   .9308998   .0275341    -2.42   0.015     .8784684    .9864606
        HCC103 |   .7394736   .0335131    -6.66   0.000     .6766219    .8081636
        HCC104 |   .7070299   .0929857    -2.64   0.008     .5463755    .9149226
        HCC106 |    .711146   .0411221    -5.89   0.000     .6349476    .7964887
        HCC107 |   .9860012   .0361225    -0.38   0.700     .9176844    1.059404
        HCC108 |   1.073707   .0207736     3.68   0.000     1.033754    1.115204
        HCC110 |   .5073683   .1282636    -2.68   0.007     .3091278    .8327382
        HCC111 |    .813094   .0163632   -10.28   0.000      .781647    .8458062
        HCC112 |   .9670796   .0454605    -0.71   0.476     .8819601    1.060414
        HCC114 |    .840281   .0487522    -3.00   0.003     .7499612    .9414784
        HCC115 |   .9006662   .0885153    -1.06   0.287     .7428649    1.091988
        HCC122 |   .9673501   .0428047    -0.75   0.453     .8869896    1.054991
        HCC124 |   1.088833    .087903     1.05   0.292     .9294854    1.275499
        HCC134 |   .3414892   .0212099   -17.30   0.000     .3023492     .385696
        HCC135 |   .7128047   .0196722   -12.27   0.000     .6752723    .7524233
        HCC136 |   .6098018   .0390468    -7.72   0.000     .5378791    .6913417
        HCC137 |   .7167257   .0388396    -6.15   0.000     .6445046    .7970396
        HCC157 |   .6805857   .0964823    -2.71   0.007     .5154819    .8985707
        HCC158 |   .6410473   .0639552    -4.46   0.000     .5271916    .7794921
        HCC161 |   .7546577   .0244728    -8.68   0.000     .7081845    .8041806
        HCC162 |    .537446   .1884512    -1.77   0.077     .2703135    1.068567
        HCC166 |   .9777856   .4042052    -0.05   0.957     .4348774    2.198469
        HCC167 |   .9825393   .0750117    -0.23   0.818     .8459899    1.141129
        HCC169 |   .7528386   .0457879    -4.67   0.000     .6682386    .8481492
        HCC170 |    .747874   .0440088    -4.94   0.000     .6664066    .8393005
        HCC173 |   .9587013   .0709406    -0.57   0.569     .8292726    1.108331
        HCC176 |    .943555   .0336926    -1.63   0.104     .8797765    1.011957
        HCC186 |   1.198681    .104432     2.08   0.038      1.01052    1.421878
        HCC188 |   .6856753   .0403968    -6.40   0.000     .6108993     .769604
        HCC189 |   .6646389    .057317    -4.74   0.000     .5612807    .7870303
               |
  providertype |
            1  |   1.161201   .1074765     1.61   0.106     .9685531    1.392168
            2  |   1.398898   .1284129     3.66   0.000     1.168556    1.674645
               |
        n_pcps |   1.000014   .0002168     0.07   0.948     .9995895    1.000439
        n_spec |   .9998345   .0000931    -1.78   0.076      .999652    1.000017
 lives_covered |   1.000005   1.59e-06     2.91   0.004     1.000002    1.000008
         _cons |   4.594393   .3465231    20.22   0.000     3.963035    5.326333
--------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(ldlcscreen_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .8579234   .0043177   198.70   0.000     .8494608     .866386
          1  |   .8003602    .019092    41.92   0.000     .7629405    .8377799
          2  |   .8184093   .0146693    55.79   0.000     .7896579    .8471607
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -132365.56  
Iteration 1:   log pseudolikelihood = -127878.43  
Iteration 2:   log pseudolikelihood =  -127182.1  
Iteration 3:   log pseudolikelihood = -127179.74  
Iteration 4:   log pseudolikelihood = -127179.74  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(93)     =   12143.00
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -127179.74               Pseudo R2         =     0.0392

                                 (Std. Err. adjusted for 313 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
    ldlcscreen_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   .9253516   .0235881    -3.04   0.002     .8802558    .9727578
             2015  |   .9683616   .0530498    -0.59   0.557     .8697735    1.078125
             2016  |   .8256213   .0297566    -5.32   0.000     .7693117    .8860524
                   |
1.aco_death_active |   .8824365   .0850916    -1.30   0.195     .7304724    1.066014
                   |
            agegrp |
                1  |   1.071359   .0143189     5.16   0.000     1.043659    1.099795
                2  |   1.016053   .0203627     0.79   0.427      .976917    1.056758
                   |
          1.female |   1.135865   .0172047     8.41   0.000      1.10264    1.170091
                   |
           race_g3 |
                1  |   .7161282   .0389011    -6.15   0.000     .6438021    .7965797
                2  |   1.103302   .0794932     1.36   0.172     .9579995    1.270644
                   |
              HCC1 |   1.276741   .1600621     1.95   0.051     .9985956     1.63236
              HCC2 |   .8023292   .0242181    -7.30   0.000     .7562394     .851228
              HCC6 |   .9721196   .0788927    -0.35   0.728     .8291635    1.139723
              HCC8 |   .3566391   .0158957   -23.13   0.000     .3268062    .3891954
              HCC9 |   .7106525   .0317861    -7.64   0.000     .6510055    .7757645
             HCC10 |   .8316234   .0324362    -4.73   0.000     .7704189    .8976902
             HCC11 |   .9345783   .0331958    -1.90   0.057     .8717289    1.001959
             HCC12 |   1.183432   .0246415     8.09   0.000     1.136108    1.232728
             HCC17 |   1.520471   .0951806     6.69   0.000     1.344911    1.718949
             HCC18 |   1.537126   .0487617    13.55   0.000     1.444466    1.635731
             HCC19 |   1.450989   .0378303    14.28   0.000     1.378706    1.527063
             HCC21 |   .7307278   .0350136    -6.55   0.000     .6652262     .802679
             HCC22 |   1.023998   .0238655     1.02   0.309     .9782749    1.071858
             HCC23 |   1.025118   .0309586     0.82   0.411     .9662009    1.087627
             HCC27 |   .4902231   .0294083   -11.88   0.000     .4358434    .5513877
             HCC28 |    .748585   .0435759    -4.97   0.000     .6678698     .839055
             HCC29 |   1.007902    .074388     0.11   0.915     .8721584    1.164772
             HCC33 |   .9493938   .0430195    -1.15   0.252     .8687128    1.037568
             HCC34 |    .800579   .0897957    -1.98   0.047     .6425849    .9974196
             HCC35 |   .9643384    .059597    -0.59   0.557     .8543276    1.088515
             HCC39 |   .8874074   .0374021    -2.83   0.005     .8170468    .9638271
             HCC40 |   .9493915    .028521    -1.73   0.084     .8951053     1.00697
             HCC46 |    .834208   .0585654    -2.58   0.010      .726969    .9572664
             HCC47 |   .7782361   .0307334    -6.35   0.000     .7202718     .840865
             HCC48 |   1.063617   .0316699     2.07   0.038     1.003322    1.127536
             HCC54 |      1.008   .1368086     0.06   0.953     .7725618    1.315189
             HCC55 |    .970928   .0997528    -0.29   0.774     .7938435    1.187515
             HCC57 |   .5706989   .0409527    -7.82   0.000     .4958221    .6568833
             HCC58 |   .8236813   .0230153    -6.94   0.000     .7797852    .8700485
             HCC70 |   .7684165   .1047721    -1.93   0.053     .5882163    1.003821
             HCC71 |    .627524   .0721118    -4.05   0.000     .5009734    .7860424
             HCC72 |    .834194   .0517715    -2.92   0.003     .7386522    .9420937
             HCC73 |   .7631761   .2347396    -0.88   0.380     .4176476    1.394567
             HCC74 |   .8481867   .1470792    -0.95   0.342     .6037949    1.191498
             HCC75 |   .9093474    .040093    -2.16   0.031     .8340661    .9914234
             HCC76 |   .9656759   .2462547    -0.14   0.891     .5858258    1.591821
             HCC77 |   .7199486   .0671165    -3.52   0.000     .5997207    .8642789
             HCC78 |   .7127613   .0361512    -6.68   0.000     .6453142    .7872578
             HCC79 |   .7816452   .0303766    -6.34   0.000     .7243192    .8435084
             HCC80 |    .979733   .1057476    -0.19   0.850     .7929269    1.210549
             HCC82 |   .6648063   .0570701    -4.76   0.000     .5618546    .7866224
             HCC83 |   .9553567   .2344959    -0.19   0.852     .5905204    1.545597
             HCC84 |    .749702    .023504    -9.19   0.000     .7050218    .7972137
             HCC85 |   .8312365   .0182517    -8.42   0.000     .7962226      .86779
             HCC86 |   1.048507   .0452659     1.10   0.273     .9634368    1.141088
             HCC87 |   1.237998   .0437196     6.05   0.000     1.155207    1.326722
             HCC88 |   1.284073   .0511628     6.28   0.000     1.187611     1.38837
             HCC96 |   .9729108   .0160495    -1.66   0.096     .9419574    1.004881
             HCC99 |   .8549804   .0653794    -2.05   0.040     .7359795    .9932226
            HCC100 |    .909469   .0265129    -3.26   0.001     .8589613    .9629466
            HCC103 |   .7794651   .0343702    -5.65   0.000     .7149296    .8498262
            HCC104 |   .7246579   .0997459    -2.34   0.019     .5533106    .9490676
            HCC106 |   .7161815    .039293    -6.08   0.000     .6431648    .7974875
            HCC107 |   .9917236   .0349163    -0.24   0.813     .9255966    1.062575
            HCC108 |   1.082124   .0210746     4.05   0.000     1.041597    1.124228
            HCC110 |   .5446051   .1367706    -2.42   0.016     .3328997    .8909432
            HCC111 |   .8117333   .0160804   -10.53   0.000     .7808202    .8438702
            HCC112 |   .9535582   .0437028    -1.04   0.299     .8716368    1.043179
            HCC114 |   .8344319   .0489985    -3.08   0.002     .7437169    .9362119
            HCC115 |   .8823501   .0843738    -1.31   0.191     .7315529    1.064232
            HCC122 |   .9461629   .0401152    -1.31   0.192     .8707168    1.028146
            HCC124 |   1.050897   .0813129     0.64   0.521     .9030225    1.222986
            HCC134 |   .3407512   .0202938   -18.08   0.000     .3032097    .3829409
            HCC135 |   .7227568   .0197899   -11.86   0.000     .6849918    .7626039
            HCC136 |   .6302935   .0383972    -7.58   0.000     .5593556    .7102278
            HCC137 |   .7326502   .0383816    -5.94   0.000     .6611568    .8118745
            HCC157 |   .6637791   .0878556    -3.10   0.002     .5121078     .860371
            HCC158 |   .6402147   .0656737    -4.35   0.000      .523611    .7827851
            HCC161 |   .7511464   .0230502    -9.33   0.000     .7073006    .7977102
            HCC162 |   .6280456   .2264128    -1.29   0.197     .3098345    1.273071
            HCC166 |   .8931841    .340126    -0.30   0.767     .4234499    1.883996
            HCC167 |   .9420909   .0689554    -0.82   0.415     .8161876    1.087416
            HCC169 |   .7590515   .0444187    -4.71   0.000     .6767996    .8512996
            HCC170 |   .7161507   .0409163    -5.84   0.000     .6402834    .8010076
            HCC173 |   1.004846   .0725372     0.07   0.947     .8722754    1.157566
            HCC176 |   .9679812   .0342334    -0.92   0.357     .9031576    1.037458
            HCC186 |    1.17398   .1004426     1.87   0.061     .9927369    1.388312
            HCC188 |   .6694443   .0392691    -6.84   0.000     .5967379    .7510094
            HCC189 |   .6592715     .05486    -5.01   0.000     .5600582    .7760601
                   |
      providertype |
                1  |   1.145192   .1066188     1.46   0.145     .9541806    1.374442
                2  |   1.414631   .1218674     4.03   0.000     1.194851    1.674836
                   |
            n_pcps |   1.000071   .0002078     0.34   0.734     .9996635    1.000478
            n_spec |   .9998194   .0000948    -1.91   0.057     .9996337    1.000005
     lives_covered |   1.000004   1.53e-06     2.81   0.005     1.000001    1.000007
             _cons |   4.681813   .3438929    21.02   0.000     4.054066    5.406763
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -132365.56  
Iteration 1:   log pseudolikelihood = -127878.43  
Iteration 2:   log pseudolikelihood =  -127182.1  
Iteration 3:   log pseudolikelihood = -127179.74  
Iteration 4:   log pseudolikelihood = -127179.74  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(93)     =   12143.00
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -127179.74               Pseudo R2         =     0.0392

                             (Std. Err. adjusted for 313 clusters in cluster_id)
--------------------------------------------------------------------------------
               |               Robust
ldlcscreen_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
          year |
         2014  |   .9253516   .0235881    -3.04   0.002     .8802558    .9727578
         2015  |   .9683616   .0530498    -0.59   0.557     .8697735    1.078125
         2016  |   .8256213   .0297566    -5.32   0.000     .7693117    .8860524
               |
  1.death_year |   .8824365   .0850916    -1.30   0.195     .7304724    1.066014
               |
        agegrp |
            1  |   1.071359   .0143189     5.16   0.000     1.043659    1.099795
            2  |   1.016053   .0203627     0.79   0.427      .976917    1.056758
               |
      1.female |   1.135865   .0172047     8.41   0.000      1.10264    1.170091
               |
       race_g3 |
            1  |   .7161282   .0389011    -6.15   0.000     .6438021    .7965797
            2  |   1.103302   .0794932     1.36   0.172     .9579995    1.270644
               |
          HCC1 |   1.276741   .1600621     1.95   0.051     .9985956     1.63236
          HCC2 |   .8023292   .0242181    -7.30   0.000     .7562394     .851228
          HCC6 |   .9721196   .0788927    -0.35   0.728     .8291635    1.139723
          HCC8 |   .3566391   .0158957   -23.13   0.000     .3268062    .3891954
          HCC9 |   .7106525   .0317861    -7.64   0.000     .6510055    .7757645
         HCC10 |   .8316234   .0324362    -4.73   0.000     .7704189    .8976902
         HCC11 |   .9345783   .0331958    -1.90   0.057     .8717289    1.001959
         HCC12 |   1.183432   .0246415     8.09   0.000     1.136108    1.232728
         HCC17 |   1.520471   .0951806     6.69   0.000     1.344911    1.718949
         HCC18 |   1.537126   .0487617    13.55   0.000     1.444466    1.635731
         HCC19 |   1.450989   .0378303    14.28   0.000     1.378706    1.527063
         HCC21 |   .7307278   .0350136    -6.55   0.000     .6652262     .802679
         HCC22 |   1.023998   .0238655     1.02   0.309     .9782749    1.071858
         HCC23 |   1.025118   .0309586     0.82   0.411     .9662009    1.087627
         HCC27 |   .4902231   .0294083   -11.88   0.000     .4358434    .5513877
         HCC28 |    .748585   .0435759    -4.97   0.000     .6678698     .839055
         HCC29 |   1.007902    .074388     0.11   0.915     .8721584    1.164772
         HCC33 |   .9493938   .0430195    -1.15   0.252     .8687128    1.037568
         HCC34 |    .800579   .0897957    -1.98   0.047     .6425849    .9974196
         HCC35 |   .9643384    .059597    -0.59   0.557     .8543276    1.088515
         HCC39 |   .8874074   .0374021    -2.83   0.005     .8170468    .9638271
         HCC40 |   .9493915    .028521    -1.73   0.084     .8951053     1.00697
         HCC46 |    .834208   .0585654    -2.58   0.010      .726969    .9572664
         HCC47 |   .7782361   .0307334    -6.35   0.000     .7202718     .840865
         HCC48 |   1.063617   .0316699     2.07   0.038     1.003322    1.127536
         HCC54 |      1.008   .1368086     0.06   0.953     .7725618    1.315189
         HCC55 |    .970928   .0997528    -0.29   0.774     .7938435    1.187515
         HCC57 |   .5706989   .0409527    -7.82   0.000     .4958221    .6568833
         HCC58 |   .8236813   .0230153    -6.94   0.000     .7797852    .8700485
         HCC70 |   .7684165   .1047721    -1.93   0.053     .5882163    1.003821
         HCC71 |    .627524   .0721118    -4.05   0.000     .5009734    .7860424
         HCC72 |    .834194   .0517715    -2.92   0.003     .7386522    .9420937
         HCC73 |   .7631761   .2347396    -0.88   0.380     .4176476    1.394567
         HCC74 |   .8481867   .1470792    -0.95   0.342     .6037949    1.191498
         HCC75 |   .9093474    .040093    -2.16   0.031     .8340661    .9914234
         HCC76 |   .9656759   .2462547    -0.14   0.891     .5858258    1.591821
         HCC77 |   .7199486   .0671165    -3.52   0.000     .5997207    .8642789
         HCC78 |   .7127613   .0361512    -6.68   0.000     .6453142    .7872578
         HCC79 |   .7816452   .0303766    -6.34   0.000     .7243192    .8435084
         HCC80 |    .979733   .1057476    -0.19   0.850     .7929269    1.210549
         HCC82 |   .6648063   .0570701    -4.76   0.000     .5618546    .7866224
         HCC83 |   .9553567   .2344959    -0.19   0.852     .5905204    1.545597
         HCC84 |    .749702    .023504    -9.19   0.000     .7050218    .7972137
         HCC85 |   .8312365   .0182517    -8.42   0.000     .7962226      .86779
         HCC86 |   1.048507   .0452659     1.10   0.273     .9634368    1.141088
         HCC87 |   1.237998   .0437196     6.05   0.000     1.155207    1.326722
         HCC88 |   1.284073   .0511628     6.28   0.000     1.187611     1.38837
         HCC96 |   .9729108   .0160495    -1.66   0.096     .9419574    1.004881
         HCC99 |   .8549804   .0653794    -2.05   0.040     .7359795    .9932226
        HCC100 |    .909469   .0265129    -3.26   0.001     .8589613    .9629466
        HCC103 |   .7794651   .0343702    -5.65   0.000     .7149296    .8498262
        HCC104 |   .7246579   .0997459    -2.34   0.019     .5533106    .9490676
        HCC106 |   .7161815    .039293    -6.08   0.000     .6431648    .7974875
        HCC107 |   .9917236   .0349163    -0.24   0.813     .9255966    1.062575
        HCC108 |   1.082124   .0210746     4.05   0.000     1.041597    1.124228
        HCC110 |   .5446051   .1367706    -2.42   0.016     .3328997    .8909432
        HCC111 |   .8117333   .0160804   -10.53   0.000     .7808202    .8438702
        HCC112 |   .9535582   .0437028    -1.04   0.299     .8716368    1.043179
        HCC114 |   .8344319   .0489985    -3.08   0.002     .7437169    .9362119
        HCC115 |   .8823501   .0843738    -1.31   0.191     .7315529    1.064232
        HCC122 |   .9461629   .0401152    -1.31   0.192     .8707168    1.028146
        HCC124 |   1.050897   .0813129     0.64   0.521     .9030225    1.222986
        HCC134 |   .3407512   .0202938   -18.08   0.000     .3032097    .3829409
        HCC135 |   .7227568   .0197899   -11.86   0.000     .6849918    .7626039
        HCC136 |   .6302935   .0383972    -7.58   0.000     .5593556    .7102278
        HCC137 |   .7326502   .0383816    -5.94   0.000     .6611568    .8118745
        HCC157 |   .6637791   .0878556    -3.10   0.002     .5121078     .860371
        HCC158 |   .6402147   .0656737    -4.35   0.000      .523611    .7827851
        HCC161 |   .7511464   .0230502    -9.33   0.000     .7073006    .7977102
        HCC162 |   .6280456   .2264128    -1.29   0.197     .3098345    1.273071
        HCC166 |   .8931841    .340126    -0.30   0.767     .4234499    1.883996
        HCC167 |   .9420909   .0689554    -0.82   0.415     .8161876    1.087416
        HCC169 |   .7590515   .0444187    -4.71   0.000     .6767996    .8512996
        HCC170 |   .7161507   .0409163    -5.84   0.000     .6402834    .8010076
        HCC173 |   1.004846   .0725372     0.07   0.947     .8722754    1.157566
        HCC176 |   .9679812   .0342334    -0.92   0.357     .9031576    1.037458
        HCC186 |    1.17398   .1004426     1.87   0.061     .9927369    1.388312
        HCC188 |   .6694443   .0392691    -6.84   0.000     .5967379    .7510094
        HCC189 |   .6592715     .05486    -5.01   0.000     .5600582    .7760601
               |
  providertype |
            1  |   1.145192   .1066188     1.46   0.145     .9541806    1.374442
            2  |   1.414631   .1218674     4.03   0.000     1.194851    1.674836
               |
        n_pcps |   1.000071   .0002078     0.34   0.734     .9996635    1.000478
        n_spec |   .9998194   .0000948    -1.91   0.057     .9996337    1.000005
 lives_covered |   1.000004   1.53e-06     2.81   0.005     1.000001    1.000007
         _cons |   4.681813   .3438929    21.02   0.000     4.054066    5.406763
--------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    322,604
Model VCE    : Robust

Expression   : Pr(ldlcscreen_ind), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |    .857409   .0041749   205.37   0.000     .8492263    .8655917
          1  |    .842084   .0123515    68.18   0.000     .8178755    .8662924
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -125994.25  
Iteration 1:   log pseudolikelihood = -121585.02  
Iteration 2:   log pseudolikelihood =  -120925.1  
Iteration 3:   log pseudolikelihood = -120923.07  
Iteration 4:   log pseudolikelihood = -120923.07  

Logistic regression                             Number of obs     =    306,382
                                                Wald chi2(96)     =   12093.45
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -120923.07               Pseudo R2         =     0.0402

                               (Std. Err. adjusted for 298 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
  ldlcscreen_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   .9243738   .0256065    -2.84   0.005     .8755242     .975949
           2015  |   .9644962   .0573877    -0.61   0.543     .8583293    1.083795
           2016  |   .8067137   .0286995    -6.04   0.000       .75238    .8649711
                 |
     aco_exit_gr |
           2014  |     .65317   .0742664    -3.75   0.000      .522689    .8162235
                 |
year#aco_exit_gr |
      2014 2014  |   1.234307   .0717548     3.62   0.000     1.101387     1.38327
      2015 2014  |   .9960903   .0786587    -0.05   0.960     .8532602    1.162829
      2016 2014  |   1.115381   .0729046     1.67   0.095     .9812649    1.267828
                 |
          agegrp |
              1  |   1.073033   .0147532     5.13   0.000     1.044504    1.102342
              2  |   1.024176   .0219131     1.12   0.264     .9821152    1.068038
                 |
        1.female |   1.135084   .0176926     8.13   0.000     1.100932    1.170296
                 |
         race_g3 |
              1  |   .6940363   .0393737    -6.44   0.000     .6210009    .7756612
              2  |   1.086611   .0827826     1.09   0.276     .9358928    1.261602
                 |
            HCC1 |   1.387465   .1823336     2.49   0.013     1.072411    1.795075
            HCC2 |   .8006683   .0256854    -6.93   0.000     .7518759    .8526272
            HCC6 |    .965761   .0816358    -0.41   0.680     .8183094    1.139782
            HCC8 |   .3543895   .0166372   -22.10   0.000     .3232364     .388545
            HCC9 |   .6927386   .0295472    -8.61   0.000     .6371818    .7531395
           HCC10 |   .8516481   .0357223    -3.83   0.000     .7844344    .9246209
           HCC11 |    .946416   .0355763    -1.47   0.143     .8791944    1.018777
           HCC12 |   1.192788   .0255708     8.22   0.000     1.143708    1.243973
           HCC17 |   1.503774   .0949055     6.46   0.000     1.328807    1.701779
           HCC18 |    1.57736   .0510093    14.09   0.000     1.480486    1.680573
           HCC19 |   1.464307   .0385919    14.47   0.000     1.390589    1.541933
           HCC21 |   .7283841   .0369434    -6.25   0.000      .659459    .8045132
           HCC22 |   1.022236   .0248328     0.91   0.365     .9747052    1.072085
           HCC23 |   1.015985   .0316269     0.51   0.610     .9558502    1.079902
           HCC27 |   .4906571   .0312881   -11.17   0.000     .4330109    .5559777
           HCC28 |   .7315353   .0441832    -5.18   0.000      .649867    .8234667
           HCC29 |   .9821459   .0734907    -0.24   0.810      .848171    1.137283
           HCC33 |   .9672062   .0450264    -0.72   0.474     .8828625    1.059608
           HCC34 |   .8372883   .0952426    -1.56   0.118     .6699615    1.046406
           HCC35 |   1.017978   .0662175     0.27   0.784     .8961262    1.156398
           HCC39 |    .886278   .0386743    -2.77   0.006     .8136289    .9654141
           HCC40 |   .9704469    .031402    -0.93   0.354     .9108112    1.033987
           HCC46 |   .7900306    .056394    -3.30   0.001      .686884    .9086663
           HCC47 |   .7999602   .0326105    -5.48   0.000     .7385314    .8664984
           HCC48 |   1.069822   .0327941     2.20   0.028      1.00744    1.136067
           HCC54 |   .9060379   .1195932    -0.75   0.455     .6995059    1.173549
           HCC55 |   .9324661   .0908279    -0.72   0.473     .7704082    1.128614
           HCC57 |   .5759063   .0449474    -7.07   0.000     .4942181    .6710965
           HCC58 |    .810732   .0232206    -7.33   0.000     .7664744    .8575452
           HCC70 |   .7393327     .10177    -2.19   0.028     .5645091    .9682975
           HCC71 |   .7241041   .0881126    -2.65   0.008     .5704566    .9191353
           HCC72 |   .8417085   .0538664    -2.69   0.007     .7424851    .9541917
           HCC73 |   .7464123   .2393293    -0.91   0.362     .3981529     1.39929
           HCC74 |   .8592225   .1542554    -0.85   0.398     .6043524    1.221578
           HCC75 |   .9080986   .0402037    -2.18   0.029     .8326227    .9904163
           HCC76 |   .8810383   .2223062    -0.50   0.616     .5373003    1.444683
           HCC77 |   .6957639   .0669324    -3.77   0.000     .5762043    .8401317
           HCC78 |   .7033501   .0367653    -6.73   0.000     .6348599    .7792293
           HCC79 |   .7763931   .0307694    -6.39   0.000     .7183689    .8391041
           HCC80 |   .9548488   .1062616    -0.42   0.678     .7677283    1.187577
           HCC82 |   .7367894   .0583716    -3.86   0.000     .6308231    .8605561
           HCC83 |   .9667697   .2452339    -0.13   0.894     .5880368     1.58943
           HCC84 |   .7421059   .0233508    -9.48   0.000     .6977219    .7893134
           HCC85 |   .8308459   .0188182    -8.18   0.000     .7947695    .8685599
           HCC86 |   1.061327   .0462797     1.36   0.172     .9743887    1.156023
           HCC87 |   1.205934    .043064     5.24   0.000     1.124416    1.293361
           HCC88 |   1.273694   .0531345     5.80   0.000     1.173696    1.382212
           HCC96 |   .9615366   .0160459    -2.35   0.019     .9305961    .9935059
           HCC99 |   .8378841   .0699099    -2.12   0.034     .7114804    .9867451
          HCC100 |   .9339939   .0277952    -2.29   0.022     .8810746    .9900917
          HCC103 |   .7381428   .0335057    -6.69   0.000     .6753093    .8068226
          HCC104 |   .7064723   .0929835    -2.64   0.008     .5458369    .9143814
          HCC106 |   .7124404   .0410818    -5.88   0.000     .6363049    .7976858
          HCC107 |    .986814   .0361719    -0.36   0.717     .9184051    1.060318
          HCC108 |   1.072025   .0207033     3.60   0.000     1.032205     1.11338
          HCC110 |   .5059776   .1274003    -2.71   0.007     .3088922    .8288113
          HCC111 |   .8139968   .0164097   -10.21   0.000     .7824614    .8468032
          HCC112 |   .9657096   .0454076    -0.74   0.458     .8806901    1.058937
          HCC114 |   .8418908   .0489735    -2.96   0.003     .7511742     .943563
          HCC115 |   .9030248   .0884075    -1.04   0.297     .7453594    1.094041
          HCC122 |   .9662206   .0428516    -0.77   0.438     .8857797    1.053967
          HCC124 |   1.090554   .0881613     1.07   0.284      .930755    1.277789
          HCC134 |   .3410644   .0211647   -17.33   0.000     .3020057    .3851745
          HCC135 |   .7137304   .0196784   -12.23   0.000     .6761851    .7533605
          HCC136 |    .610839   .0388291    -7.75   0.000     .5392853    .6918866
          HCC137 |   .7164354   .0388358    -6.15   0.000     .6442226    .7967427
          HCC157 |   .6809642      .0963    -2.72   0.007     .5161189    .8984601
          HCC158 |   .6419403   .0639533    -4.45   0.000     .5280727    .7803611
          HCC161 |   .7548396   .0244808    -8.67   0.000     .7083513    .8043788
          HCC162 |   .5322873   .1872721    -1.79   0.073     .2670988    1.060768
          HCC166 |   .9707118   .4015054    -0.07   0.943     .4315357    2.183554
          HCC167 |   .9812357   .0751755    -0.25   0.805     .8444232    1.140214
          HCC169 |   .7515365   .0456175    -4.71   0.000     .6672414    .8464809
          HCC170 |   .7479122    .043961    -4.94   0.000     .6665281    .8392334
          HCC173 |   .9601929   .0709917    -0.55   0.583     .8306634    1.109921
          HCC176 |   .9438895   .0337688    -1.61   0.107      .879971    1.012451
          HCC186 |   1.194564   .1040327     2.04   0.041     1.007116      1.4169
          HCC188 |   .6847074   .0404218    -6.42   0.000     .6098937    .7686982
          HCC189 |   .6657913   .0574861    -4.71   0.000     .5621383     .788557
                 |
    providertype |
              1  |   1.160158   .1074991     1.60   0.109     .9674879    1.391197
              2  |   1.421781   .1319207     3.79   0.000     1.185368    1.705343
                 |
          n_pcps |   1.000042   .0002152     0.20   0.845     .9996204    1.000464
          n_spec |   .9998254   .0000941    -1.86   0.064     .9996411     1.00001
   lives_covered |   1.000004   1.56e-06     2.78   0.005     1.000001    1.000007
           _cons |   4.775821   .3694079    20.21   0.000     4.104005    5.557611
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,382
Model VCE    : Robust

Expression   : Pr(ldlcscreen_ind), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |   .8658978    .004433   195.33   0.000     .8572092    .8745864
           2014  |   .8586557   .0046111   186.22   0.000     .8496182    .8676932
           2015  |   .8617804   .0059909   143.85   0.000     .8500384    .8735224
           2016  |   .8411489    .005643   149.06   0.000     .8300888    .8522089
                 |
     aco_exit_gr |
              0  |   .8591913   .0043728   196.49   0.000     .8506207    .8677618
           2014  |   .8138508   .0155095    52.47   0.000     .7834526     .844249
                 |
year#aco_exit_gr |
      2013    0  |   .8690702   .0045432   191.29   0.000     .8601658    .8779747
      2013 2014  |   .8152327   .0157114    51.89   0.000     .7844389    .8460266
      2014    0  |   .8602291   .0047055   182.81   0.000     .8510066    .8694517
      2014 2014  |   .8334935   .0159079    52.40   0.000     .8023146    .8646723
      2015    0  |   .8650654   .0062735   137.89   0.000     .8527696    .8773613
      2015 2014  |   .8093922   .0170701    47.42   0.000     .7759354    .8428489
      2016    0  |   .8437695   .0058547   144.12   0.000     .8322944    .8552445
      2016 2014  |   .7995441   .0158514    50.44   0.000     .7684759    .8306122
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -132365.56  
Iteration 1:   log pseudolikelihood = -127821.58  
Iteration 2:   log pseudolikelihood = -127122.57  
Iteration 3:   log pseudolikelihood =  -127120.2  
Iteration 4:   log pseudolikelihood =  -127120.2  

Logistic regression                             Number of obs     =    322,604
                                                Wald chi2(96)     =   12414.31
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -127120.2               Pseudo R2         =     0.0396

                               (Std. Err. adjusted for 313 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
  ldlcscreen_ind | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   .9266102   .0257175    -2.75   0.006     .8775513    .9784116
           2015  |    .958655    .056405    -0.72   0.473     .8542396    1.075833
           2016  |   .8039096   .0283427    -6.19   0.000     .7502347    .8614246
                 |
     aco_exit_gr |
           2015  |   .8093479   .0842883    -2.03   0.042     .6599152    .9926185
                 |
year#aco_exit_gr |
      2014 2015  |   .9949937   .0615709    -0.08   0.935     .8813479    1.123293
      2015 2015  |   1.009309   .0942494     0.10   0.921     .8405017    1.212019
      2016 2015  |   1.070137   .0975062     0.74   0.457     .8951206    1.279373
                 |
          agegrp |
              1  |   1.071453   .0143586     5.15   0.000     1.043678    1.099969
              2  |   1.016892   .0204118     0.83   0.404     .9776627    1.057696
                 |
        1.female |   1.135879   .0172312     8.40   0.000     1.102604    1.170159
                 |
         race_g3 |
              1  |   .7166581   .0393209    -6.07   0.000     .6435897    .7980221
              2  |   1.099119   .0773734     1.34   0.179     .9574663    1.261728
                 |
            HCC1 |   1.272845    .161387     1.90   0.057      .992772    1.631929
            HCC2 |   .8018175   .0243399    -7.28   0.000     .7555035    .8509706
            HCC6 |   .9721101   .0790059    -0.35   0.728     .8289648    1.139974
            HCC8 |   .3556664   .0158128   -23.25   0.000     .3259858    .3880494
            HCC9 |    .709859   .0319489    -7.61   0.000     .6499228    .7753225
           HCC10 |   .8314728   .0324326    -4.73   0.000     .7702752    .8975324
           HCC11 |   .9344682    .033194    -1.91   0.056     .8716223    1.001846
           HCC12 |   1.182073   .0246887     8.01   0.000     1.134661    1.231466
           HCC17 |    1.51741   .0951199     6.65   0.000     1.341976    1.715778
           HCC18 |   1.539116   .0486911    13.63   0.000     1.446581     1.63757
           HCC19 |    1.45187   .0378825    14.29   0.000     1.379489     1.52805
           HCC21 |   .7301503   .0350394    -6.55   0.000     .6646051    .8021596
           HCC22 |   1.023893   .0239195     1.01   0.312      .978069    1.071864
           HCC23 |   1.024192   .0308349     0.79   0.427     .9655054    1.086446
           HCC27 |   .4904626   .0293611   -11.90   0.000     .4361637    .5515213
           HCC28 |   .7477267   .0435307    -4.99   0.000     .6670957    .8381035
           HCC29 |   1.005135    .073419     0.07   0.944     .8710629    1.159844
           HCC33 |   .9482049   .0427855    -1.18   0.239     .8679481    1.035883
           HCC34 |   .7988339   .0895079    -2.00   0.045      .641329    .9950206
           HCC35 |   .9627746   .0595541    -0.61   0.540     .8528489    1.086869
           HCC39 |   .8859871   .0374084    -2.87   0.004     .8156198    .9624254
           HCC40 |   .9492883   .0285854    -1.73   0.084     .8948833    1.007001
           HCC46 |   .8303823   .0583574    -2.64   0.008     .7235317    .9530124
           HCC47 |   .7778285   .0306706    -6.37   0.000     .7199794    .8403257
           HCC48 |   1.063085   .0316125     2.06   0.040     1.002897    1.126886
           HCC54 |   1.006654   .1365123     0.05   0.961      .771701    1.313142
           HCC55 |   .9678663   .0993474    -0.32   0.750     .7914857    1.183553
           HCC57 |    .574283   .0416372    -7.65   0.000     .4982088    .6619733
           HCC58 |   .8247687   .0229651    -6.92   0.000     .7809641    .8710303
           HCC70 |   .7663122   .1050301    -1.94   0.052     .5857884    1.002469
           HCC71 |   .6288618   .0722129    -4.04   0.000     .5021239    .7875889
           HCC72 |   .8335297   .0514894    -2.95   0.003     .7384822    .9408104
           HCC73 |   .7594901   .2339564    -0.89   0.372     .4152547    1.389088
           HCC74 |   .8487108   .1478748    -0.94   0.346     .6031856    1.194176
           HCC75 |   .9107207   .0401209    -2.12   0.034     .8353845    .9928509
           HCC76 |   .9676205   .2481324    -0.13   0.898     .5853648    1.599497
           HCC77 |   .7219809   .0673618    -3.49   0.000     .6013226      .86685
           HCC78 |   .7126019   .0360433    -6.70   0.000     .6453471    .7868658
           HCC79 |   .7812676   .0303289    -6.36   0.000     .7240292     .843031
           HCC80 |   .9828523   .1054282    -0.16   0.872      .796493    1.212815
           HCC82 |   .6657336    .056559    -4.79   0.000     .5636178    .7863507
           HCC83 |   .9558911   .2362429    -0.18   0.855     .5888963    1.551593
           HCC84 |   .7505133   .0236131    -9.12   0.000     .7056305    .7982509
           HCC85 |   .8310269   .0183036    -8.40   0.000     .7959158     .867687
           HCC86 |   1.048165    .045288     1.09   0.276     .9630566    1.140795
           HCC87 |   1.239523   .0441702     6.03   0.000     1.155905     1.32919
           HCC88 |   1.283063   .0510992     6.26   0.000      1.18672    1.387228
           HCC96 |   .9724662    .016065    -1.69   0.091     .9414837    1.004468
           HCC99 |   .8540934   .0654705    -2.06   0.040     .7349478    .9925542
          HCC100 |   .9104564   .0264922    -3.22   0.001     .8599854    .9638894
          HCC103 |   .7812743   .0345028    -5.59   0.000     .7164941    .8519116
          HCC104 |   .7275843   .0998241    -2.32   0.020      .556031    .9520672
          HCC106 |   .7168614   .0393822    -6.06   0.000     .6436841    .7983578
          HCC107 |   .9924074   .0349764    -0.22   0.829      .926169    1.063383
          HCC108 |   1.082451   .0213229     4.02   0.000     1.041456    1.125061
          HCC110 |   .5501536   .1384988    -2.37   0.018     .3358905    .9010944
          HCC111 |   .8120594   .0161277   -10.48   0.000      .781057    .8442923
          HCC112 |   .9549518   .0438143    -1.00   0.315     .8728253    1.044806
          HCC114 |   .8363886   .0492234    -3.04   0.002     .7452688    .9386491
          HCC115 |    .883298   .0843594    -1.30   0.194     .7325095    1.065127
          HCC122 |   .9465903   .0398463    -1.30   0.192     .8716278       1.028
          HCC124 |    1.04947    .081256     0.62   0.533     .9017065    1.221448
          HCC134 |   .3408826   .0202853   -18.09   0.000     .3033552    .3830525
          HCC135 |   .7231018   .0199141   -11.77   0.000     .6851057    .7632053
          HCC136 |   .6311229   .0383471    -7.57   0.000     .5602667    .7109401
          HCC137 |   .7329447   .0384215    -5.93   0.000     .6613793    .8122538
          HCC157 |   .6637573   .0875842    -3.11   0.002     .5124971    .8596609
          HCC158 |   .6425462   .0659737    -4.31   0.000     .5254204    .7857816
          HCC161 |   .7517375   .0230138    -9.32   0.000     .7079578    .7982245
          HCC162 |   .6472388   .2362237    -1.19   0.233     .3165193    1.323515
          HCC166 |    .899752   .3419343    -0.28   0.781     .4272078    1.894988
          HCC167 |   .9416397   .0687151    -0.82   0.410     .8161487    1.086426
          HCC169 |   .7578918   .0443393    -4.74   0.000     .6757857    .8499736
          HCC170 |   .7163462   .0408015    -5.86   0.000     .6406788    .8009501
          HCC173 |   1.003889   .0724884     0.05   0.957     .8714103    1.156509
          HCC176 |   .9682433   .0343537    -0.91   0.363     .9031991    1.037972
          HCC186 |    1.17134   .1003887     1.85   0.065     .9902198     1.38559
          HCC188 |   .6684749   .0391544    -6.88   0.000     .5959747    .7497946
          HCC189 |   .6612013   .0552755    -4.95   0.000     .5612733    .7789202
                 |
    providertype |
              1  |   1.144127   .1053903     1.46   0.144     .9551389    1.370509
              2  |   1.449556   .1248947     4.31   0.000      1.22432    1.716229
                 |
          n_pcps |   1.000091   .0002046     0.45   0.656     .9996902    1.000492
          n_spec |   .9998081    .000096    -2.00   0.046     .9996201    .9999963
   lives_covered |   1.000004   1.50e-06     2.76   0.006     1.000001    1.000007
           _cons |   4.801637   .3613918    20.85   0.000     4.143089    5.564862
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    322,604
Model VCE    : Robust

Expression   : Pr(ldlcscreen_ind), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |   .8669946   .0042968   201.78   0.000     .8585731    .8754161
           2014  |   .8582468   .0045629   188.09   0.000     .8493036    .8671899
           2015  |   .8623684   .0058066   148.51   0.000     .8509876    .8737492
           2016  |   .8419197    .005474   153.80   0.000     .8311908    .8526486
                 |
     aco_exit_gr |
              0  |   .8595474   .0043348   198.29   0.000     .8510514    .8680433
           2015  |   .8358737   .0109077    76.63   0.000      .814495    .8572525
                 |
year#aco_exit_gr |
      2013    0  |   .8695881   .0045512   191.07   0.000      .860668    .8785083
      2013 2015  |   .8447659   .0121414    69.58   0.000     .8209691    .8685626
      2014    0  |   .8610498   .0047537   181.13   0.000     .8517328    .8703668
      2014 2015  |   .8342741   .0126008    66.21   0.000      .809577    .8589711
      2015    0  |   .8649137   .0061327   141.03   0.000     .8528939    .8769335
      2015 2015  |   .8405751    .011281    74.51   0.000     .8184647    .8626855
      2016    0  |   .8439158   .0058372   144.58   0.000     .8324751    .8553565
      2016 2015  |   .8248984   .0128072    64.41   0.000     .7997968         .85
----------------------------------------------------------------------------------
***********************************************************
                    Oct 2019 New Models                    
                All Years of Data any_readm                
23:41:54 28 Sep 2021
***********************************************************

Iteration 0:   log pseudolikelihood = -136378.92  
Iteration 1:   log pseudolikelihood = -131178.69  
Iteration 2:   log pseudolikelihood =  -130777.2  
Iteration 3:   log pseudolikelihood = -130777.04  
Iteration 4:   log pseudolikelihood = -130777.04  

Logistic regression                             Number of obs     =    306,675
                                                Wald chi2(94)     =   30914.03
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -130777.04               Pseudo R2         =     0.0411

                                 (Std. Err. adjusted for 306 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
         any_readm | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   .9865498   .0170448    -0.78   0.433     .9537019    1.020529
             2015  |   1.019056   .0241373     0.80   0.425     .9728289    1.067479
             2016  |   1.000574   .0202014     0.03   0.977     .9617533    1.040962
                   |
1.aco_death_active |   1.020718   .0449545     0.47   0.642     .9363043    1.112742
                   |
            agegrp |
                1  |   1.022598   .0173582     1.32   0.188     .9891362    1.057191
                2  |   1.152524   .0232995     7.02   0.000     1.107751    1.199107
                3  |   1.284724   .0227671    14.14   0.000     1.240867     1.33013
                   |
          1.female |   .9566648    .011397    -3.72   0.000     .9345858    .9792654
                   |
           race_g3 |
                1  |     1.2459   .0303277     9.03   0.000     1.187855    1.306782
                2  |    1.05172   .0329105     1.61   0.107     .9891543    1.118242
                   |
              HCC1 |   1.032655    .115402     0.29   0.774     .8295287    1.285522
              HCC2 |   1.154151   .0261507     6.33   0.000     1.104018     1.20656
              HCC6 |   1.087103   .0671886     1.35   0.177     .9630795    1.227099
              HCC8 |   1.702139   .0539717    16.77   0.000     1.599577    1.811278
              HCC9 |   1.253081   .0374759     7.54   0.000      1.18174    1.328727
             HCC10 |   1.118482   .0380121     3.29   0.001     1.046407    1.195522
             HCC11 |   1.120736   .0289005     4.42   0.000       1.0655    1.178836
             HCC12 |   .9459151   .0216597    -2.43   0.015     .9044014    .9893345
             HCC17 |    1.34927   .0867732     4.66   0.000      1.18948    1.530526
             HCC18 |   1.206895   .0193023    11.76   0.000      1.16965    1.245326
             HCC19 |   1.129457   .0152354     9.02   0.000     1.099988    1.159716
             HCC21 |   1.145581   .0389415     4.00   0.000     1.071744    1.224505
             HCC22 |   1.050755   .0297283     1.75   0.080     .9940743    1.110667
             HCC23 |   1.091638   .0221041     4.33   0.000     1.049163    1.135832
             HCC27 |   1.854581   .1033613    11.08   0.000     1.662669    2.068644
             HCC28 |   1.334849   .0734238     5.25   0.000     1.198427    1.486801
             HCC29 |   1.053932   .0871208     0.64   0.525     .8962926    1.239296
             HCC33 |   1.133703   .0310197     4.59   0.000     1.074507     1.19616
             HCC34 |   1.275651   .1052047     2.95   0.003     1.085256    1.499449
             HCC35 |   1.154685   .0567924     2.92   0.003      1.04857    1.271537
             HCC39 |    1.04932    .042402     1.19   0.234     .9694195    1.135806
             HCC40 |   1.107933   .0196837     5.77   0.000     1.070018    1.147192
             HCC46 |    1.31563   .0608078     5.94   0.000     1.201687    1.440376
             HCC47 |   1.244778   .0395313     6.89   0.000      1.16966     1.32472
             HCC48 |   1.074674     .02111     3.67   0.000     1.034086    1.116856
             HCC54 |   1.167117   .1073561     1.68   0.093     .9745797    1.397691
             HCC55 |   1.288663   .0833909     3.92   0.000      1.13516    1.462924
             HCC57 |   1.366837     .08034     5.32   0.000     1.218105    1.533729
             HCC58 |   1.130538   .0292717     4.74   0.000     1.074598     1.18939
             HCC70 |   .9427267   .0978753    -0.57   0.570     .7691531     1.15547
             HCC71 |   1.385625   .1464341     3.09   0.002     1.126393    1.704518
             HCC72 |   1.111418   .0573052     2.05   0.040     1.004591    1.229605
             HCC73 |   .8158396   .1570715    -1.06   0.290     .5594034    1.189829
             HCC74 |   1.500744    .196195     3.11   0.002     1.161522    1.939036
             HCC75 |   1.082903   .0369089     2.34   0.019     1.012926    1.157714
             HCC76 |   1.191867   .2605949     0.80   0.422     .7764567    1.829524
             HCC77 |   1.161647   .0897396     1.94   0.052     .9984285    1.351547
             HCC78 |   1.190124   .0334744     6.19   0.000     1.126291    1.257575
             HCC79 |   1.167589   .0334175     5.41   0.000     1.103895    1.234958
             HCC80 |   1.051851   .0785652     0.68   0.499     .9086063    1.217678
             HCC82 |    1.03541    .067446     0.53   0.593     .9113092    1.176411
             HCC83 |   1.418351   .2196946     2.26   0.024     1.046978    1.921455
             HCC84 |   1.248815   .0254996    10.88   0.000     1.199824    1.299807
             HCC85 |   1.336353   .0177175    21.87   0.000     1.302075    1.371534
             HCC86 |   1.186246   .0358091     5.66   0.000     1.118097    1.258549
             HCC87 |   1.057598   .0274917     2.15   0.031     1.005065    1.112877
             HCC88 |   .9902398   .0288462    -0.34   0.736      .935286    1.048422
             HCC96 |   1.136911   .0143003    10.20   0.000     1.109226    1.165287
             HCC99 |    1.11758   .0556198     2.23   0.026     1.013716    1.232087
            HCC100 |   1.097768   .0203276     5.04   0.000     1.058641    1.138342
            HCC103 |   1.004946   .0319525     0.16   0.877     .9442314    1.069564
            HCC104 |   1.001517   .1164331     0.01   0.990     .7974441    1.257813
            HCC106 |   1.307656   .0627527     5.59   0.000      1.19027    1.436619
            HCC107 |   1.093382   .0215631     4.53   0.000     1.051925    1.136472
            HCC108 |   1.092007   .0128992     7.45   0.000     1.067016    1.117584
            HCC110 |   1.398742   .5319825     0.88   0.378     .6637443     2.94764
            HCC111 |   1.352079   .0157833    25.84   0.000     1.321495     1.38337
            HCC112 |   1.131276   .0401544     3.48   0.001      1.05525    1.212779
            HCC114 |   1.102743   .0336791     3.20   0.001      1.03867    1.170768
            HCC115 |   1.082251   .0652754     1.31   0.190     .9615863    1.218057
            HCC122 |   1.162256   .0458506     3.81   0.000     1.075777    1.255687
            HCC124 |   1.038091    .035848     1.08   0.279     .9701547    1.110784
            HCC134 |   1.809422   .0644573    16.65   0.000     1.687397    1.940271
            HCC135 |   1.331781   .0258795    14.74   0.000     1.282012    1.383482
            HCC136 |   1.399505   .0617284     7.62   0.000     1.283602    1.525874
            HCC137 |   1.375371   .0519347     8.44   0.000     1.277256    1.481023
            HCC157 |   1.018092   .1009697     0.18   0.857     .8382405    1.236532
            HCC158 |   .9963518   .0713212    -0.05   0.959     .8659278     1.14642
            HCC161 |   1.134782   .0271987     5.28   0.000     1.082706    1.189362
            HCC162 |   1.138368   .3412104     0.43   0.665      .632625    2.048419
            HCC166 |   1.203623   .3410003     0.65   0.513     .6907731    2.097228
            HCC167 |   .9753268   .0548057    -0.44   0.657     .8736135    1.088882
            HCC169 |   1.130068   .0330059     4.19   0.000     1.067194    1.196646
            HCC170 |   1.023641   .0304706     0.78   0.432     .9656286    1.085139
            HCC173 |    1.12063   .0614197     2.08   0.038      1.00649    1.247714
            HCC176 |   1.110355    .027083     4.29   0.000     1.058523    1.164726
            HCC186 |   1.323265   .0930028     3.99   0.000     1.152981    1.518699
            HCC188 |   1.235927    .045336     5.77   0.000     1.150189    1.328056
            HCC189 |   1.289468   .0923981     3.55   0.000     1.120513    1.483898
                   |
      providertype |
                1  |    .983512   .0297755    -0.55   0.583     .9268508    1.043637
                2  |   1.021979    .032417     0.69   0.493     .9603776    1.087532
                   |
            n_pcps |   1.000183   .0000593     3.09   0.002     1.000067    1.000299
            n_spec |   .9999558   .0000193    -2.29   0.022      .999918    .9999936
     lives_covered |   .9999995   3.85e-07    -1.25   0.211     .9999988           1
             _cons |   .0990734   .0034648   -66.11   0.000       .09251    .1061026
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -136378.92  
Iteration 1:   log pseudolikelihood =  -131178.3  
Iteration 2:   log pseudolikelihood =  -130776.8  
Iteration 3:   log pseudolikelihood = -130776.65  
Iteration 4:   log pseudolikelihood = -130776.65  

Logistic regression                             Number of obs     =    306,675
                                                Wald chi2(95)     =   31719.72
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -130776.65               Pseudo R2         =     0.0411

                            (Std. Err. adjusted for 306 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
    any_readm | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |   .9867163    .017061    -0.77   0.439     .9538376    1.020728
        2015  |     1.0156   .0246822     0.64   0.524     .9683576    1.065147
        2016  |   1.002282   .0203643     0.11   0.911     .9631529    1.043001
              |
   death_year |
           1  |   1.044965   .0554383     0.83   0.407     .9417664    1.159472
           2  |   .9945468   .0470185    -0.12   0.908     .9065329    1.091106
              |
       agegrp |
           1  |   1.022652   .0173575     1.32   0.187     .9891915    1.057244
           2  |   1.152643   .0232936     7.03   0.000     1.107881    1.199213
           3  |   1.284862   .0227627    14.15   0.000     1.241013    1.330259
              |
     1.female |   .9566849   .0113966    -3.72   0.000     .9346068    .9792846
              |
      race_g3 |
           1  |   1.245906   .0303403     9.03   0.000     1.187837    1.306814
           2  |   1.051494   .0329083     1.60   0.109     .9889329    1.118012
              |
         HCC1 |   1.032566   .1153622     0.29   0.774     .8295034    1.285337
         HCC2 |   1.154136   .0261511     6.33   0.000     1.104002    1.206546
         HCC6 |   1.087297   .0671934     1.35   0.176     .9632636    1.227301
         HCC8 |   1.702039   .0539635    16.77   0.000     1.599491    1.811161
         HCC9 |   1.252973   .0374745     7.54   0.000     1.181635    1.328617
        HCC10 |   1.118517   .0380114     3.30   0.001     1.046443    1.195555
        HCC11 |   1.120742   .0288953     4.42   0.000     1.065515    1.178831
        HCC12 |   .9459252   .0216627    -2.43   0.015     .9044059    .9893505
        HCC17 |   1.349186   .0867628     4.66   0.000     1.189415     1.53042
        HCC18 |    1.20693   .0192993    11.76   0.000     1.169691    1.245355
        HCC19 |   1.129522   .0152299     9.03   0.000     1.100063     1.15977
        HCC21 |    1.14565   .0389513     4.00   0.000     1.071795    1.224594
        HCC22 |   1.050716   .0297324     1.75   0.080     .9940281    1.110637
        HCC23 |   1.091576   .0221103     4.33   0.000      1.04909    1.135783
        HCC27 |   1.854434   .1033581    11.08   0.000     1.662528    2.068491
        HCC28 |   1.335023   .0734437     5.25   0.000     1.198565    1.487017
        HCC29 |   1.053846   .0871385     0.63   0.526     .8961781    1.239252
        HCC33 |    1.13363   .0310157     4.58   0.000     1.074441    1.196079
        HCC34 |   1.275666   .1052235     2.95   0.003     1.085239    1.499507
        HCC35 |    1.15467   .0567923     2.92   0.003     1.048556    1.271523
        HCC39 |   1.049315   .0424055     1.19   0.234     .9694085    1.135809
        HCC40 |   1.107899   .0196842     5.77   0.000     1.069982    1.147159
        HCC46 |   1.315742   .0608055     5.94   0.000     1.201804    1.440483
        HCC47 |   1.244734   .0395393     6.89   0.000     1.169601    1.324692
        HCC48 |   1.074716   .0211083     3.67   0.000     1.034131    1.116894
        HCC54 |   1.167293   .1073439     1.68   0.093     .9747733    1.397835
        HCC55 |   1.289634   .0835736     3.93   0.000     1.135809    1.464293
        HCC57 |   1.366498   .0802905     5.31   0.000     1.217854    1.533284
        HCC58 |   1.130463   .0292753     4.74   0.000     1.074516    1.189323
        HCC70 |   .9430141   .0978647    -0.57   0.572     .7694521    1.155726
        HCC71 |   1.385518   .1464247     3.09   0.002     1.126303     1.70439
        HCC72 |   1.111413   .0573022     2.05   0.040     1.004591    1.229594
        HCC73 |   .8157395    .157077    -1.06   0.290     .5593015    1.189753
        HCC74 |   1.500909   .1962282     3.11   0.002     1.161633    1.939278
        HCC75 |   1.082847   .0368934     2.34   0.019     1.012898    1.157625
        HCC76 |   1.191833   .2605738     0.80   0.422     .7764527    1.829431
        HCC77 |   1.161872   .0897301     1.94   0.052      .998668    1.351748
        HCC78 |   1.190125   .0334802     6.19   0.000     1.126281    1.257588
        HCC79 |   1.167644   .0334301     5.41   0.000     1.103927    1.235039
        HCC80 |   1.052135   .0786114     0.68   0.496     .9088099    1.218064
        HCC82 |   1.035455   .0674542     0.53   0.593      .911339    1.176474
        HCC83 |   1.419041   .2197183     2.26   0.024     1.047607    1.922168
        HCC84 |   1.248886   .0255054    10.88   0.000     1.199884     1.29989
        HCC85 |   1.336356   .0177199    21.87   0.000     1.302073    1.371542
        HCC86 |   1.186098   .0358066     5.65   0.000     1.117955    1.258396
        HCC87 |   1.057506    .027486     2.15   0.031     1.004983    1.112773
        HCC88 |   .9901965   .0288501    -0.34   0.735     .9352355    1.048387
        HCC96 |   1.136898   .0143008    10.20   0.000     1.109212    1.165276
        HCC99 |   1.117575   .0556129     2.23   0.025     1.013722    1.232066
       HCC100 |   1.097732   .0203273     5.04   0.000     1.058606    1.138305
       HCC103 |   1.004981    .031967     0.16   0.876     .9442401     1.06963
       HCC104 |   1.001534   .1164383     0.01   0.989     .7974529    1.257843
       HCC106 |    1.30766   .0627535     5.59   0.000     1.190273    1.436625
       HCC107 |    1.09337   .0215678     4.53   0.000     1.051905     1.13647
       HCC108 |   1.092021   .0128993     7.45   0.000     1.067029    1.117598
       HCC110 |    1.39791   .5316209     0.88   0.378     .6633916      2.9457
       HCC111 |   1.352043   .0157846    25.84   0.000     1.321457    1.383337
       HCC112 |   1.131295   .0401521     3.48   0.001     1.055273    1.212794
       HCC114 |   1.102675   .0336711     3.20   0.001     1.038617    1.170684
       HCC115 |   1.082257   .0652591     1.31   0.190     .9616205    1.218028
       HCC122 |   1.162274   .0458589     3.81   0.000      1.07578    1.255723
       HCC124 |   1.038139    .035855     1.08   0.278     .9701905    1.110847
       HCC134 |   1.809322   .0644618    16.64   0.000      1.68729     1.94018
       HCC135 |   1.331779   .0258782    14.75   0.000     1.282013    1.383478
       HCC136 |   1.399466   .0617249     7.62   0.000     1.283569    1.525827
       HCC137 |   1.375447   .0519373     8.44   0.000     1.277327    1.481103
       HCC157 |   1.017756   .1009409     0.18   0.859     .8379568    1.236134
       HCC158 |   .9964852   .0713224    -0.05   0.961      .866058    1.146555
       HCC161 |   1.134784   .0271985     5.28   0.000     1.082708    1.189364
       HCC162 |   1.137655   .3411065     0.43   0.667     .6321096    2.047524
       HCC166 |   1.202379   .3406491     0.65   0.515     .6900573    2.095065
       HCC167 |   .9753336   .0548026    -0.44   0.657     .8736257    1.088882
       HCC169 |   1.130214   .0330031     4.19   0.000     1.067345    1.196786
       HCC170 |   1.023438   .0304716     0.78   0.437     .9654235    1.084938
       HCC173 |   1.120478    .061419     2.08   0.038      1.00634    1.247562
       HCC176 |   1.110403   .0270829     4.29   0.000      1.05857    1.164774
       HCC186 |   1.323144   .0930328     3.98   0.000     1.152809    1.518646
       HCC188 |   1.235891   .0453402     5.77   0.000     1.150146    1.328029
       HCC189 |   1.289196   .0923832     3.54   0.000     1.120269    1.483596
              |
 providertype |
           1  |   .9834363   .0297526    -0.55   0.581     .9268175    1.043514
           2  |   1.022001   .0323966     0.69   0.492     .9604371    1.087511
              |
       n_pcps |   1.000187     .00006     3.11   0.002     1.000069    1.000304
       n_spec |   .9999556   .0000193    -2.30   0.021     .9999178    .9999934
lives_covered |   .9999995   3.99e-07    -1.33   0.183     .9999987           1
        _cons |   .0991382   .0034683   -66.07   0.000     .0925684    .1061744
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,675
Model VCE    : Robust

Expression   : Pr(any_readm), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .1629567   .0015693   103.84   0.000      .159881    .1660324
          1  |   .1687859    .006946    24.30   0.000      .155172    .1823998
          2  |   .1622431   .0060105    26.99   0.000     .1504627    .1740235
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -143364.54  
Iteration 1:   log pseudolikelihood = -137820.58  
Iteration 2:   log pseudolikelihood = -137393.46  
Iteration 3:   log pseudolikelihood = -137393.31  
Iteration 4:   log pseudolikelihood = -137393.31  

Logistic regression                             Number of obs     =    320,972
                                                Wald chi2(94)     =   32193.84
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -137393.31               Pseudo R2         =     0.0417

                                 (Std. Err. adjusted for 321 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
         any_readm | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   .9916224   .0167372    -0.50   0.618     .9593547    1.024975
             2015  |   1.018704   .0225337     0.84   0.402     .9754821     1.06384
             2016  |   .9998509   .0201448    -0.01   0.994     .9611372    1.040124
                   |
1.aco_death_active |   1.042562   .0378816     1.15   0.251     .9708975    1.119516
                   |
            agegrp |
                1  |   1.025619   .0170729     1.52   0.129     .9926968    1.059633
                2  |   1.149582   .0223051     7.18   0.000     1.106686    1.194141
                3  |   1.278598   .0223243    14.08   0.000     1.235583     1.32311
                   |
          1.female |   .9575567   .0111304    -3.73   0.000     .9359881    .9796224
                   |
           race_g3 |
                1  |    1.23003   .0291893     8.72   0.000      1.17413    1.288591
                2  |   1.040364   .0303476     1.36   0.175     .9825522    1.101578
                   |
              HCC1 |   1.038938   .1163145     0.34   0.733     .8342447    1.293857
              HCC2 |   1.167922   .0250652     7.23   0.000     1.119814    1.218096
              HCC6 |   1.120997    .069104     1.85   0.064      .993418     1.26496
              HCC8 |   1.667693   .0544965    15.65   0.000      1.56423    1.777999
              HCC9 |   1.251975   .0361067     7.79   0.000      1.18317    1.324781
             HCC10 |   1.136845   .0363309     4.01   0.000     1.067822    1.210329
             HCC11 |   1.103208   .0274607     3.95   0.000     1.050678    1.158365
             HCC12 |   .9522598   .0212462    -2.19   0.028     .9115154    .9948255
             HCC17 |   1.357459   .0832035     4.99   0.000     1.203798    1.530734
             HCC18 |   1.199365    .018834    11.58   0.000     1.163014    1.236853
             HCC19 |   1.122907    .014659     8.88   0.000     1.094541    1.152009
             HCC21 |   1.116585   .0376306     3.27   0.001     1.045213     1.19283
             HCC22 |   1.073613   .0297665     2.56   0.010     1.016829    1.133569
             HCC23 |   1.091088   .0211605     4.49   0.000     1.050393    1.133361
             HCC27 |   1.908785   .1004819    12.28   0.000     1.721663    2.116244
             HCC28 |   1.292289   .0682739     4.85   0.000      1.16517    1.433277
             HCC29 |   1.037968   .0862879     0.45   0.654     .8819054    1.221646
             HCC33 |    1.13716   .0308222     4.74   0.000     1.078327    1.199204
             HCC34 |   1.272398   .0983707     3.12   0.002     1.093491    1.480575
             HCC35 |   1.180901   .0567417     3.46   0.001     1.074766    1.297518
             HCC39 |   1.043414   .0412796     1.07   0.283     .9655643     1.12754
             HCC40 |   1.096527   .0195489     5.17   0.000     1.058873    1.135519
             HCC46 |    1.33386   .0591796     6.49   0.000      1.22277    1.455042
             HCC47 |    1.23322   .0382213     6.76   0.000     1.160537    1.310454
             HCC48 |   1.060425   .0203402     3.06   0.002     1.021299     1.10105
             HCC54 |   1.188436   .1042325     1.97   0.049     1.000739    1.411338
             HCC55 |   1.296914   .0845562     3.99   0.000     1.141339    1.473696
             HCC57 |   1.438328   .0759612     6.88   0.000     1.296893    1.595188
             HCC58 |   1.107288   .0282955     3.99   0.000     1.053196    1.164159
             HCC70 |   1.050135   .1035696     0.50   0.620     .8655563    1.274075
             HCC71 |   1.297662   .1288252     2.62   0.009     1.068215    1.576393
             HCC72 |   1.117289   .0556166     2.23   0.026     1.013432    1.231791
             HCC73 |   .8432553   .1564943    -0.92   0.358     .5861249    1.213188
             HCC74 |    1.57097   .1863864     3.81   0.000     1.245024    1.982248
             HCC75 |    1.07686    .037006     2.15   0.031     1.006719    1.151889
             HCC76 |   1.091738   .2353948     0.41   0.684     .7154625    1.665904
             HCC77 |   1.134375   .0891611     1.60   0.109     .9724173    1.323307
             HCC78 |   1.174402   .0334341     5.65   0.000     1.110667    1.241794
             HCC79 |   1.162598   .0323958     5.41   0.000     1.100806    1.227859
             HCC80 |   1.168623   .0893853     2.04   0.042     1.005931    1.357629
             HCC82 |   1.060266   .0688863     0.90   0.368     .9334938    1.204254
             HCC83 |   1.329315   .2161084     1.75   0.080     .9666002    1.828137
             HCC84 |   1.239177   .0242668    10.95   0.000     1.192516    1.287664
             HCC85 |   1.345532   .0168104    23.76   0.000     1.312984    1.378887
             HCC86 |    1.19401   .0348605     6.07   0.000     1.127603    1.264328
             HCC87 |   1.057087   .0273624     2.14   0.032     1.004796      1.1121
             HCC88 |   .9960524     .02816    -0.14   0.889     .9423612    1.052803
             HCC96 |    1.13909   .0138247    10.73   0.000     1.112314    1.166511
             HCC99 |    1.08218    .052425     1.63   0.103     .9841565    1.189967
            HCC100 |   1.087198   .0182021     4.99   0.000     1.052101    1.123465
            HCC103 |   .9931958    .030041    -0.23   0.821     .9360278    1.053855
            HCC104 |   1.012874   .1167135     0.11   0.912     .8081122     1.26952
            HCC106 |   1.332921     .06156     6.22   0.000     1.217565    1.459205
            HCC107 |   1.094627   .0214009     4.62   0.000     1.053475    1.137386
            HCC108 |    1.09923   .0129626     8.02   0.000     1.074115    1.124932
            HCC110 |   1.477822   .5435961     1.06   0.288     .7186538    3.038958
            HCC111 |   1.357923    .015239    27.26   0.000     1.328381    1.388122
            HCC112 |   1.131155   .0392367     3.55   0.000     1.056809    1.210732
            HCC114 |   1.126476    .035895     3.74   0.000     1.058275    1.199072
            HCC115 |   1.104603   .0601939     1.83   0.068     .9927068    1.229111
            HCC122 |   1.156033   .0418036     4.01   0.000     1.076936     1.24094
            HCC124 |   1.027367    .033783     0.82   0.412     .9632419     1.09576
            HCC134 |   1.811567   .0611233    17.61   0.000     1.695643    1.935417
            HCC135 |   1.331113    .024681    15.43   0.000     1.283608    1.380377
            HCC136 |   1.420126   .0621809     8.01   0.000     1.303337     1.54738
            HCC137 |   1.378525   .0497793     8.89   0.000     1.284332    1.479626
            HCC157 |   .9996362   .0995971    -0.00   0.997     .8223069    1.215206
            HCC158 |   .9575754   .0669496    -0.62   0.535     .8349503     1.09821
            HCC161 |   1.131509    .026309     5.31   0.000     1.081102    1.184267
            HCC162 |    .934255   .2883011    -0.22   0.826     .5102626    1.710555
            HCC166 |   1.382248   .3624501     1.23   0.217     .8267717    2.310927
            HCC167 |   .9613495   .0518437    -0.73   0.465     .8649234    1.068526
            HCC169 |   1.142798   .0316457     4.82   0.000     1.082426    1.206536
            HCC170 |   1.017877    .030029     0.60   0.548     .9606906    1.078468
            HCC173 |   1.124028   .0617849     2.13   0.033     1.009227    1.251888
            HCC176 |   1.116407   .0264846     4.64   0.000     1.065686    1.169541
            HCC186 |   1.260209   .0915349     3.18   0.001     1.092989    1.453012
            HCC188 |   1.233702   .0468185     5.53   0.000     1.145269    1.328964
            HCC189 |   1.342361    .091817     4.30   0.000     1.173944    1.534939
                   |
      providertype |
                1  |   .9808598   .0293172    -0.65   0.518     .9250498    1.040037
                2  |   1.038456   .0317341     1.23   0.217     .9780847    1.102554
                   |
            n_pcps |   1.000202   .0000651     3.10   0.002     1.000074    1.000329
            n_spec |   .9999557   .0000222    -2.00   0.046     .9999123    .9999992
     lives_covered |   .9999995   3.90e-07    -1.40   0.163     .9999987           1
             _cons |   .0987576   .0034246   -66.76   0.000     .0922686    .1057029
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -143364.54  
Iteration 1:   log pseudolikelihood = -137820.58  
Iteration 2:   log pseudolikelihood = -137393.46  
Iteration 3:   log pseudolikelihood = -137393.31  
Iteration 4:   log pseudolikelihood = -137393.31  

Logistic regression                             Number of obs     =    320,972
                                                Wald chi2(94)     =   32193.84
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -137393.31               Pseudo R2         =     0.0417

                            (Std. Err. adjusted for 321 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
    any_readm | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |   .9916224   .0167372    -0.50   0.618     .9593547    1.024975
        2015  |   1.018704   .0225337     0.84   0.402     .9754821     1.06384
        2016  |   .9998509   .0201448    -0.01   0.994     .9611372    1.040124
              |
 1.death_year |   1.042562   .0378816     1.15   0.251     .9708975    1.119516
              |
       agegrp |
           1  |   1.025619   .0170729     1.52   0.129     .9926968    1.059633
           2  |   1.149582   .0223051     7.18   0.000     1.106686    1.194141
           3  |   1.278598   .0223243    14.08   0.000     1.235583     1.32311
              |
     1.female |   .9575567   .0111304    -3.73   0.000     .9359881    .9796224
              |
      race_g3 |
           1  |    1.23003   .0291893     8.72   0.000      1.17413    1.288591
           2  |   1.040364   .0303476     1.36   0.175     .9825522    1.101578
              |
         HCC1 |   1.038938   .1163145     0.34   0.733     .8342447    1.293857
         HCC2 |   1.167922   .0250652     7.23   0.000     1.119814    1.218096
         HCC6 |   1.120997    .069104     1.85   0.064      .993418     1.26496
         HCC8 |   1.667693   .0544965    15.65   0.000      1.56423    1.777999
         HCC9 |   1.251975   .0361067     7.79   0.000      1.18317    1.324781
        HCC10 |   1.136845   .0363309     4.01   0.000     1.067822    1.210329
        HCC11 |   1.103208   .0274607     3.95   0.000     1.050678    1.158365
        HCC12 |   .9522598   .0212462    -2.19   0.028     .9115154    .9948255
        HCC17 |   1.357459   .0832035     4.99   0.000     1.203798    1.530734
        HCC18 |   1.199365    .018834    11.58   0.000     1.163014    1.236853
        HCC19 |   1.122907    .014659     8.88   0.000     1.094541    1.152009
        HCC21 |   1.116585   .0376306     3.27   0.001     1.045213     1.19283
        HCC22 |   1.073613   .0297665     2.56   0.010     1.016829    1.133569
        HCC23 |   1.091088   .0211605     4.49   0.000     1.050393    1.133361
        HCC27 |   1.908785   .1004819    12.28   0.000     1.721663    2.116244
        HCC28 |   1.292289   .0682739     4.85   0.000      1.16517    1.433277
        HCC29 |   1.037968   .0862879     0.45   0.654     .8819054    1.221646
        HCC33 |    1.13716   .0308222     4.74   0.000     1.078327    1.199204
        HCC34 |   1.272398   .0983707     3.12   0.002     1.093491    1.480575
        HCC35 |   1.180901   .0567417     3.46   0.001     1.074766    1.297518
        HCC39 |   1.043414   .0412796     1.07   0.283     .9655643     1.12754
        HCC40 |   1.096527   .0195489     5.17   0.000     1.058873    1.135519
        HCC46 |    1.33386   .0591796     6.49   0.000      1.22277    1.455042
        HCC47 |    1.23322   .0382213     6.76   0.000     1.160537    1.310454
        HCC48 |   1.060425   .0203402     3.06   0.002     1.021299     1.10105
        HCC54 |   1.188436   .1042325     1.97   0.049     1.000739    1.411338
        HCC55 |   1.296914   .0845562     3.99   0.000     1.141339    1.473696
        HCC57 |   1.438328   .0759612     6.88   0.000     1.296893    1.595188
        HCC58 |   1.107288   .0282955     3.99   0.000     1.053196    1.164159
        HCC70 |   1.050135   .1035696     0.50   0.620     .8655563    1.274075
        HCC71 |   1.297662   .1288252     2.62   0.009     1.068215    1.576393
        HCC72 |   1.117289   .0556166     2.23   0.026     1.013432    1.231791
        HCC73 |   .8432553   .1564943    -0.92   0.358     .5861249    1.213188
        HCC74 |    1.57097   .1863864     3.81   0.000     1.245024    1.982248
        HCC75 |    1.07686    .037006     2.15   0.031     1.006719    1.151889
        HCC76 |   1.091738   .2353948     0.41   0.684     .7154625    1.665904
        HCC77 |   1.134375   .0891611     1.60   0.109     .9724173    1.323307
        HCC78 |   1.174402   .0334341     5.65   0.000     1.110667    1.241794
        HCC79 |   1.162598   .0323958     5.41   0.000     1.100806    1.227859
        HCC80 |   1.168623   .0893853     2.04   0.042     1.005931    1.357629
        HCC82 |   1.060266   .0688863     0.90   0.368     .9334938    1.204254
        HCC83 |   1.329315   .2161084     1.75   0.080     .9666002    1.828137
        HCC84 |   1.239177   .0242668    10.95   0.000     1.192516    1.287664
        HCC85 |   1.345532   .0168104    23.76   0.000     1.312984    1.378887
        HCC86 |    1.19401   .0348605     6.07   0.000     1.127603    1.264328
        HCC87 |   1.057087   .0273624     2.14   0.032     1.004796      1.1121
        HCC88 |   .9960524     .02816    -0.14   0.889     .9423612    1.052803
        HCC96 |    1.13909   .0138247    10.73   0.000     1.112314    1.166511
        HCC99 |    1.08218    .052425     1.63   0.103     .9841565    1.189967
       HCC100 |   1.087198   .0182021     4.99   0.000     1.052101    1.123465
       HCC103 |   .9931958    .030041    -0.23   0.821     .9360278    1.053855
       HCC104 |   1.012874   .1167135     0.11   0.912     .8081122     1.26952
       HCC106 |   1.332921     .06156     6.22   0.000     1.217565    1.459205
       HCC107 |   1.094627   .0214009     4.62   0.000     1.053475    1.137386
       HCC108 |    1.09923   .0129626     8.02   0.000     1.074115    1.124932
       HCC110 |   1.477822   .5435961     1.06   0.288     .7186538    3.038958
       HCC111 |   1.357923    .015239    27.26   0.000     1.328381    1.388122
       HCC112 |   1.131155   .0392367     3.55   0.000     1.056809    1.210732
       HCC114 |   1.126476    .035895     3.74   0.000     1.058275    1.199072
       HCC115 |   1.104603   .0601939     1.83   0.068     .9927068    1.229111
       HCC122 |   1.156033   .0418036     4.01   0.000     1.076936     1.24094
       HCC124 |   1.027367    .033783     0.82   0.412     .9632419     1.09576
       HCC134 |   1.811567   .0611233    17.61   0.000     1.695643    1.935417
       HCC135 |   1.331113    .024681    15.43   0.000     1.283608    1.380377
       HCC136 |   1.420126   .0621809     8.01   0.000     1.303337     1.54738
       HCC137 |   1.378525   .0497793     8.89   0.000     1.284332    1.479626
       HCC157 |   .9996362   .0995971    -0.00   0.997     .8223069    1.215206
       HCC158 |   .9575754   .0669496    -0.62   0.535     .8349503     1.09821
       HCC161 |   1.131509    .026309     5.31   0.000     1.081102    1.184267
       HCC162 |    .934255   .2883011    -0.22   0.826     .5102626    1.710555
       HCC166 |   1.382248   .3624501     1.23   0.217     .8267717    2.310927
       HCC167 |   .9613495   .0518437    -0.73   0.465     .8649234    1.068526
       HCC169 |   1.142798   .0316457     4.82   0.000     1.082426    1.206536
       HCC170 |   1.017877    .030029     0.60   0.548     .9606906    1.078468
       HCC173 |   1.124028   .0617849     2.13   0.033     1.009227    1.251888
       HCC176 |   1.116407   .0264846     4.64   0.000     1.065686    1.169541
       HCC186 |   1.260209   .0915349     3.18   0.001     1.092989    1.453012
       HCC188 |   1.233702   .0468185     5.53   0.000     1.145269    1.328964
       HCC189 |   1.342361    .091817     4.30   0.000     1.173944    1.534939
              |
 providertype |
           1  |   .9808598   .0293172    -0.65   0.518     .9250498    1.040037
           2  |   1.038456   .0317341     1.23   0.217     .9780847    1.102554
              |
       n_pcps |   1.000202   .0000651     3.10   0.002     1.000074    1.000329
       n_spec |   .9999557   .0000222    -2.00   0.046     .9999123    .9999992
lives_covered |   .9999995   3.90e-07    -1.40   0.163     .9999987           1
        _cons |   .0987576   .0034246   -66.76   0.000     .0922686    .1057029
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    320,972
Model VCE    : Robust

Expression   : Pr(any_readm), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |    .164114   .0015342   106.97   0.000     .1611071    .1671209
          1  |   .1696611    .004695    36.14   0.000      .160459    .1788632
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -136378.92  
Iteration 1:   log pseudolikelihood = -131177.85  
Iteration 2:   log pseudolikelihood = -130776.33  
Iteration 3:   log pseudolikelihood = -130776.18  
Iteration 4:   log pseudolikelihood = -130776.18  

Logistic regression                             Number of obs     =    306,675
                                                Wald chi2(97)     =   32543.98
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -130776.18               Pseudo R2         =     0.0411

                               (Std. Err. adjusted for 306 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
       any_readm | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   .9870902   .0179884    -0.71   0.476     .9524559    1.022984
           2015  |   1.018832   .0246206     0.77   0.440     .9717013    1.068248
           2016  |   1.004571   .0204305     0.22   0.823     .9653153    1.045422
                 |
     aco_exit_gr |
           2014  |   1.029178    .067343     0.44   0.660     .9053015    1.170005
                 |
year#aco_exit_gr |
      2014 2014  |   .9976345   .0509562    -0.05   0.963     .9025985    1.102677
      2015 2014  |   1.015433   .0645324     0.24   0.810     .8965119    1.150129
      2016 2014  |   .9672982   .0546916    -0.59   0.557     .8658308    1.080657
                 |
          agegrp |
              1  |   1.022722   .0173641     1.32   0.186     .9892492    1.057328
              2  |   1.152707   .0232996     7.03   0.000     1.107933     1.19929
              3  |   1.284987   .0227704    14.15   0.000     1.241124      1.3304
                 |
        1.female |   .9567019   .0113967    -3.72   0.000     .9346234    .9793019
                 |
         race_g3 |
              1  |   1.245849   .0303157     9.03   0.000     1.187826    1.306707
              2  |    1.05162   .0329694     1.61   0.108     .9889469    1.118266
                 |
            HCC1 |   1.032599   .1154282     0.29   0.774     .8294321    1.285531
            HCC2 |   1.154083    .026162     6.32   0.000     1.103929    1.206516
            HCC6 |   1.087321   .0671902     1.35   0.175     .9632928    1.227318
            HCC8 |   1.702251    .054024    16.76   0.000     1.599592    1.811498
            HCC9 |   1.253088   .0374642     7.55   0.000     1.181769     1.32871
           HCC10 |   1.118491   .0380101     3.30   0.001     1.046419    1.195527
           HCC11 |   1.120798   .0288698     4.43   0.000     1.065619    1.178834
           HCC12 |   .9459701   .0216537    -2.43   0.015     .9044676    .9893771
           HCC17 |   1.349281   .0867548     4.66   0.000     1.189522    1.530496
           HCC18 |   1.206994   .0193034    11.76   0.000     1.169747    1.245427
           HCC19 |   1.129586   .0152291     9.04   0.000     1.100128    1.159832
           HCC21 |   1.145497   .0389606     3.99   0.000     1.071625    1.224461
           HCC22 |   1.050864   .0297228     1.75   0.079     .9941933    1.110764
           HCC23 |   1.091647   .0221151     4.33   0.000     1.049152    1.135864
           HCC27 |   1.854332   .1033519    11.08   0.000     1.662439    2.068377
           HCC28 |   1.335021   .0734528     5.25   0.000     1.198547    1.487035
           HCC29 |   1.054019   .0871049     0.64   0.524     .8964053    1.239345
           HCC33 |   1.133646   .0310144     4.59   0.000      1.07446    1.196093
           HCC34 |   1.276022   .1053606     2.95   0.003     1.085362    1.500173
           HCC35 |   1.154754   .0567951     2.93   0.003     1.048634    1.271612
           HCC39 |   1.049481   .0424179     1.19   0.232     .9695512       1.136
           HCC40 |   1.107972    .019689     5.77   0.000     1.070047    1.147242
           HCC46 |   1.315997   .0607816     5.95   0.000       1.2021    1.440685
           HCC47 |   1.244651   .0395249     6.89   0.000     1.169546     1.32458
           HCC48 |   1.074845   .0211128     3.67   0.000     1.034251    1.117032
           HCC54 |   1.167315   .1073469     1.68   0.093     .9747903    1.397864
           HCC55 |   1.289902   .0835463     3.93   0.000     1.136122    1.464498
           HCC57 |   1.366614   .0803151     5.31   0.000     1.217927    1.533453
           HCC58 |   1.130443   .0292784     4.73   0.000     1.074491    1.189309
           HCC70 |   .9428382   .0979544    -0.57   0.571      .769136    1.155769
           HCC71 |   1.385298    .146395     3.08   0.002     1.126135    1.704105
           HCC72 |   1.111466   .0572918     2.05   0.040     1.004662    1.229624
           HCC73 |   .8161608   .1571442    -1.06   0.291     .5596091    1.190328
           HCC74 |   1.501313   .1964105     3.11   0.002     1.161748    1.940128
           HCC75 |   1.082954   .0368939     2.34   0.019     1.013005    1.157734
           HCC76 |   1.192066   .2605451     0.80   0.422     .7767059    1.829549
           HCC77 |   1.162044   .0897414     1.94   0.052     .9988182    1.351943
           HCC78 |   1.190191   .0334903     6.19   0.000     1.126328    1.257675
           HCC79 |   1.167575   .0333987     5.42   0.000     1.103916    1.234905
           HCC80 |    1.05232   .0786322     0.68   0.495     .9089579    1.218293
           HCC82 |   1.035569   .0674767     0.54   0.592     .9114141    1.176637
           HCC83 |   1.417542   .2197073     2.25   0.024     1.046181    1.920725
           HCC84 |    1.24875   .0254948    10.88   0.000     1.199768    1.299732
           HCC85 |    1.33635     .01772    21.87   0.000     1.302067    1.371536
           HCC86 |   1.185887   .0358242     5.64   0.000     1.117711    1.258221
           HCC87 |   1.057498   .0274871     2.15   0.031     1.004974    1.112768
           HCC88 |   .9902238    .028852    -0.34   0.736     .9352593    1.048419
           HCC96 |   1.136954   .0143036    10.20   0.000     1.109263    1.165337
           HCC99 |   1.117548   .0556097     2.23   0.026     1.013701    1.232033
          HCC100 |   1.097615   .0203639     5.02   0.000     1.058419    1.138262
          HCC103 |   1.005053   .0319359     0.16   0.874     .9443687    1.069636
          HCC104 |   1.001503    .116432     0.01   0.990     .7974324    1.257797
          HCC106 |   1.307685   .0627427     5.59   0.000     1.190317    1.436626
          HCC107 |   1.093426   .0215742     4.53   0.000     1.051949    1.136539
          HCC108 |   1.092157   .0129065     7.46   0.000     1.067152    1.117748
          HCC110 |   1.396545   .5310596     0.88   0.380     .6627827     2.94265
          HCC111 |   1.352015   .0157826    25.84   0.000     1.321433    1.383305
          HCC112 |   1.131327   .0401516     3.48   0.001     1.055305    1.212824
          HCC114 |    1.10259   .0336715     3.20   0.001     1.038531      1.1706
          HCC115 |   1.082067   .0652905     1.31   0.191     .9613766    1.217908
          HCC122 |   1.162382   .0458833     3.81   0.000     1.075843    1.255882
          HCC124 |    1.03809   .0358573     1.08   0.279     .9701376    1.110803
          HCC134 |   1.809243   .0644511    16.64   0.000      1.68723    1.940079
          HCC135 |   1.331658   .0259007    14.73   0.000     1.281849    1.383403
          HCC136 |   1.399412    .061733     7.62   0.000       1.2835    1.525791
          HCC137 |   1.375371   .0519372     8.44   0.000     1.277252    1.481028
          HCC157 |   1.018019   .1009921     0.18   0.857     .8381332    1.236514
          HCC158 |   .9963165   .0712786    -0.05   0.959     .8659654    1.146289
          HCC161 |   1.134835    .027205     5.28   0.000     1.082747    1.189428
          HCC162 |   1.137009   .3408192     0.43   0.668     .6318526    2.046031
          HCC166 |   1.202765   .3407828     0.65   0.515     .6902518    2.095821
          HCC167 |   .9752265   .0548051    -0.45   0.655     .8735148    1.088782
          HCC169 |   1.130295   .0330066     4.19   0.000      1.06742    1.196874
          HCC170 |   1.023326   .0304672     0.77   0.439     .9653201    1.084817
          HCC173 |   1.120327   .0613798     2.07   0.038     1.006259    1.247326
          HCC176 |   1.110357   .0270683     4.29   0.000     1.058552    1.164698
          HCC186 |   1.323371    .093007     3.99   0.000     1.153078    1.518813
          HCC188 |   1.235897   .0453344     5.77   0.000     1.150162    1.328023
          HCC189 |   1.288974   .0924106     3.54   0.000     1.120002    1.483438
                 |
    providertype |
              1  |   .9836067   .0297962    -0.55   0.585     .9269071    1.043775
              2  |    1.02066   .0323138     0.65   0.518     .9592508       1.086
                 |
          n_pcps |   1.000184   .0000594     3.10   0.002     1.000068    1.000301
          n_spec |   .9999564   .0000194    -2.25   0.024     .9999184    .9999943
   lives_covered |   .9999995   3.98e-07    -1.27   0.203     .9999987           1
           _cons |   .0988683   .0035245   -64.91   0.000     .0921962    .1060232
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    306,675
Model VCE    : Robust

Expression   : Pr(any_readm), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |   .1626848   .0021102    77.09   0.000      .158549    .1668207
           2014  |   .1609737   .0018848    85.41   0.000     .1572795    .1646678
           2015  |    .165279    .002555    64.69   0.000     .1602713    .1702867
           2016  |   .1629754   .0022906    71.15   0.000     .1584858    .1674649
                 |
     aco_exit_gr |
              0  |    .162829   .0016021   101.63   0.000      .159689    .1659691
           2014  |   .1659782   .0053969    30.75   0.000     .1554004     .176556
                 |
year#aco_exit_gr |
      2013    0  |   .1624208   .0021798    74.51   0.000     .1581486    .1666931
      2013 2014  |   .1662049   .0083971    19.79   0.000     .1497469    .1826628
      2014    0  |   .1607335   .0019975    80.47   0.000     .1568184    .1646486
      2014 2014  |   .1641752   .0056248    29.19   0.000     .1531507    .1751997
      2015    0  |   .1648677   .0027103    60.83   0.000     .1595556    .1701798
      2015 2014  |   .1707627    .006585    25.93   0.000     .1578564     .183669
      2016    0  |   .1630163   .0024142    67.52   0.000     .1582845     .167748
      2016 2014  |   .1624302   .0058721    27.66   0.000     .1509211    .1739394
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -143364.54  
Iteration 1:   log pseudolikelihood = -137815.24  
Iteration 2:   log pseudolikelihood = -137387.95  
Iteration 3:   log pseudolikelihood =  -137387.8  
Iteration 4:   log pseudolikelihood =  -137387.8  

Logistic regression                             Number of obs     =    320,972
                                                Wald chi2(97)     =   32280.64
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -137387.8               Pseudo R2         =     0.0417

                               (Std. Err. adjusted for 321 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
       any_readm | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   .9871398    .017992    -0.71   0.478     .9524985    1.023041
           2015  |   1.019226   .0241169     0.80   0.421     .9730373    1.067608
           2016  |   1.004686   .0204283     0.23   0.818     .9654343    1.045533
                 |
     aco_exit_gr |
           2015  |   1.040086   .0474516     0.86   0.389     .9511197    1.137375
                 |
year#aco_exit_gr |
      2014 2015  |   1.034669   .0454202     0.78   0.438     .9493691    1.127633
      2015 2015  |   1.019216   .0450555     0.43   0.667     .9346261    1.111462
      2016 2015  |   1.007316   .0530122     0.14   0.890     .9085933    1.116766
                 |
          agegrp |
              1  |   1.025553   .0170758     1.52   0.130      .992625    1.059573
              2  |   1.149372   .0223128     7.17   0.000     1.106461    1.193947
              3  |   1.278164   .0223135    14.06   0.000      1.23517    1.322654
                 |
        1.female |   .9575021   .0111199    -3.74   0.000     .9359536    .9795466
                 |
         race_g3 |
              1  |   1.229305   .0292669     8.67   0.000     1.173261    1.288027
              2  |   1.041628   .0304981     1.39   0.164     .9835352    1.103151
                 |
            HCC1 |   1.040988   .1167363     0.36   0.720     .8355879    1.296879
            HCC2 |   1.167849   .0250416     7.24   0.000     1.119786    1.217976
            HCC6 |   1.121515    .069129     1.86   0.063     .9938888    1.265529
            HCC8 |   1.667887   .0545266    15.65   0.000     1.564369    1.778255
            HCC9 |   1.252396   .0361211     7.80   0.000     1.183564    1.325231
           HCC10 |   1.136635   .0363259     4.01   0.000     1.067622     1.21011
           HCC11 |   1.103294   .0274198     3.96   0.000      1.05084    1.158366
           HCC12 |   .9526332   .0212453    -2.18   0.030     .9118902    .9951966
           HCC17 |   1.357123   .0831106     4.99   0.000     1.203626    1.530196
           HCC18 |   1.199259   .0188462    11.56   0.000     1.162884    1.236771
           HCC19 |   1.123125   .0147107     8.87   0.000     1.094659     1.15233
           HCC21 |   1.116562   .0376154     3.27   0.001     1.045218    1.192775
           HCC22 |   1.073729   .0298088     2.56   0.010     1.016866    1.133772
           HCC23 |   1.091299    .021138     4.51   0.000     1.050646    1.133525
           HCC27 |    1.90815   .1004339    12.28   0.000     1.721116    2.115509
           HCC28 |   1.292805   .0683858     4.85   0.000     1.165486    1.434033
           HCC29 |   1.039212   .0862823     0.46   0.643     .8831448     1.22286
           HCC33 |   1.137373   .0308137     4.75   0.000     1.078555    1.199399
           HCC34 |    1.27168   .0983437     3.11   0.002     1.092826    1.479804
           HCC35 |   1.181331   .0567292     3.47   0.001     1.075216    1.297919
           HCC39 |   1.043502   .0413357     1.07   0.282     .9655506    1.127746
           HCC40 |   1.097003   .0195146     5.20   0.000     1.059414    1.135925
           HCC46 |   1.333837    .059151     6.50   0.000     1.222799    1.454959
           HCC47 |   1.233433   .0381862     6.78   0.000     1.160815    1.310594
           HCC48 |    1.06065   .0203478     3.07   0.002     1.021509     1.10129
           HCC54 |   1.188368   .1042622     1.97   0.049     1.000622     1.41134
           HCC55 |   1.297727   .0845067     4.00   0.000     1.142231    1.474392
           HCC57 |   1.436818   .0759737     6.85   0.000     1.295369    1.593713
           HCC58 |   1.107004   .0283303     3.97   0.000     1.052847    1.163946
           HCC70 |   1.050678   .1033859     0.50   0.615     .8663878     1.27417
           HCC71 |   1.296029   .1288469     2.61   0.009     1.066574    1.574847
           HCC72 |   1.117012   .0556538     2.22   0.026     1.013089    1.231595
           HCC73 |   .8436089   .1565233    -0.92   0.359     .5864205    1.213593
           HCC74 |    1.57026   .1862158     3.81   0.000     1.244596    1.981139
           HCC75 |    1.07672   .0369747     2.15   0.031     1.006636    1.151684
           HCC76 |   1.093466   .2356455     0.41   0.678     .7167517    1.668177
           HCC77 |   1.135852   .0892976     1.62   0.105     .9736495    1.325076
           HCC78 |   1.174575    .033473     5.65   0.000     1.110768    1.242048
           HCC79 |   1.162311   .0324144     5.39   0.000     1.100485     1.22761
           HCC80 |    1.16906   .0894577     2.04   0.041     1.006241    1.358225
           HCC82 |   1.060231    .068781     0.90   0.367     .9336413    1.203985
           HCC83 |   1.327745   .2157959     1.74   0.081       .96554    1.825824
           HCC84 |    1.23894   .0242976    10.92   0.000     1.192221    1.287489
           HCC85 |   1.345479   .0168272    23.73   0.000       1.3129    1.378868
           HCC86 |   1.193677   .0348532     6.06   0.000     1.127284    1.263981
           HCC87 |   1.056686   .0274017     2.13   0.033     1.004321     1.11178
           HCC88 |   .9963098   .0281705    -0.13   0.896     .9425986    1.053082
           HCC96 |   1.139222    .013809    10.75   0.000     1.112476    1.166611
           HCC99 |   1.082386   .0524181     1.63   0.102     .9843736    1.190157
          HCC100 |   1.086855   .0181628     4.98   0.000     1.051833    1.123042
          HCC103 |   .9937795   .0300409    -0.21   0.836     .9366107    1.054438
          HCC104 |    1.01378   .1166766     0.12   0.905     .8090558    1.270308
          HCC106 |   1.333324    .061583     6.23   0.000     1.217926    1.459657
          HCC107 |     1.0946   .0213904     4.63   0.000     1.053469    1.137338
          HCC108 |   1.099128   .0129279     8.04   0.000      1.07408     1.12476
          HCC110 |    1.47672   .5439485     1.06   0.290     .7173961    3.039747
          HCC111 |   1.357573   .0152575    27.20   0.000     1.327995    1.387808
          HCC112 |   1.130562   .0392009     3.54   0.000     1.056283    1.210065
          HCC114 |   1.126313   .0359089     3.73   0.000     1.058086    1.198938
          HCC115 |   1.104102   .0601661     1.82   0.069     .9922579    1.228553
          HCC122 |   1.155721   .0418116     4.00   0.000     1.076609    1.240645
          HCC124 |   1.027153   .0337944     0.81   0.415      .963008    1.095571
          HCC134 |   1.810565   .0610763    17.60   0.000     1.694729    1.934318
          HCC135 |   1.330969   .0247003    15.41   0.000     1.283427    1.380271
          HCC136 |   1.420374   .0621645     8.02   0.000     1.303614    1.547593
          HCC137 |   1.378011   .0497933     8.87   0.000     1.283793    1.479143
          HCC157 |   1.000059   .0995712     0.00   1.000      .822764    1.215558
          HCC158 |   .9570157   .0669084    -0.63   0.530     .8344657    1.097563
          HCC161 |   1.131263   .0263247     5.30   0.000     1.080826    1.184053
          HCC162 |   .9277156   .2866922    -0.24   0.808     .5062532    1.700051
          HCC166 |   1.380867   .3616499     1.23   0.218     .8264595    2.307183
          HCC167 |   .9607229   .0518535    -0.74   0.458     .8642829    1.067924
          HCC169 |   1.142927   .0316636     4.82   0.000     1.082523    1.206703
          HCC170 |   1.017941   .0300291     0.60   0.547     .9607545    1.078532
          HCC173 |   1.124196   .0617207     2.13   0.033     1.009507    1.251914
          HCC176 |    1.11656    .026518     4.64   0.000     1.065776    1.169762
          HCC186 |   1.261603   .0915653     3.20   0.001     1.094318    1.454459
          HCC188 |   1.233095   .0468866     5.51   0.000     1.144539    1.328502
          HCC189 |   1.342516   .0918428     4.31   0.000     1.174054    1.535151
                 |
    providertype |
              1  |    .980792   .0295505    -0.64   0.520      .924551    1.040454
              2  |    1.03235   .0313742     1.05   0.295     .9726534    1.095711
                 |
          n_pcps |   1.000194     .00006     3.23   0.001     1.000076    1.000312
          n_spec |   .9999591   .0000222    -1.84   0.065     .9999157    1.000003
   lives_covered |   .9999995   3.70e-07    -1.30   0.192     .9999988           1
           _cons |   .0983072   .0034203   -66.67   0.000      .091827    .1052447
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =    320,972
Model VCE    : Robust

Expression   : Pr(any_readm), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |   .1635915   .0020801    78.64   0.000     .1595145    .1676685
           2014  |   .1624213   .0019087    85.09   0.000     .1586802    .1661623
           2015  |    .166396   .0024522    67.86   0.000     .1615897    .1712022
           2016  |   .1643162   .0022105    74.34   0.000     .1599838    .1686487
                 |
     aco_exit_gr |
              0  |   .1634219   .0016169   101.07   0.000     .1602527     .166591
           2015  |   .1707303   .0038624    44.20   0.000     .1631602    .1783004
                 |
year#aco_exit_gr |
      2013    0  |   .1630016   .0022211    73.39   0.000     .1586484    .1673548
      2013 2015  |   .1682013      .0057    29.51   0.000     .1570295    .1793732
      2014    0  |    .161317   .0020365    79.21   0.000     .1573255    .1653086
      2014 2015  |   .1710507   .0051263    33.37   0.000     .1610034    .1810979
      2015    0  |   .1655051   .0026341    62.83   0.000     .1603424    .1706678
      2015 2015  |   .1733608   .0051884    33.41   0.000     .1631917    .1835299
      2016    0  |   .1636134   .0024293    67.35   0.000      .158852    .1683747
      2016 2015  |   .1698095   .0044594    38.08   0.000     .1610694    .1785497
----------------------------------------------------------------------------------
***********************************************************
                    Oct 2019 New Models                    
                All Years of Data ed_visits                
01:03:13 29 Sep 2021
***********************************************************

Iteration 0:   log pseudolikelihood = -1156886.9  
Iteration 1:   log pseudolikelihood = -1073452.8  
Iteration 2:   log pseudolikelihood = -1072847.7  
Iteration 3:   log pseudolikelihood = -1072847.5  
Iteration 4:   log pseudolikelihood = -1072847.5  

Logistic regression                             Number of obs     =  1,857,348
                                                Wald chi2(94)     =  135843.41
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1072847.5               Pseudo R2         =     0.0726

                                 (Std. Err. adjusted for 328 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
         ed_visits | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   1.007627   .0059451     1.29   0.198      .996042    1.019347
             2015  |   1.001816   .0168331     0.11   0.914     .9693613    1.035358
             2016  |   1.018539   .0123394     1.52   0.129     .9946387    1.043013
                   |
1.aco_death_active |   1.085374   .0304267     2.92   0.003     1.027348    1.146678
                   |
            agegrp |
                1  |   1.058234   .0069222     8.65   0.000     1.044753    1.071888
                2  |   1.251656   .0097325    28.87   0.000     1.232726    1.270878
                3  |   1.885992   .0197982    60.44   0.000     1.847585    1.925198
                   |
          1.female |   1.109551   .0058212    19.81   0.000       1.0982    1.121019
                   |
           race_g3 |
                1  |   1.353305   .0226816    18.05   0.000     1.309572    1.398498
                2  |   .8017584   .0473808    -3.74   0.000       .71407    .9002151
                   |
              HCC1 |    1.50093   .0823273     7.40   0.000     1.347942    1.671281
              HCC2 |   1.258999   .0190134    15.25   0.000      1.22228    1.296822
              HCC6 |   1.204421   .0432635     5.18   0.000     1.122542    1.292272
              HCC8 |   1.730505   .0300136    31.62   0.000     1.672668    1.790342
              HCC9 |   1.332521   .0192202    19.90   0.000     1.295378     1.37073
             HCC10 |   1.160188   .0166718    10.34   0.000     1.127968    1.193329
             HCC11 |   1.092459   .0132068     7.31   0.000     1.066878    1.118653
             HCC12 |   .9669609    .007699    -4.22   0.000     .9519882     .982169
             HCC17 |   1.409233   .0542329     8.91   0.000     1.306848    1.519639
             HCC18 |   1.343414   .0112113    35.37   0.000     1.321619    1.365568
             HCC19 |   1.104461   .0085344    12.86   0.000      1.08786    1.121315
             HCC21 |   1.147899   .0258458     6.13   0.000     1.098344     1.19969
             HCC22 |   1.210797   .0167239    13.85   0.000     1.178458    1.244023
             HCC23 |   1.139979   .0158721     9.41   0.000      1.10929    1.171516
             HCC27 |   1.763401   .0623522    16.04   0.000     1.645332    1.889943
             HCC28 |   1.332896   .0389837     9.82   0.000     1.258638    1.411535
             HCC29 |   .9895173   .0516266    -0.20   0.840     .8933327    1.096058
             HCC33 |    1.36602    .020667    20.62   0.000     1.326108    1.407133
             HCC34 |   1.571055    .067908    10.45   0.000      1.44344    1.709953
             HCC35 |   1.228292    .022997    10.98   0.000     1.184035    1.274202
             HCC39 |   1.069366   .0221711     3.23   0.001     1.026782    1.113715
             HCC40 |   1.266738   .0102818    29.13   0.000     1.246746    1.287051
             HCC46 |   1.354363   .0282556    14.54   0.000       1.3001     1.41089
             HCC47 |   1.240876   .0175475    15.26   0.000     1.206956     1.27575
             HCC48 |   1.082931   .0105899     8.15   0.000     1.062373    1.103887
             HCC54 |   1.780069   .0931396    11.02   0.000     1.606567    1.972308
             HCC55 |   1.682643   .0634145    13.81   0.000     1.562832    1.811638
             HCC57 |   1.826861   .0603311    18.25   0.000      1.71236    1.949019
             HCC58 |     1.4965   .0189899    31.77   0.000      1.45974    1.534187
             HCC70 |   1.553888   .1163423     5.89   0.000     1.341803    1.799495
             HCC71 |   1.594726   .0888151     8.38   0.000     1.429816    1.778657
             HCC72 |   1.301258   .0298493    11.48   0.000      1.24405    1.361097
             HCC73 |   1.705155   .1236052     7.36   0.000     1.479316    1.965471
             HCC74 |   1.789387   .1378278     7.55   0.000     1.538652    2.080982
             HCC75 |    1.20728   .0213344    10.66   0.000     1.166181    1.249827
             HCC76 |   1.339349    .129151     3.03   0.002     1.108699    1.617981
             HCC77 |   1.383267   .0426225    10.53   0.000     1.302201     1.46938
             HCC78 |   1.689098   .0265886    33.30   0.000     1.637781    1.742023
             HCC79 |   1.532855   .0188466    34.74   0.000     1.496358    1.570243
             HCC80 |   1.216595   .0474286     5.03   0.000     1.127099    1.313197
             HCC82 |   .9737724   .0485632    -0.53   0.594     .8830941    1.073762
             HCC83 |   1.085471   .1189392     0.75   0.454     .8756868    1.345512
             HCC84 |   1.262816   .0147589    19.97   0.000     1.234218    1.292077
             HCC85 |   1.403316     .01118    42.53   0.000     1.381573      1.4254
             HCC86 |   1.404725   .0256735    18.59   0.000     1.355296    1.455956
             HCC87 |   1.357012   .0186423    22.22   0.000     1.320962    1.394047
             HCC88 |   1.272979   .0193559    15.87   0.000     1.235601    1.311486
             HCC96 |   1.371668   .0078221    55.42   0.000     1.356423    1.387085
             HCC99 |   1.168477   .0292273     6.22   0.000     1.112574    1.227189
            HCC100 |   1.375727   .0147824    29.69   0.000     1.347058    1.405008
            HCC103 |   1.305772   .0241788    14.41   0.000     1.259232    1.354032
            HCC104 |   1.167031   .0594618     3.03   0.002     1.056119    1.289592
            HCC106 |   1.418188    .035622    13.91   0.000      1.35006    1.489753
            HCC107 |   1.321256   .0169374    21.73   0.000     1.288473    1.354873
            HCC108 |   1.204698   .0098614    22.75   0.000     1.185524    1.224182
            HCC110 |    .919867   .1423326    -0.54   0.589     .6792305    1.245756
            HCC111 |   1.604124   .0145779    52.00   0.000     1.575805    1.632952
            HCC112 |   1.260844   .0183505    15.93   0.000     1.225386    1.297328
            HCC114 |   1.163309   .0237944     7.40   0.000     1.117595    1.210892
            HCC115 |   1.172122   .0363217     5.13   0.000     1.103052    1.245517
            HCC122 |   1.171302   .0267652     6.92   0.000         1.12    1.224953
            HCC124 |   1.111834   .0135483     8.70   0.000     1.085595    1.138708
            HCC134 |   2.601661   .0744269    33.42   0.000     2.459801    2.751702
            HCC135 |   1.398231   .0147444    31.79   0.000     1.369629     1.42743
            HCC136 |   1.393177   .0435085    10.62   0.000      1.31046    1.481116
            HCC137 |   1.486288   .0284023    20.74   0.000      1.43165    1.543011
            HCC157 |   1.147814   .0863432     1.83   0.067     .9904686    1.330155
            HCC158 |   1.185525   .0570839     3.53   0.000      1.07876    1.302857
            HCC161 |   1.312206   .0161242    22.11   0.000      1.28098    1.344192
            HCC162 |   1.266961   .2240519     1.34   0.181     .8958498    1.791808
            HCC166 |   1.270983   .1418885     2.15   0.032     1.021208     1.58185
            HCC167 |   1.274642    .033304     9.29   0.000     1.211011    1.341617
            HCC169 |   1.434159   .0190058    27.21   0.000     1.397388    1.471898
            HCC170 |    1.20087   .0213765    10.28   0.000     1.159695    1.243506
            HCC173 |   1.101292   .0412243     2.58   0.010     1.023387    1.185128
            HCC176 |   1.293687   .0204928    16.26   0.000     1.254139    1.334482
            HCC186 |   1.201795   .0462731     4.77   0.000     1.114439    1.295999
            HCC188 |   1.393321   .0316099    14.62   0.000     1.332724    1.456674
            HCC189 |    1.34364   .0428877     9.25   0.000     1.262157    1.430383
                   |
      providertype |
                1  |   .9516184   .0286183    -1.65   0.099     .8971486    1.009395
                2  |   .8781699   .0256454    -4.45   0.000     .8293173    .9299002
                   |
            n_pcps |   1.000079   .0000933     0.84   0.398      .999896    1.000262
            n_spec |   1.000006   .0000285     0.21   0.831     .9999502    1.000062
     lives_covered |    .999999   4.44e-07    -2.15   0.031     .9999982    .9999999
             _cons |   .2154474   .0054031   -61.21   0.000     .2051135    .2263019
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -1156886.9  
Iteration 1:   log pseudolikelihood = -1073449.4  
Iteration 2:   log pseudolikelihood = -1072844.2  
Iteration 3:   log pseudolikelihood =   -1072844  
Iteration 4:   log pseudolikelihood =   -1072844  

Logistic regression                             Number of obs     =  1,857,348
                                                Wald chi2(95)     =  142466.85
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =   -1072844               Pseudo R2         =     0.0726

                            (Std. Err. adjusted for 328 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
    ed_visits | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |   1.007795   .0059699     1.31   0.190     .9961616    1.019564
        2015  |   .9984442   .0178168    -0.09   0.930     .9641275    1.033982
        2016  |   1.020137   .0122666     1.66   0.097     .9963757    1.044464
              |
   death_year |
           1  |   1.112586   .0371999     3.19   0.001     1.042013    1.187938
           2  |   1.058334   .0281997     2.13   0.033     1.004482    1.115073
              |
       agegrp |
           1  |   1.058341   .0069272     8.66   0.000      1.04485    1.072005
           2  |   1.251791   .0097231    28.91   0.000     1.232878    1.270993
           3  |   1.886229   .0197883    60.49   0.000     1.847841    1.925415
              |
     1.female |   1.109548   .0058212    19.81   0.000     1.098197    1.121016
              |
      race_g3 |
           1  |   1.353264   .0226448    18.08   0.000     1.309601    1.398383
           2  |   .8016323   .0473805    -3.74   0.000     .7139453    .9000891
              |
         HCC1 |   1.500749   .0823274     7.40   0.000     1.347762    1.671101
         HCC2 |   1.258964   .0190088    15.25   0.000     1.222253    1.296777
         HCC6 |   1.204478   .0432763     5.18   0.000     1.122576    1.292356
         HCC8 |   1.730498   .0300077    31.63   0.000     1.672672    1.790323
         HCC9 |   1.332524     .01922    19.90   0.000     1.295381    1.370732
        HCC10 |   1.160208   .0166709    10.34   0.000      1.12799    1.193347
        HCC11 |   1.092446    .013206     7.31   0.000     1.066867    1.118638
        HCC12 |     .96696   .0076991    -4.22   0.000     .9519872    .9821684
        HCC17 |   1.409167   .0542294     8.91   0.000     1.306789    1.519566
        HCC18 |   1.343408    .011214    35.37   0.000     1.321608    1.365568
        HCC19 |   1.104473   .0085329    12.86   0.000     1.087875    1.121324
        HCC21 |   1.147938    .025841     6.13   0.000     1.098392     1.19972
        HCC22 |   1.210786   .0167238    13.85   0.000     1.178447    1.244012
        HCC23 |   1.139967   .0158701     9.41   0.000     1.109283      1.1715
        HCC27 |   1.763404   .0623523    16.04   0.000     1.645335    1.889947
        HCC28 |   1.332928   .0389811     9.83   0.000     1.258675    1.411561
        HCC29 |   .9894699   .0516147    -0.20   0.839     .8933066    1.095985
        HCC33 |   1.365946   .0206715    20.61   0.000     1.326025    1.407068
        HCC34 |   1.570956   .0679309    10.45   0.000       1.4433    1.709903
        HCC35 |   1.228295   .0229963    10.98   0.000      1.18404    1.274204
        HCC39 |   1.069326   .0221705     3.23   0.001     1.026744    1.113675
        HCC40 |   1.266739   .0102845    29.12   0.000     1.246741    1.287057
        HCC46 |   1.354337   .0282563    14.54   0.000     1.300072    1.410866
        HCC47 |   1.240805   .0175478    15.26   0.000     1.206884    1.275679
        HCC48 |   1.082941   .0105794     8.16   0.000     1.062403    1.103876
        HCC54 |   1.780238   .0931174    11.03   0.000     1.606775    1.972428
        HCC55 |   1.683579   .0635315    13.80   0.000     1.563553    1.812819
        HCC57 |   1.826777   .0603339    18.24   0.000     1.712271    1.948941
        HCC58 |    1.49639   .0190071    31.73   0.000     1.459597    1.534111
        HCC70 |   1.554158   .1163526     5.89   0.000     1.342053    1.799785
        HCC71 |   1.594624   .0887881     8.38   0.000     1.429762    1.778496
        HCC72 |   1.301291   .0298536    11.48   0.000     1.244075    1.361138
        HCC73 |   1.705108    .123608     7.36   0.000     1.479265    1.965432
        HCC74 |   1.789554   .1378272     7.56   0.000     1.538818    2.081145
        HCC75 |   1.207282   .0213417    10.66   0.000     1.166169    1.249844
        HCC76 |   1.339557    .129154     3.03   0.002       1.1089    1.618193
        HCC77 |   1.383324   .0426309    10.53   0.000     1.302242    1.469454
        HCC78 |    1.68905   .0265905    33.30   0.000      1.63773    1.741979
        HCC79 |   1.532894   .0188514    34.73   0.000     1.496388    1.570291
        HCC80 |    1.21673    .047435     5.03   0.000     1.127222    1.313345
        HCC82 |   .9736686   .0485629    -0.54   0.593     .8829913    1.073658
        HCC83 |   1.085996   .1189098     0.75   0.451     .8762476    1.345952
        HCC84 |   1.262841   .0147583    19.97   0.000     1.234244      1.2921
        HCC85 |   1.403297   .0111796    42.53   0.000     1.381556    1.425381
        HCC86 |   1.404629   .0256825    18.58   0.000     1.355183    1.455878
        HCC87 |    1.35692   .0186358    22.22   0.000     1.320882    1.393942
        HCC88 |   1.272924   .0193551    15.87   0.000     1.235548     1.31143
        HCC96 |   1.371671   .0078216    55.42   0.000     1.356426    1.387087
        HCC99 |   1.168423   .0292248     6.22   0.000     1.112525     1.22713
       HCC100 |   1.375689   .0147779    29.69   0.000     1.347027     1.40496
       HCC103 |   1.305788    .024177    14.41   0.000     1.259252    1.354045
       HCC104 |   1.166919   .0594377     3.03   0.002     1.056049    1.289428
       HCC106 |   1.418229    .035622    13.91   0.000     1.350102    1.489794
       HCC107 |   1.321253   .0169369    21.73   0.000      1.28847    1.354869
       HCC108 |   1.204698   .0098622    22.75   0.000     1.185522    1.224183
       HCC110 |   .9201452   .1423787    -0.54   0.591     .6794315    1.246141
       HCC111 |    1.60412   .0145808    51.99   0.000     1.575795    1.632954
       HCC112 |   1.260826   .0183423    15.93   0.000     1.225384    1.297294
       HCC114 |   1.163265   .0237871     7.40   0.000     1.117565    1.210834
       HCC115 |    1.17216   .0363099     5.13   0.000     1.103112    1.245531
       HCC122 |   1.171324   .0267665     6.92   0.000      1.12002    1.224978
       HCC124 |   1.111835   .0135495     8.70   0.000     1.085593    1.138711
       HCC134 |   2.601665   .0744292    33.42   0.000     2.459801     2.75171
       HCC135 |   1.398242   .0147439    31.79   0.000     1.369641    1.427441
       HCC136 |   1.393122   .0435092    10.62   0.000     1.310403    1.481063
       HCC137 |   1.486253   .0284027    20.74   0.000     1.431615    1.542977
       HCC157 |   1.147678   .0863403     1.83   0.067      .990339    1.330015
       HCC158 |   1.185661   .0570723     3.54   0.000     1.078915    1.302967
       HCC161 |   1.312239   .0161249    22.11   0.000     1.281012    1.344227
       HCC162 |   1.266421   .2239295     1.34   0.182     .8955052     1.79097
       HCC166 |   1.270689   .1418229     2.15   0.032     1.021023    1.581403
       HCC167 |   1.274608   .0333073     9.29   0.000     1.210971     1.34159
       HCC169 |   1.434175   .0190053    27.21   0.000     1.397405    1.471913
       HCC170 |   1.200798   .0213704    10.28   0.000     1.159635    1.243423
       HCC173 |   1.101138   .0412145     2.57   0.010     1.023251    1.184953
       HCC176 |   1.293691   .0204955    16.25   0.000     1.254138    1.334492
       HCC186 |   1.201732   .0462917     4.77   0.000     1.114342    1.295975
       HCC188 |    1.39342   .0316098    14.62   0.000     1.332823    1.456772
       HCC189 |   1.343503   .0428502     9.26   0.000      1.26209    1.430169
              |
 providertype |
           1  |   .9515178   .0285765    -1.65   0.098     .8971254    1.009208
           2  |    .878164   .0256329    -4.45   0.000     .8293345    .9298685
              |
       n_pcps |   1.000082   .0000937     0.88   0.379     .9998989    1.000266
       n_spec |   1.000006   .0000285     0.21   0.835     .9999501    1.000062
lives_covered |    .999999   4.63e-07    -2.18   0.030     .9999981    .9999999
        _cons |   .2155963   .0054172   -61.06   0.000      .205236    .2264795
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =  1,857,348
Model VCE    : Robust

Expression   : Pr(ed_visits), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .3142337   .0022698   138.44   0.000     .3097851    .3186824
          1  |   .3354548   .0064062    52.36   0.000     .3228988    .3480108
          2  |   .3254211   .0047975    67.83   0.000     .3160182     .334824
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1215093.6  
Iteration 1:   log pseudolikelihood = -1127015.1  
Iteration 2:   log pseudolikelihood = -1126384.8  
Iteration 3:   log pseudolikelihood = -1126384.6  
Iteration 4:   log pseudolikelihood = -1126384.6  

Logistic regression                             Number of obs     =  1,948,146
                                                Wald chi2(94)     =  115199.62
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1126384.6               Pseudo R2         =     0.0730

                                 (Std. Err. adjusted for 341 clusters in cluster_id)
------------------------------------------------------------------------------------
                   |               Robust
         ed_visits | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              year |
             2014  |   1.007764   .0059211     1.32   0.188      .996225    1.019436
             2015  |   1.008213   .0167166     0.49   0.622     .9759755    1.041515
             2016  |   1.019375   .0120629     1.62   0.105     .9960046    1.043295
                   |
1.aco_death_active |   1.011982   .0321799     0.37   0.708     .9508363    1.077061
                   |
            agegrp |
                1  |    1.06094   .0065481     9.58   0.000     1.048184    1.073852
                2  |   1.253153   .0094815    29.83   0.000     1.234707    1.271875
                3  |   1.898106   .0193848    62.75   0.000      1.86049    1.936483
                   |
          1.female |   1.107561   .0056897    19.89   0.000     1.096465    1.118769
                   |
           race_g3 |
                1  |    1.35135   .0214814    18.94   0.000     1.309897    1.394116
                2  |   .8042843   .0464685    -3.77   0.000     .7181752     .900718
                   |
              HCC1 |   1.499735   .0787892     7.71   0.000     1.352995    1.662389
              HCC2 |   1.258679   .0187942    15.41   0.000     1.222376    1.296059
              HCC6 |   1.206638   .0429001     5.28   0.000     1.125418     1.29372
              HCC8 |   1.715055   .0291366    31.75   0.000     1.658889    1.773123
              HCC9 |   1.341164   .0187885    20.95   0.000     1.304841    1.378499
             HCC10 |   1.160476   .0158637    10.89   0.000     1.129796    1.191989
             HCC11 |     1.0874   .0126047     7.23   0.000     1.062973    1.112387
             HCC12 |   .9624778   .0075417    -4.88   0.000     .9478092    .9773734
             HCC17 |   1.422132   .0535249     9.36   0.000     1.321002    1.531006
             HCC18 |   1.342045   .0111146    35.52   0.000     1.320437    1.364007
             HCC19 |   1.099526   .0084517    12.34   0.000     1.083085    1.116216
             HCC21 |    1.13837   .0253454     5.82   0.000     1.089762    1.189146
             HCC22 |   1.215559   .0167345    14.18   0.000     1.183199    1.248805
             HCC23 |   1.135414    .015445     9.34   0.000     1.105542    1.166092
             HCC27 |   1.723152   .0618119    15.17   0.000     1.606164    1.848661
             HCC28 |    1.33735    .038178    10.18   0.000     1.264577     1.41431
             HCC29 |   .9854057   .0510769    -0.28   0.777      .890214    1.090776
             HCC33 |   1.375713   .0204227    21.49   0.000     1.336262    1.416328
             HCC34 |   1.580929   .0678379    10.67   0.000     1.453407     1.71964
             HCC35 |   1.214872   .0222418    10.63   0.000     1.172051    1.259257
             HCC39 |   1.068472   .0216898     3.26   0.001     1.026795     1.11184
             HCC40 |   1.265476   .0105164    28.33   0.000     1.245031    1.286256
             HCC46 |   1.373675   .0277097    15.74   0.000     1.320425    1.429073
             HCC47 |   1.242645   .0167878    16.08   0.000     1.210173    1.275988
             HCC48 |   1.082392    .010138     8.45   0.000     1.062703    1.102445
             HCC54 |   1.700539   .0877353    10.29   0.000     1.536989    1.881492
             HCC55 |   1.617272   .0601149    12.93   0.000     1.503639    1.739493
             HCC57 |   1.818338   .0555771    19.56   0.000     1.712607    1.930596
             HCC58 |    1.49851   .0183574    33.02   0.000     1.462959    1.534925
             HCC70 |   1.545617   .1127898     5.97   0.000     1.339635    1.783272
             HCC71 |   1.507561   .0844973     7.32   0.000     1.350722    1.682611
             HCC72 |   1.292853   .0287432    11.55   0.000     1.237727    1.350434
             HCC73 |   1.753201   .1235245     7.97   0.000      1.52707    2.012818
             HCC74 |   1.765079   .1300535     7.71   0.000     1.527729    2.039304
             HCC75 |    1.20303   .0208925    10.64   0.000     1.162771    1.244683
             HCC76 |    1.26836   .1259999     2.39   0.017     1.043959    1.540996
             HCC77 |   1.381341   .0417522    10.69   0.000     1.301885    1.465646
             HCC78 |   1.685549   .0253957    34.65   0.000     1.636502    1.736066
             HCC79 |   1.511358   .0180728    34.54   0.000     1.476348    1.547199
             HCC80 |   1.202044   .0457852     4.83   0.000     1.115574    1.295216
             HCC82 |   .9632424   .0470938    -0.77   0.444     .8752248    1.060112
             HCC83 |   1.092381    .123159     0.78   0.433     .8758034    1.362516
             HCC84 |    1.26378   .0142751    20.73   0.000     1.236108     1.29207
             HCC85 |   1.402386   .0112067    42.32   0.000     1.380592    1.424523
             HCC86 |   1.391587   .0249505    18.43   0.000     1.343534    1.441358
             HCC87 |   1.357222   .0183925    22.54   0.000     1.321648    1.393753
             HCC88 |   1.269846   .0208126    14.58   0.000     1.229703    1.311301
             HCC96 |   1.369781   .0075011    57.46   0.000     1.355158    1.384562
             HCC99 |   1.181526   .0295673     6.67   0.000     1.124973    1.240921
            HCC100 |    1.37305   .0144171    30.19   0.000     1.345082      1.4016
            HCC103 |   1.297995   .0244311    13.86   0.000     1.250984    1.346774
            HCC104 |    1.11099   .0527994     2.21   0.027     1.012178    1.219448
            HCC106 |    1.42261   .0349573    14.34   0.000     1.355719    1.492802
            HCC107 |   1.332242      .0161    23.74   0.000     1.301058    1.364175
            HCC108 |   1.206034   .0097008    23.29   0.000      1.18717    1.225198
            HCC110 |   .9129228   .1402214    -0.59   0.553     .6756049    1.233603
            HCC111 |   1.599581   .0142995    52.55   0.000     1.571798    1.627854
            HCC112 |   1.265452   .0182885    16.29   0.000      1.23011    1.301809
            HCC114 |    1.16812   .0237504     7.64   0.000     1.122485     1.21561
            HCC115 |   1.173532   .0360741     5.21   0.000     1.104916    1.246409
            HCC122 |   1.197223   .0260456     8.27   0.000     1.147248    1.249376
            HCC124 |   1.108836    .012656     9.05   0.000     1.084306     1.13392
            HCC134 |   2.631526   .0729442    34.91   0.000     2.492372    2.778449
            HCC135 |   1.397343    .015099    30.96   0.000     1.368061    1.427252
            HCC136 |   1.360511   .0420884     9.95   0.000      1.28047    1.445555
            HCC137 |   1.484907    .027433    21.40   0.000     1.432101     1.53966
            HCC157 |    1.14835   .0854663     1.86   0.063     .9924832    1.328694
            HCC158 |   1.157033   .0530211     3.18   0.001     1.057644    1.265763
            HCC161 |    1.31005   .0154318    22.93   0.000     1.280151    1.340648
            HCC162 |   1.040119   .1548528     0.26   0.792     .7768837    1.392546
            HCC166 |   1.156244   .1250512     1.34   0.179     .9353834    1.429254
            HCC167 |   1.253947   .0316752     8.96   0.000     1.193376    1.317592
            HCC169 |    1.42414   .0187408    26.87   0.000     1.387879    1.461349
            HCC170 |    1.19338   .0206397    10.22   0.000     1.153605    1.234526
            HCC173 |   1.067081   .0393159     1.76   0.078     .9927393    1.146989
            HCC176 |   1.295702   .0198461    16.91   0.000     1.257382    1.335189
            HCC186 |   1.222526   .0463138     5.30   0.000     1.135041    1.316755
            HCC188 |   1.434796   .0325227    15.93   0.000     1.372448    1.499976
            HCC189 |   1.345598   .0406217     9.83   0.000      1.26829    1.427617
                   |
      providertype |
                1  |   .9494127   .0275343    -1.79   0.073     .8969515    1.004942
                2  |   .8892771   .0254129    -4.11   0.000     .8408379    .9405067
                   |
            n_pcps |   1.000083   .0000965     0.86   0.391     .9998936    1.000272
            n_spec |   1.000008   .0000286     0.29   0.769     .9999524    1.000064
     lives_covered |    .999999   4.81e-07    -2.09   0.037     .9999981    .9999999
             _cons |   .2149775   .0052215   -63.29   0.000     .2049834    .2254589
------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Iteration 0:   log pseudolikelihood = -1215093.6  
Iteration 1:   log pseudolikelihood = -1127015.1  
Iteration 2:   log pseudolikelihood = -1126384.8  
Iteration 3:   log pseudolikelihood = -1126384.6  
Iteration 4:   log pseudolikelihood = -1126384.6  

Logistic regression                             Number of obs     =  1,948,146
                                                Wald chi2(94)     =  115199.62
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1126384.6               Pseudo R2         =     0.0730

                            (Std. Err. adjusted for 341 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
    ed_visits | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
         year |
        2014  |   1.007764   .0059211     1.32   0.188      .996225    1.019436
        2015  |   1.008213   .0167166     0.49   0.622     .9759755    1.041515
        2016  |   1.019375   .0120629     1.62   0.105     .9960046    1.043295
              |
 1.death_year |   1.011982   .0321799     0.37   0.708     .9508363    1.077061
              |
       agegrp |
           1  |    1.06094   .0065481     9.58   0.000     1.048184    1.073852
           2  |   1.253153   .0094815    29.83   0.000     1.234707    1.271875
           3  |   1.898106   .0193848    62.75   0.000      1.86049    1.936483
              |
     1.female |   1.107561   .0056897    19.89   0.000     1.096465    1.118769
              |
      race_g3 |
           1  |    1.35135   .0214814    18.94   0.000     1.309897    1.394116
           2  |   .8042843   .0464685    -3.77   0.000     .7181752     .900718
              |
         HCC1 |   1.499735   .0787892     7.71   0.000     1.352995    1.662389
         HCC2 |   1.258679   .0187942    15.41   0.000     1.222376    1.296059
         HCC6 |   1.206638   .0429001     5.28   0.000     1.125418     1.29372
         HCC8 |   1.715055   .0291366    31.75   0.000     1.658889    1.773123
         HCC9 |   1.341164   .0187885    20.95   0.000     1.304841    1.378499
        HCC10 |   1.160476   .0158637    10.89   0.000     1.129796    1.191989
        HCC11 |     1.0874   .0126047     7.23   0.000     1.062973    1.112387
        HCC12 |   .9624778   .0075417    -4.88   0.000     .9478092    .9773734
        HCC17 |   1.422132   .0535249     9.36   0.000     1.321002    1.531006
        HCC18 |   1.342045   .0111146    35.52   0.000     1.320437    1.364007
        HCC19 |   1.099526   .0084517    12.34   0.000     1.083085    1.116216
        HCC21 |    1.13837   .0253454     5.82   0.000     1.089762    1.189146
        HCC22 |   1.215559   .0167345    14.18   0.000     1.183199    1.248805
        HCC23 |   1.135414    .015445     9.34   0.000     1.105542    1.166092
        HCC27 |   1.723152   .0618119    15.17   0.000     1.606164    1.848661
        HCC28 |    1.33735    .038178    10.18   0.000     1.264577     1.41431
        HCC29 |   .9854057   .0510769    -0.28   0.777      .890214    1.090776
        HCC33 |   1.375713   .0204227    21.49   0.000     1.336262    1.416328
        HCC34 |   1.580929   .0678379    10.67   0.000     1.453407     1.71964
        HCC35 |   1.214872   .0222418    10.63   0.000     1.172051    1.259257
        HCC39 |   1.068472   .0216898     3.26   0.001     1.026795     1.11184
        HCC40 |   1.265476   .0105164    28.33   0.000     1.245031    1.286256
        HCC46 |   1.373675   .0277097    15.74   0.000     1.320425    1.429073
        HCC47 |   1.242645   .0167878    16.08   0.000     1.210173    1.275988
        HCC48 |   1.082392    .010138     8.45   0.000     1.062703    1.102445
        HCC54 |   1.700539   .0877353    10.29   0.000     1.536989    1.881492
        HCC55 |   1.617272   .0601149    12.93   0.000     1.503639    1.739493
        HCC57 |   1.818338   .0555771    19.56   0.000     1.712607    1.930596
        HCC58 |    1.49851   .0183574    33.02   0.000     1.462959    1.534925
        HCC70 |   1.545617   .1127898     5.97   0.000     1.339635    1.783272
        HCC71 |   1.507561   .0844973     7.32   0.000     1.350722    1.682611
        HCC72 |   1.292853   .0287432    11.55   0.000     1.237727    1.350434
        HCC73 |   1.753201   .1235245     7.97   0.000      1.52707    2.012818
        HCC74 |   1.765079   .1300535     7.71   0.000     1.527729    2.039304
        HCC75 |    1.20303   .0208925    10.64   0.000     1.162771    1.244683
        HCC76 |    1.26836   .1259999     2.39   0.017     1.043959    1.540996
        HCC77 |   1.381341   .0417522    10.69   0.000     1.301885    1.465646
        HCC78 |   1.685549   .0253957    34.65   0.000     1.636502    1.736066
        HCC79 |   1.511358   .0180728    34.54   0.000     1.476348    1.547199
        HCC80 |   1.202044   .0457852     4.83   0.000     1.115574    1.295216
        HCC82 |   .9632424   .0470938    -0.77   0.444     .8752248    1.060112
        HCC83 |   1.092381    .123159     0.78   0.433     .8758034    1.362516
        HCC84 |    1.26378   .0142751    20.73   0.000     1.236108     1.29207
        HCC85 |   1.402386   .0112067    42.32   0.000     1.380592    1.424523
        HCC86 |   1.391587   .0249505    18.43   0.000     1.343534    1.441358
        HCC87 |   1.357222   .0183925    22.54   0.000     1.321648    1.393753
        HCC88 |   1.269846   .0208126    14.58   0.000     1.229703    1.311301
        HCC96 |   1.369781   .0075011    57.46   0.000     1.355158    1.384562
        HCC99 |   1.181526   .0295673     6.67   0.000     1.124973    1.240921
       HCC100 |    1.37305   .0144171    30.19   0.000     1.345082      1.4016
       HCC103 |   1.297995   .0244311    13.86   0.000     1.250984    1.346774
       HCC104 |    1.11099   .0527994     2.21   0.027     1.012178    1.219448
       HCC106 |    1.42261   .0349573    14.34   0.000     1.355719    1.492802
       HCC107 |   1.332242      .0161    23.74   0.000     1.301058    1.364175
       HCC108 |   1.206034   .0097008    23.29   0.000      1.18717    1.225198
       HCC110 |   .9129228   .1402214    -0.59   0.553     .6756049    1.233603
       HCC111 |   1.599581   .0142995    52.55   0.000     1.571798    1.627854
       HCC112 |   1.265452   .0182885    16.29   0.000      1.23011    1.301809
       HCC114 |    1.16812   .0237504     7.64   0.000     1.122485     1.21561
       HCC115 |   1.173532   .0360741     5.21   0.000     1.104916    1.246409
       HCC122 |   1.197223   .0260456     8.27   0.000     1.147248    1.249376
       HCC124 |   1.108836    .012656     9.05   0.000     1.084306     1.13392
       HCC134 |   2.631526   .0729442    34.91   0.000     2.492372    2.778449
       HCC135 |   1.397343    .015099    30.96   0.000     1.368061    1.427252
       HCC136 |   1.360511   .0420884     9.95   0.000      1.28047    1.445555
       HCC137 |   1.484907    .027433    21.40   0.000     1.432101     1.53966
       HCC157 |    1.14835   .0854663     1.86   0.063     .9924832    1.328694
       HCC158 |   1.157033   .0530211     3.18   0.001     1.057644    1.265763
       HCC161 |    1.31005   .0154318    22.93   0.000     1.280151    1.340648
       HCC162 |   1.040119   .1548528     0.26   0.792     .7768837    1.392546
       HCC166 |   1.156244   .1250512     1.34   0.179     .9353834    1.429254
       HCC167 |   1.253947   .0316752     8.96   0.000     1.193376    1.317592
       HCC169 |    1.42414   .0187408    26.87   0.000     1.387879    1.461349
       HCC170 |    1.19338   .0206397    10.22   0.000     1.153605    1.234526
       HCC173 |   1.067081   .0393159     1.76   0.078     .9927393    1.146989
       HCC176 |   1.295702   .0198461    16.91   0.000     1.257382    1.335189
       HCC186 |   1.222526   .0463138     5.30   0.000     1.135041    1.316755
       HCC188 |   1.434796   .0325227    15.93   0.000     1.372448    1.499976
       HCC189 |   1.345598   .0406217     9.83   0.000      1.26829    1.427617
              |
 providertype |
           1  |   .9494127   .0275343    -1.79   0.073     .8969515    1.004942
           2  |   .8892771   .0254129    -4.11   0.000     .8408379    .9405067
              |
       n_pcps |   1.000083   .0000965     0.86   0.391     .9998936    1.000272
       n_spec |   1.000008   .0000286     0.29   0.769     .9999524    1.000064
lives_covered |    .999999   4.81e-07    -2.09   0.037     .9999981    .9999999
        _cons |   .2149775   .0052215   -63.29   0.000     .2049834    .2254589
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =  1,948,146
Model VCE    : Robust

Expression   : Pr(ed_visits), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  death_year |
          0  |   .3158124   .0022174   142.42   0.000     .3114663    .3201585
          1  |   .3181503   .0057718    55.12   0.000     .3068377    .3294629
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1156886.9  
Iteration 1:   log pseudolikelihood = -1073341.9  
Iteration 2:   log pseudolikelihood = -1072733.9  
Iteration 3:   log pseudolikelihood = -1072733.7  
Iteration 4:   log pseudolikelihood = -1072733.7  

Logistic regression                             Number of obs     =  1,857,348
                                                Wald chi2(97)     =  158115.44
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1072733.7               Pseudo R2         =     0.0727

                               (Std. Err. adjusted for 328 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
       ed_visits | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   1.010737    .006268     1.72   0.085     .9985262    1.023097
           2015  |   1.014943    .017474     0.86   0.389     .9812664    1.049776
           2016  |   1.032494   .0118241     2.79   0.005     1.009577     1.05593
                 |
     aco_exit_gr |
           2014  |    1.16974   .0396203     4.63   0.000     1.094607     1.25003
                 |
year#aco_exit_gr |
      2014 2014  |   .9732747   .0168589    -1.56   0.118     .9407864    1.006885
      2015 2014  |   .9515736   .0268083    -1.76   0.078     .9004546    1.005595
      2016 2014  |   .9090518   .0231345    -3.75   0.000     .8648213    .9555444
                 |
          agegrp |
              1  |   1.058488   .0069498     8.66   0.000     1.044954    1.072198
              2  |   1.251902   .0097115    28.96   0.000     1.233012    1.271081
              3  |   1.886797   .0198033    60.49   0.000      1.84838    1.926013
                 |
        1.female |   1.109653   .0058367    19.78   0.000     1.098272    1.121151
                 |
         race_g3 |
              1  |   1.353851   .0225636    18.18   0.000     1.310341    1.398805
              2  |   .8028686   .0467225    -3.77   0.000     .7163236    .8998698
                 |
            HCC1 |    1.50231   .0827482     7.39   0.000     1.348574    1.673572
            HCC2 |   1.258477   .0189689    15.25   0.000     1.221843     1.29621
            HCC6 |   1.204642   .0432106     5.19   0.000     1.122859    1.292381
            HCC8 |    1.73128   .0300895    31.58   0.000     1.673298     1.79127
            HCC9 |   1.333026   .0192394    19.92   0.000     1.295846    1.371273
           HCC10 |   1.160335   .0166469    10.37   0.000     1.128162    1.193425
           HCC11 |   1.092779   .0132063     7.34   0.000     1.067199    1.118972
           HCC12 |   .9673176   .0077098    -4.17   0.000     .9523241    .9825473
           HCC17 |   1.410091   .0542884     8.93   0.000     1.307603    1.520612
           HCC18 |   1.343562   .0112233    35.35   0.000     1.321744     1.36574
           HCC19 |   1.104578   .0085135    12.90   0.000     1.088017    1.121391
           HCC21 |   1.147296   .0257751     6.12   0.000     1.097873    1.198943
           HCC22 |   1.211488   .0167478    13.88   0.000     1.179104    1.244762
           HCC23 |   1.140464   .0158271     9.47   0.000     1.109861     1.17191
           HCC27 |   1.763161   .0622875    16.05   0.000      1.64521    1.889568
           HCC28 |   1.332868   .0389689     9.83   0.000     1.258638    1.411477
           HCC29 |   .9902517    .051145    -0.19   0.850     .8949161    1.095743
           HCC33 |   1.366204   .0206688    20.63   0.000     1.326288     1.40732
           HCC34 |   1.572176   .0679815    10.46   0.000     1.444424    1.711226
           HCC35 |   1.229076   .0230249    11.01   0.000     1.184767    1.275043
           HCC39 |   1.069638   .0221387     3.25   0.001     1.027115    1.113921
           HCC40 |   1.266731   .0103532    28.93   0.000       1.2466    1.287186
           HCC46 |    1.35545   .0282842    14.57   0.000     1.301132    1.412035
           HCC47 |   1.240945    .017537    15.28   0.000     1.207045    1.275798
           HCC48 |   1.083596   .0104367     8.34   0.000     1.063332    1.104246
           HCC54 |   1.780932   .0931403    11.04   0.000     1.607425    1.973168
           HCC55 |   1.685538   .0636142    13.83   0.000     1.565356    1.814947
           HCC57 |   1.826537    .060365    18.23   0.000     1.711974    1.948766
           HCC58 |   1.496727   .0189834    31.80   0.000     1.459979      1.5344
           HCC70 |   1.554647   .1165582     5.89   0.000     1.342189    1.800735
           HCC71 |   1.593897   .0885092     8.40   0.000     1.429529    1.777164
           HCC72 |   1.301444   .0298666    11.48   0.000     1.244204    1.361318
           HCC73 |   1.705154   .1236465     7.36   0.000     1.479245    1.965563
           HCC74 |   1.792061   .1378768     7.58   0.000     1.541216    2.083734
           HCC75 |   1.207657   .0213816    10.66   0.000     1.166469      1.2503
           HCC76 |   1.338544   .1288628     3.03   0.002     1.108375    1.616511
           HCC77 |   1.383257   .0425935    10.54   0.000     1.302245     1.46931
           HCC78 |   1.689457   .0266772    33.21   0.000     1.637971    1.742561
           HCC79 |    1.53279   .0188563    34.72   0.000     1.496274    1.570197
           HCC80 |   1.217733   .0474536     5.06   0.000     1.128189    1.314384
           HCC82 |   .9740163   .0486113    -0.53   0.598     .8832514    1.074108
           HCC83 |   1.083855   .1189672     0.73   0.463     .8740594    1.344008
           HCC84 |   1.261747   .0147754    19.85   0.000     1.233117    1.291041
           HCC85 |   1.403637   .0111908    42.53   0.000     1.381874    1.425743
           HCC86 |    1.40366   .0256643    18.55   0.000     1.354249    1.454873
           HCC87 |   1.356816   .0186847    22.16   0.000     1.320685    1.393936
           HCC88 |   1.272997   .0193733    15.86   0.000     1.235587     1.31154
           HCC96 |   1.371909   .0078147    55.51   0.000     1.356678    1.387312
           HCC99 |   1.168784   .0292577     6.23   0.000     1.112824    1.227558
          HCC100 |   1.374912   .0147677    29.64   0.000      1.34627    1.404163
          HCC103 |    1.30582   .0241799    14.41   0.000     1.259279    1.354083
          HCC104 |   1.167916   .0594917     3.05   0.002     1.056946    1.290537
          HCC106 |   1.418066    .035683    13.88   0.000     1.349826    1.489757
          HCC107 |    1.32109   .0170193    21.61   0.000     1.288151    1.354872
          HCC108 |   1.205444   .0097839    23.02   0.000     1.186419    1.224773
          HCC110 |   .9184218   .1420999    -0.55   0.582     .6781765    1.243775
          HCC111 |   1.603769   .0146137    51.84   0.000     1.575381    1.632669
          HCC112 |   1.261276   .0183783    15.93   0.000     1.225764    1.297816
          HCC114 |   1.162445   .0237668     7.36   0.000     1.116784    1.209973
          HCC115 |   1.171738   .0363394     5.11   0.000     1.102636    1.245171
          HCC122 |    1.17159   .0267775     6.93   0.000     1.120266    1.225266
          HCC124 |   1.111935   .0134924     8.74   0.000     1.085803    1.138697
          HCC134 |   2.601809   .0743633    33.46   0.000     2.460067    2.751719
          HCC135 |   1.397785   .0147254    31.79   0.000      1.36922    1.426946
          HCC136 |   1.392754   .0434107    10.63   0.000     1.310217     1.48049
          HCC137 |   1.485829   .0284167    20.70   0.000     1.431164    1.542581
          HCC157 |   1.148192   .0862474     1.84   0.066     .9910048    1.330311
          HCC158 |    1.18605   .0571393     3.54   0.000     1.079184    1.303499
          HCC161 |   1.312786   .0161498    22.12   0.000     1.281512    1.344824
          HCC162 |   1.264762   .2237005     1.33   0.184     .8942432    1.788802
          HCC166 |   1.274135   .1422623     2.17   0.030     1.023706    1.585826
          HCC167 |   1.274747     .03329     9.30   0.000     1.211141    1.341693
          HCC169 |    1.43401   .0190138    27.19   0.000     1.397223    1.471764
          HCC170 |   1.200722   .0213724    10.28   0.000     1.159555     1.24335
          HCC173 |   1.100508   .0412609     2.55   0.011     1.022538    1.184423
          HCC176 |   1.293817   .0205132    16.25   0.000      1.25423    1.334653
          HCC186 |    1.20171   .0463844     4.76   0.000     1.114152    1.296149
          HCC188 |   1.394216   .0316379    14.65   0.000     1.333566    1.457625
          HCC189 |   1.342377   .0427143     9.25   0.000     1.261216    1.428761
                 |
    providertype |
              1  |   .9521743    .028622    -1.63   0.103     .8976968    1.009958
              2  |    .872339   .0254302    -4.69   0.000     .8238939    .9236327
                 |
          n_pcps |   1.000069   .0000914     0.76   0.448     .9998903    1.000249
          n_spec |    1.00001   .0000282     0.36   0.718      .999955    1.000065
   lives_covered |   .9999991   4.53e-07    -1.94   0.053     .9999982           1
           _cons |   .2126143   .0053127   -61.96   0.000     .2024525    .2232862
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =  1,857,348
Model VCE    : Robust

Expression   : Pr(ed_visits), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |   .3123608   .0027156   115.02   0.000     .3070383    .3176833
           2014  |   .3140854   .0026018   120.72   0.000      .308986    .3191847
           2015  |   .3146001   .0027774   113.27   0.000     .3091566    .3200437
           2016  |    .317363   .0026318   120.59   0.000     .3122046    .3225213
                 |
     aco_exit_gr |
              0  |   .3133068   .0023288   134.54   0.000     .3087425    .3178711
           2014  |   .3353673   .0052168    64.29   0.000     .3251427     .345592
                 |
year#aco_exit_gr |
      2013    0  |    .310329   .0028732   108.01   0.000     .3046976    .3159604
      2013 2014  |    .341558   .0062058    55.04   0.000     .3293949     .353721
      2014    0  |   .3124061   .0027419   113.94   0.000      .307032    .3177802
      2014 2014  |   .3382177   .0067827    49.86   0.000     .3249239    .3515115
      2015    0  |   .3132159   .0030168   103.83   0.000     .3073032    .3191287
      2015 2014  |   .3344924   .0054274    61.63   0.000     .3238549    .3451299
      2016    0  |   .3165708   .0027904   113.45   0.000     .3111018    .3220398
      2016 2014  |   .3287477    .004746    69.27   0.000     .3194456    .3380497
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1215093.6  
Iteration 1:   log pseudolikelihood = -1126870.6  
Iteration 2:   log pseudolikelihood =   -1126237  
Iteration 3:   log pseudolikelihood = -1126236.8  
Iteration 4:   log pseudolikelihood = -1126236.8  

Logistic regression                             Number of obs     =  1,948,146
                                                Wald chi2(97)     =  116924.18
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1126236.8               Pseudo R2         =     0.0731

                               (Std. Err. adjusted for 341 clusters in cluster_id)
----------------------------------------------------------------------------------
                 |               Robust
       ed_visits | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2014  |   1.010996   .0063354     1.75   0.081      .998655     1.02349
           2015  |    1.01366   .0170598     0.81   0.420     .9807692    1.047654
           2016  |   1.033842   .0117202     2.94   0.003     1.011124     1.05707
                 |
     aco_exit_gr |
           2015  |   1.121859    .032522     3.97   0.000     1.059894    1.187446
                 |
year#aco_exit_gr |
      2014 2015  |   .9731673   .0129144    -2.05   0.040     .9481819    .9988111
      2015 2015  |   .9939329   .0183348    -0.33   0.741     .9586392    1.030526
      2016 2015  |   .9092023   .0261893    -3.30   0.001     .8592943    .9620089
                 |
          agegrp |
              1  |   1.060877   .0065565     9.56   0.000     1.048104    1.073806
              2  |   1.252964   .0094781    29.81   0.000     1.234525    1.271679
              3  |   1.897559   .0194332    62.55   0.000      1.85985    1.936032
                 |
        1.female |   1.107553   .0057004    19.85   0.000     1.096436    1.118782
                 |
         race_g3 |
              1  |   1.350419    .021416    18.94   0.000      1.30909    1.393053
              2  |   .8064081   .0452681    -3.83   0.000     .7223909    .9001968
                 |
            HCC1 |   1.503716   .0791387     7.75   0.000     1.356339    1.667107
            HCC2 |   1.258664   .0187286    15.46   0.000     1.222487    1.295912
            HCC6 |   1.207728   .0428414     5.32   0.000     1.126613    1.294684
            HCC8 |    1.71561   .0291259    31.79   0.000     1.659463    1.773656
            HCC9 |   1.342532   .0188268    21.00   0.000     1.306134    1.379943
           HCC10 |   1.160602   .0158898    10.88   0.000     1.129872    1.192167
           HCC11 |   1.087874    .012616     7.26   0.000     1.063426    1.112884
           HCC12 |   .9630234   .0075698    -4.79   0.000     .9483006    .9779747
           HCC17 |   1.423063   .0537172     9.35   0.000      1.32158     1.53234
           HCC18 |   1.341645   .0111794    35.27   0.000     1.319911    1.363736
           HCC19 |   1.099683   .0085088    12.28   0.000     1.083132    1.116487
           HCC21 |   1.138505   .0253068     5.84   0.000     1.089969    1.189202
           HCC22 |   1.215423   .0167559    14.15   0.000     1.183022    1.248712
           HCC23 |   1.136072   .0153878     9.42   0.000      1.10631    1.166636
           HCC27 |   1.722167   .0618613    15.13   0.000     1.605091    1.847783
           HCC28 |   1.338315   .0382626    10.19   0.000     1.265384    1.415449
           HCC29 |   .9874623   .0504305    -0.25   0.805     .8934062     1.09142
           HCC33 |   1.375733   .0203939    21.52   0.000     1.336337    1.416291
           HCC34 |   1.579781   .0676153    10.68   0.000     1.452664    1.718022
           HCC35 |   1.215448   .0222906    10.64   0.000     1.172535    1.259931
           HCC39 |   1.068514   .0216219     3.27   0.001     1.026965    1.111744
           HCC40 |   1.266316   .0106212    28.15   0.000     1.245669    1.287305
           HCC46 |   1.374044   .0275533    15.85   0.000     1.321088    1.429123
           HCC47 |   1.243362   .0168345    16.09   0.000     1.210801    1.276799
           HCC48 |   1.082527   .0099153     8.66   0.000     1.063267    1.102136
           HCC54 |   1.701318   .0877631    10.30   0.000     1.537715    1.882327
           HCC55 |   1.619627   .0601255    12.99   0.000     1.505968    1.741864
           HCC57 |   1.814174   .0558452    19.35   0.000     1.707956    1.926997
           HCC58 |   1.497866   .0182766    33.11   0.000      1.46247     1.53412
           HCC70 |   1.546867   .1127301     5.99   0.000     1.340974    1.784373
           HCC71 |   1.504994   .0844128     7.29   0.000     1.348317    1.679876
           HCC72 |   1.291523   .0287121    11.51   0.000     1.236456    1.349041
           HCC73 |   1.755496   .1237321     7.98   0.000      1.52899    2.015555
           HCC74 |   1.763157   .1301663     7.68   0.000     1.525634    2.037659
           HCC75 |   1.202949   .0208867    10.64   0.000       1.1627     1.24459
           HCC76 |   1.268263   .1258703     2.39   0.017     1.044073    1.540593
           HCC77 |   1.381951   .0417811    10.70   0.000     1.302441    1.466316
           HCC78 |   1.685651   .0254326    34.61   0.000     1.636534    1.736243
           HCC79 |   1.510516   .0181087    34.40   0.000     1.475437    1.546428
           HCC80 |   1.202766   .0457742     4.85   0.000     1.116315    1.295913
           HCC82 |   .9624026   .0470862    -0.78   0.433     .8744021     1.05926
           HCC83 |   1.090416   .1231349     0.77   0.443     .8739172    1.360548
           HCC84 |   1.263314   .0143557    20.57   0.000     1.235488    1.291766
           HCC85 |   1.402394   .0112963    41.98   0.000     1.380428     1.42471
           HCC86 |   1.391214   .0249723    18.39   0.000      1.34312     1.44103
           HCC87 |   1.357012   .0184951    22.40   0.000     1.321242     1.39375
           HCC88 |   1.271229   .0209047    14.59   0.000      1.23091    1.312869
           HCC96 |   1.370161   .0075146    57.42   0.000     1.355511    1.384969
           HCC99 |   1.181883   .0295932     6.67   0.000     1.125282    1.241331
          HCC100 |   1.372398   .0143755    30.22   0.000      1.34451    1.400864
          HCC103 |   1.297408   .0244289    13.83   0.000     1.250401    1.346183
          HCC104 |   1.109581   .0529474     2.18   0.029     1.010511    1.218363
          HCC106 |   1.422613   .0349138    14.36   0.000     1.355802    1.492715
          HCC107 |   1.332103   .0160983    23.73   0.000     1.300921    1.364032
          HCC108 |   1.205742   .0097556    23.12   0.000     1.186772    1.225015
          HCC110 |   .9125563   .1404015    -0.59   0.552     .6749908    1.233734
          HCC111 |   1.598918   .0143628    52.25   0.000     1.571013    1.627317
          HCC112 |   1.264424   .0182914    16.22   0.000     1.229077    1.300787
          HCC114 |   1.168398   .0237018     7.67   0.000     1.122855    1.215789
          HCC115 |   1.173517   .0360753     5.20   0.000     1.104899    1.246397
          HCC122 |   1.196515   .0260805     8.23   0.000     1.146475     1.24874
          HCC124 |   1.108577   .0126599     9.03   0.000      1.08404     1.13367
          HCC134 |   2.629969   .0726833    34.99   0.000     2.491302    2.776354
          HCC135 |   1.396984    .015229    30.67   0.000     1.367453    1.427154
          HCC136 |   1.359538   .0419183     9.96   0.000     1.279813     1.44423
          HCC137 |   1.483905   .0274689    21.32   0.000     1.431032    1.538732
          HCC157 |   1.149086    .085646     1.86   0.062     .9929083     1.32983
          HCC158 |   1.155431   .0528434     3.16   0.002     1.056366    1.263786
          HCC161 |   1.309824   .0154626    22.86   0.000     1.279866    1.340484
          HCC162 |   1.022107   .1538723     0.15   0.885      .760944    1.372903
          HCC166 |    1.15597    .124873     1.34   0.180     .9353968    1.428555
          HCC167 |   1.253828   .0317328     8.94   0.000      1.19315    1.317592
          HCC169 |   1.424234   .0188127    26.77   0.000     1.387835    1.461587
          HCC170 |   1.193401   .0206483    10.22   0.000      1.15361    1.234565
          HCC173 |   1.067615   .0393861     1.77   0.076     .9931445     1.14767
          HCC176 |   1.295591    .019889    16.87   0.000      1.25719    1.335165
          HCC186 |   1.223751   .0464563     5.32   0.000     1.136003    1.318277
          HCC188 |   1.434574   .0325585    15.90   0.000     1.372159    1.499828
          HCC189 |   1.345353    .040622     9.82   0.000     1.268046    1.427374
                 |
    providertype |
              1  |   .9488242   .0275826    -1.81   0.071     .8962745    1.004455
              2  |   .8804759   .0246049    -4.56   0.000      .833548    .9300457
                 |
          n_pcps |   1.000072   .0000883     0.82   0.414     .9998991    1.000245
          n_spec |   1.000014   .0000276     0.51   0.607       .99996    1.000068
   lives_covered |   .9999991   4.46e-07    -2.05   0.040     .9999982           1
           _cons |   .2119345   .0052016   -63.21   0.000      .201981    .2223786
----------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Predictive margins                              Number of obs     =  1,948,146
Model VCE    : Robust

Expression   : Pr(ed_visits), predict()

----------------------------------------------------------------------------------
                 |            Delta-method
                 |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
            year |
           2013  |   .3135515   .0026731   117.30   0.000     .3083122    .3187907
           2014  |   .3150918   .0025892   121.69   0.000      .310017    .3201666
           2015  |   .3160702   .0026762   118.11   0.000      .310825    .3213153
           2016  |   .3179981   .0025568   124.37   0.000     .3129869    .3230094
                 |
     aco_exit_gr |
              0  |   .3140496   .0023686   132.59   0.000     .3094072     .318692
           2015  |   .3301272    .004731    69.78   0.000     .3208545    .3393998
                 |
year#aco_exit_gr |
      2013    0  |   .3110697   .0029213   106.48   0.000      .305344    .3167955
      2013 2015  |   .3338394   .0050582    66.00   0.000     .3239256    .3437532
      2014    0  |   .3131985   .0027926   112.15   0.000     .3077251     .318672
      2014 2015  |   .3305682   .0054933    60.18   0.000     .3198015    .3413348
      2015    0  |    .313712    .002959   106.02   0.000     .3079124    .3195115
      2015 2015  |   .3353499   .0051641    64.94   0.000     .3252285    .3454713
      2016    0  |   .3175727   .0028495   111.45   0.000     .3119878    .3231575
      2016 2015  |   .3214756   .0056506    56.89   0.000     .3104006    .3325505
----------------------------------------------------------------------------------

.         
.         
. log close
      name:  <unnamed>
       log:  U:\Yajuan\ACO Post Mortem\logs\003_Quality_Measures_paperuse_28 Sep 2021YS.log
  log type:  text
 closed on:  29 Sep 2021, 02:30:34

summary(bene_age$age_m)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
   65.0    68.0    73.0    75.2    81.0   113.0 
> sd(bene_age$age_m)
[1] 7.956494

A total of 152 patients with CLBP (mean [SD] age, 39.54 [12.52] years; 100 [65.8%] women) were included


1,594,009
119,228

table(benetable$female)

     0      1 
714726 998511 
> table(benetable$agegrp)

     0      1      2      3 
498710 401944 304531 508052 
> table(benetable$race_g3)

      0       1       2 
1482823  126123  104291 
> table(benetable$race_g3,useNA = "always")/dim(benetable)[1]

         0          1          2       <NA> 
0.86550956 0.07361679 0.06087366 0.00000000 
> table(benetable$female,useNA = "always")/dim(benetable)[1]

        0         1      <NA> 
0.4171787 0.5828213 0.0000000 
> table(benetable$female,useNA = "always")/dim(benetable)[1]

        0         1      <NA> 
0.4171787 0.5828213 0.0000000 
> table(benetable$agegrp,useNA = "always")/dim(benetable)[1]

        0         1         2         3      <NA> 
0.2910922 0.2346109 0.1777518 0.2965451 0.0000000



		Delta-method
	Margin	Std. Err.      z	P>z	[95% Conf.	Interval]
					
year	
2012	.8547424	.0004832  1769.03	0.000	.8537954	.8556894
2013	.8614223	.0004233  2034.89	0.000	.8605926	.862252
2014	.8637831	.000409  2111.70	0.000	.8629814	.8645848
2015	.8689427	.0003924  2214.27	0.000	.8681735	.8697118
2016	.8745031	.0003873  2258.18	0.000	.8737441	.8752621
	
ever_in_aco	
0	.8597154	.0002031  4232.01	0.000	.8593173	.8601136
1	.890179	.0004607  1932.12	0.000	.889276	.891082
	
year#ever_in_aco	
2012 0	.8479989	.0004622  1834.58	0.000	.8470929	.8489049
2012 1	.8857457	.0016755   528.64	0.000	.8824617	.8890296
2013 0	.8565831	.0004528  1891.83	0.000	.8556957	.8574705
2013 1	.8836782	.0011331   779.86	0.000	.8814573	.8858991
2014 0	.85858	.0004606  1864.18	0.000	.8576773	.8594827
2014 1	.8877205	.0008722  1017.83	0.000	.8860111	.8894299
2015 0	.8641511	.0004517  1913.07	0.000	.8632658	.8650364
2015 1	.8909974	.0007158  1244.82	0.000	.8895945	.8924002
2016 0	.8687606	.0004468  1944.49	0.000	.8678849	.8696363
2016 1	.900956	.0006795  1325.87	0.000	.8996241	.9022878
